[
  {
    "headline": "Rayner admits underpaying tax on Hove flat as PM backs her",
    "summary": "The deputy prime minister says she has referred herself for an ethics probe by the PM's adviser.",
    "url": "https://www.bbc.com/news/articles/cy50446rq73o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Analysis: Rayner's political future under threat after tax admission",
    "summary": "The deputy prime minister has referred herself for an ethics probe by the PM's adviser.",
    "url": "https://www.bbc.com/news/articles/c2lx1999ez8o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Online speech laws need to be reviewed after Linehan arrest, says Streeting",
    "summary": "The health secretary says ministers wanted police to focus on street crime rather than posts on social media.",
    "url": "https://www.bbc.com/news/articles/cx2922w73e1o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Ministers favour merging all UK steel companies into one",
    "summary": "The government believes the struggling sector's six companies should be merged together, sources tell the BBC.",
    "url": "https://www.bbc.com/news/articles/c4gqe91kp57o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Hundreds of Parliament security staff go on strike",
    "summary": "Hundreds of security staff are set to take action in a dispute over pay and conditions.",
    "url": "https://www.bbc.com/news/articles/cz9393lwxw2o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Chris Mason: Starmer faces pressure to deliver as he tries to strike contrast with Reform",
    "summary": "The prime minister is frustrated he hasn't been able to deliver more change up to now.",
    "url": "https://www.bbc.com/news/articles/c8jpj8knvn8o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "UK suspends refugee family reunion applications",
    "summary": "Yvette Cooper outlines her plans as MPs return to Parliament after a summer of protests at asylum hotels.",
    "url": "https://www.bbc.com/news/articles/c626p66d6jxo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "'Parliament building inaccessible to me,' MP says",
    "summary": "Marie Tidball MP was born with a congenital disability and wants Parliament to be more accessible.",
    "url": "https://www.bbc.com/news/articles/crkz1j18g0do?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Clarkson for PM, attacks on police dogs: Do Parliament petitions make a difference?",
    "summary": "People love signing petitions to get issues they care about debated by MPs - but some can't resist having a laugh.",
    "url": "https://www.bbc.com/news/articles/cg4xqn91rwlo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Suranne Jones: Playing the prime minister changes your perception of politics",
    "summary": "Suranne Jones plays the Prime Minister whose husband is kidnapped in new political thriller, Hostage.",
    "url": "https://www.bbc.com/news/articles/cy5p7ze0ww4o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Asylum hotel ruling leaves ministers with major headache",
    "summary": "The government will now have to find new places to house asylum seekers, while hoping other areas don't take similar legal action.",
    "url": "https://www.bbc.com/news/articles/cy40wx73mwzo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Starmer hails breakthrough on Ukraine - but anxiety over its future remains",
    "summary": "Donald Trump's commitment to Ukraine's security is key to a lasting peace, the UK prime minister says.",
    "url": "https://www.bbc.com/news/articles/cr5rl6y04z0o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Chris Mason: Trump visit provides Starmer with invaluable access",
    "summary": "The PM's time with the president helped burnish a relationship as solid as it is improbable.",
    "url": "https://www.bbc.com/news/articles/cdrkj4nvy22o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Who is in charge? The prime minister's authority is in question again",
    "summary": "It's been a week of dismissals, disagreements and backbench bust-ups, writes Laura Kuenssberg.",
    "url": "https://www.bbc.com/news/articles/czxwe3g4wl5o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Watch: Nigel Farage and US congressman clash on freedom of speech",
    "summary": "The Reform UK leader has appeared before the US House Judiciary Committee to discuss freedom of speech and online safety laws.",
    "url": "https://www.bbc.com/news/videos/c0ez8wj275zo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "MSP accused of hiding camera in parliament toilet",
    "summary": "The MSP said he was \"fully co-operating\" with officers and is due to appear at court at a later date.",
    "url": "https://www.bbc.com/news/videos/cpwyg795wpwo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Trump pledges not to pull US troops out of Poland",
    "summary": "American troops will \"be staying in Poland\" — and potentially more could be stationed there, U.S. president says.",
    "url": "https://www.politico.eu/article/donald-trump-defense-us-troops-poland-war-ukraine/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
    "source": "politico.eu"
  },
  {
    "headline": "Farage compares UK to North Korea in front of US congress",
    "summary": "Farage warned the U.K.’s Online Safety Act would “damage trade between our countries.\" can be the dek",
    "url": "https://www.politico.eu/article/nigel-farage-north-korea-us-congress-uk-politics-speech/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
    "source": "politico.eu"
  },
  {
    "headline": "Ireland’s motley crew of candidates face Oct. 24 presidential election",
    "summary": "Heather Humphreys and Catherine Connolly are the only two confirmed contenders to become Ireland's next head of state, but the field is about to get more crowded.",
    "url": "https://www.politico.eu/article/ireland-presidential-election-candidate-catherine-connolly-heather-humphreys/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
    "source": "politico.eu"
  },
  {
    "headline": "First Chinese delegation in 7 years to visit European Parliament",
    "summary": "Meetings later this year will focus on Ukraine and trade.",
    "url": "https://www.politico.eu/article/first-chinese-delegation-7-years-visit-european-parliament/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
    "source": "politico.eu"
  },
  {
    "headline": "Зеленський призначив військовим омбудсманом Ольгу Решетилову",
    "summary": "Президент Володимир Зеленський призначив на посаду військового омбудсмана правозахисницю Ольгу Решетилову. Джерело: глава держави в Telegram Пряма мова: \"Підписав указ про призначення Ольги Решетилової (Кобилинської) уповноваженою президента України з питань захисту прав військовослужбовців та членів сімей наших вої…",
    "url": "http://www.pravda.com.ua/news/2024/12/30/7491385/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "Шантаж, революція та вибори з російським впливом: чого чекати Україні від сусідів у 2025 році",
    "summary": "Якщо минулий рік називали \"роком виборів\", то 2025-й стане роком змін. Обрання нового президента США вже стало каталізатором багатьох процесів...",
    "url": "https://www.eurointegration.com.ua/articles/2024/12/30/7201575/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "Обмін полоненими з РФ: Україна повернула 189 своїх громадян",
    "summary": "Внаслідок нового обміну військовополонених у понеділок 30 грудня Україна повернула 189 своїх оборонців. Джерело: президент Володимир Зеленський у Telegram, Координаційний штаб з питань поводження з військовополоненими, омбудсман Дмитро Лубінець Пряма мова Зеленського: \"Повернення наших людей з російського полону - ц…",
    "url": "http://www.pravda.com.ua/news/2024/12/30/7491376/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "L’Institut européen des sciences humaines, école d’imams soupçonnée de légitimer « le djihad armé », dissoute en conseil des ministres",
    "summary": "La dissolution de l’IESH marque une nouvelle étape dans la lutte contre l’influence des Frères musulmans sur le territoire, selon le ministre de l’intérieur.",
    "url": "https://www.lemonde.fr/religions/article/2025/09/03/l-institut-europeen-des-sciences-humaines-ecole-d-imams-soupconnee-de-legitimer-le-djihad-arme-dissoute-en-conseil-des-ministres_6638746_1653130.html",
    "source": "lemonde.fr"
  }
]