{
  "updatedAt": "2025-10-30T18:38:11.544Z",
  "items": [
    {
      "title": "Why Trump’s Boat Killings Would Be Hard to Prosecute",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/trump-boat-killings-prosecutions.html",
      "summary": "Even if critics who call President Trump’s boat attacks “murder” are right as a matter of law, it would not be easy to get the matter into a court."
    },
    {
      "title": "How States Are Preparing for a Freeze in SNAP Food Assistance",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/snap-states.html",
      "summary": "The Supplemental Nutritional Assistance Program will run out of money on Saturday. Some governors are shifting state money to cover part of the shortfall, bolster food pantries or both."
    },
    {
      "title": "What’s Andrew Cuomo’s Plan to Help New York City Renters?",
      "url": "https://www.nytimes.com/video/us/politics/100000010449816/whats-andrew-cuomos-plan-to-help-new-york-city-renters.html",
      "summary": "Andrew Cuomo says he’ll make rent-stabilization more fair if he is mayor, but his plan could make finding an apartment in New York City even more difficult."
    },
    {
      "title": "Little Word of a TikTok Deal Out of Trump-Xi Meeting",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/trump-xi-tiktok-deal.html",
      "summary": "Neither President Trump nor Chinese officials indicated any new developments for the popular video app. Treasury Secretary Scott Bessent previously suggested they could “consummate” transfer of control from its Chinese owner."
    },
    {
      "title": "As ICE Raids Upend L.A., Mexican Immigrants Vent, and a Diplomat Listens",
      "url": "https://www.nytimes.com/2025/10/30/us/immigration-raids-los-angeles-mexican-diplomat.html",
      "summary": "Weekly public meetings at the Mexican consulate in Los Angeles have become a place where immigrants ask for help with a host of problems, big and small."
    },
    {
      "title": "Judge Skeptical Over Trump Administration Decision to Suspend Food Stamps",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/food-stamps-shutdown.html",
      "summary": "The arguments at times appeared to frustrate the judge, who promised to rule soon on a suit filed by roughly two dozen states seeking to ensure people don’t go hungry as a result of a budgetary dispute."
    },
    {
      "title": "Senate passes bill to nullify Trump’s sweeping global tariffs on more than 100 nations – US politics live",
      "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
      "summary": "&lt;p&gt;Vote passes 51-47 in latest bipartisan effort to end tariffs, after resolutions on repealing Canada and Brazil tariffs passed earlier this week&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/30/us-government-shutdown-snap-health-insurance\"&gt;US government shutdown: tell us how it could affect your access to food or health insurance&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;In the days leading up to the Trump-Xi meeting, American officials signalled that the US president did not intend to make good on a recent threat to impose an additional 100% import tax on Chinese goods.&lt;/p&gt;&lt;p&gt;Also that China had shown signs it is willing to relax its export controls on rare earths as well as revive buying soybeans from the US.&lt;/p&gt;&lt;p&gt;The relationship with China is very good.&lt;/p&gt;&lt;p&gt;Because of the tremendous destructive power, I HATED to do it, but had no choice! Russia is second, and China is a distant third, but will be even within 5 years.&lt;/p&gt;&lt;p&gt;Because of other countries testing programs, I have instructed the Department of War to start testing our Nuclear Weapons on an equal basis. That process will begin immediately.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "New York declares state of emergency to issue food banks $65m amid shutdown",
      "url": "https://www.theguardian.com/us-news/2025/oct/30/new-york-food-banks-emergency-shutdown",
      "summary": "&lt;p&gt;Oregon and Virginia also issued emergency declarations to fund food assistance as shutdown imperils Snap benefits&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/30/us-government-shutdown-snap-health-insurance\"&gt;Share how government shutdown could affect your access to food or health insurance&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates\"&gt;US politics live – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;New York’s governor, Kathy Hochul, on Thursday declared a state of emergency to free up funds so that she could issue $65m in assistance to food banks because federal funding for the national food stamp program is &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/24/government-shutdown-food-stamps-snap\"&gt;set to lapse&lt;/a&gt; on 1 November.&lt;/p&gt;&lt;p&gt;Oregon and Virginia have also issued emergency declarations to release state cash to go towards emergency food assistance as the federal &lt;a href=\"https://www.theguardian.com/us-news/us-federal-government-shutdown-2025\"&gt;government shutdown&lt;/a&gt; imperils Supplemental Nutrition Assistance Program (Snap) benefits for nearly 42 million Americans.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/30/new-york-food-banks-emergency-shutdown\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}