{
  "updatedAt": "2025-10-05T18:32:40.322Z",
  "items": [
    {
      "title": "Trump Sends California Guard Troops to Portland, Ore., Newsom Says",
      "url": "https://www.nytimes.com/2025/10/05/us/trump-national-guard-california-oregon-newsom.html",
      "summary": "The move follows a judge’s order on Saturday blocked the Oregon National Guard from deploying there. California’s governor said the state would sue."
    },
    {
      "title": "Pritzker Says Federal Agents Are Trying to Make Chicago a ‘War Zone’",
      "url": "https://www.nytimes.com/2025/10/05/us/politics/pritzker-chicago-immigration.html",
      "summary": "Gov. JB Pritzker of Illinois said he had ordered state agencies to investigate a raid on a Chicago apartment building where there had been reports of children zip tied “nearly naked” by federal officers."
    },
    {
      "title": "Both Parties Are Resigned to Deadlock as Government Shutdown Takes Hold",
      "url": "https://www.nytimes.com/2025/10/05/us/politics/parties-deadlock-shutdown.html",
      "summary": "Republicans, who hold a governing trifecta, have adopted a mostly passive stance while Democrats dig in for a fight, with both feeling they have the political upper hand."
    },
    {
      "title": "Bear Fatally Mauls Camper in the Ozarks in Arkansas",
      "url": "https://www.nytimes.com/2025/10/05/us/deadly-bear-attack-arkansas.html",
      "summary": "The authorities, joined by local hunters and their dogs, are searching for the bear after a 60-year-old man was found dead."
    },
    {
      "title": "White House to send delegation to Egypt for Gaza cease-fire talks.",
      "url": "https://www.nytimes.com/live/2025/10/05/us/trump-news/white-house-to-send-delegation-to-egypt-for-gaza-cease-fire-talks",
      "summary": ""
    },
    {
      "title": "Not All National Parks Remain Open in the Shutdown. Here’s What to Know.",
      "url": "https://www.nytimes.com/2025/10/05/us/shutdown-national-parks.html",
      "summary": "Some underground attractions are closed, and many outdoor sites have reduced their services."
    },
    {
      "title": "House speaker says Democrats are not serious about negotiating as shutdown continues",
      "url": "https://www.theguardian.com/us-news/2025/oct/05/mike-johnson-democrats-government-shutdown",
      "summary": "&lt;p&gt;Mike Johnson adds Trump does not want permanent job cuts as talks between parties stalled over weekend&lt;/p&gt;&lt;p&gt;The Republican House speaker, &lt;a href=\"https://www.theguardian.com/us-news/mike-johnson\"&gt;Mike Johnson&lt;/a&gt;, accused &lt;a href=\"https://www.theguardian.com/us-news/democrats\"&gt;Democrats&lt;/a&gt; of being “not serious” in negotiations to end the federal government &lt;a href=\"https://www.theguardian.com/us-news/us-federal-government-shutdown-2025\"&gt;shutdown&lt;/a&gt;, now on its fifth day and expected to last through next week or beyond.&lt;/p&gt;&lt;p&gt;Talks between the opposing political parties stalled over the weekend, with no votes anticipated to end the standoff. A CBS poll found just 28% of Democratic voters and 23% of Republicans consider their party’s positions worth shutting down the government.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/05/mike-johnson-democrats-government-shutdown\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Bad Bunny pushes back on Kristi Noem threat that immigrants stay away from Super Bowl",
      "url": "https://www.theguardian.com/us-news/2025/oct/05/bad-bunny-kristi-noem-super-bowl",
      "summary": "&lt;p&gt;Singer jokes on SNL that everyone was happy about his planned half-time show, ‘even Fox News’&lt;/p&gt;&lt;p&gt;Bad Bunny responded to homeland security secretary Kristi Noem’s &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/04/kristi-noem-super-bowl-ice\"&gt;threats&lt;/a&gt; to send federal immigration enforcement agents to the Super Bowl next year, joking during Saturday Night Live that everyone was happy about his planned half-time performance, “even Fox News”.&lt;/p&gt;&lt;p&gt;The 31-year-old Puerto Rican singer who has criticized the Trump administration’s aggressive immigration policies hosted the season premiere of Saturday Night Live, using his opening monologue to address controversy around his 2026 Super Bowl performance.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/05/bad-bunny-kristi-noem-super-bowl\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}