{
  "updatedAt": "2025-10-19T06:35:43.639Z",
  "items": [
    {
      "title": "Vance Flexes the Marines’ Might as Thousands Protest Trump’s Agenda",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/vance-marines-california-protests.html",
      "summary": "Vice President JD Vance’s trip to a military base in California illustrated rising tensions between the federal government and Democratic leaders."
    },
    {
      "title": "Woman Who Tried to Blame Twin for Fatal Buggy Crash Sentenced to 4 Years",
      "url": "https://www.nytimes.com/2025/10/18/us/minnesota-amish-buggy-crash-sentence.html",
      "summary": "The crash killed two Amish children and injured two others in rural Minnesota in 2023."
    },
    {
      "title": "White House and Government Agencies Join Bluesky, Then Attack Democrats",
      "url": "https://www.nytimes.com/2025/10/18/us/politics/trump-administration-bluesky.html",
      "summary": "The Health and Human Services and Homeland Security Departments were among the agencies posting messages that blamed Democrats for the federal shutdown."
    },
    {
      "title": "Jury Awards $19.7 Million to 6 Bystanders in Denver Police Shooting",
      "url": "https://www.nytimes.com/2025/10/18/us/denver-police-shooting-award.html",
      "summary": "The bystanders were injured when a Denver police officer fired, while facing a crowd of people, at an armed man outside a bar in 2022."
    },
    {
      "title": "Case Against Bolton Raises Questions Over Justice Dept.’s Use of Espionage Act",
      "url": "https://www.nytimes.com/2025/10/18/us/bolton-indictment-justice-dept-espionage-act.html",
      "summary": "The allegations in his case are a pointed example of when classified information tumbles into nonsecure places, either by accident or from recklessness by someone trusted to keep it safe."
    },
    {
      "title": "U.S. Is Repatriating Survivors of Its Strike on Suspected Drug Vessel",
      "url": "https://www.nytimes.com/2025/10/18/us/politics/boat-strike-survivors.html",
      "summary": "Two men rescued by the U.S. military after it attacked a boat in the Caribbean Sea were being sent to their home countries of Colombia and Ecuador, President Trump said."
    },
    {
      "title": "California governor says Trump ‘putting ego over responsibility’ as military show shuts highway",
      "url": "https://www.theguardian.com/us-news/2025/oct/18/california-highway-closure-military-celebration",
      "summary": "&lt;p&gt;Gavin Newsom says safety concerns forced state officials to close a portion of the busy Interstate 55 on Saturday&lt;/p&gt;&lt;p&gt;The California governor, Gavin Newsom, has accused Donald Trump of “putting his ego over responsibility” over a military showcase that involved firing live artillery shells over a major highway in the state’s south.&lt;/p&gt;&lt;p&gt;Newsom said safety concerns over the event forced state officials to close a portion of the busy Interstate 5 near the US Marine Camp Pendleton base on Saturday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/18/california-highway-closure-military-celebration\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: Inflatable costumes aplenty as millions march against president",
      "url": "https://www.theguardian.com/us-news/2025/oct/19/trump-briefing-news-at-a-glance-latest",
      "summary": "&lt;p&gt;Republicans mostly silent as protesters turn out in every state to peacefully reject authoritarianism in No Kings rallies. Key US politics stories from Saturday 18 October at a glance&lt;/p&gt;&lt;p&gt;Americans in every state &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/18/no-kings-protests-events-states\"&gt;marched in protest&lt;/a&gt; against the Trump administration, giving voice to concerns that the country is sliding into authoritarianism.&lt;/p&gt;&lt;p&gt;Millions turned out nationwide with signs, marching bands, a huge banner with the US constitution’s preamble that people could sign, and inflatable costumes ranging from bananas to SpongeBob SquarePants to frogs, which have in particular emerged as a sign of resistance beginning in Portland, Oregon.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/19/trump-briefing-news-at-a-glance-latest\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}