{
  "updatedAt": "2025-12-05T12:57:23.420Z",
  "items": [
    {
      "title": "What We Know About the Arrest in the D.C. Pipe Bomb Case",
      "url": "https://www.nytimes.com/2025/12/05/us/politics/dc-pipe-bomb-arrest-suspect.html",
      "summary": "The arrest came after years of false leads and speculation over who planted the bombs near the Capitol before the Jan. 6 riot."
    },
    {
      "title": "Here’s How Trump Has Made it Harder for Migrants Seeking Asylum and Citizenship",
      "url": "https://www.nytimes.com/2025/12/05/us/politics/trump-immigration-changes.html",
      "summary": "In the wake of the National Guard shooting, the Trump administration has temporarily frozen major pathways for many migrants to obtain legal status in the United States."
    },
    {
      "title": "Trump’s Approval Rating Dips as Views of His Handling of the Economy Sour",
      "url": "https://www.nytimes.com/2025/12/05/us/politics/trump-approval-rating.html",
      "summary": "The shift, while small, is notable after months of stability in President Trump’s approval rating."
    },
    {
      "title": "How Kit Kat Was Killed: Video Shows What a Waymo Couldn’t See",
      "url": "https://www.nytimes.com/2025/12/05/us/waymo-kit-kat-san-francisco.html",
      "summary": "Surveillance video shows a woman crouching beside a Waymo self-driving taxi, trying to lure a beloved neighborhood cat to safety. A second later, the car drove off."
    },
    {
      "title": "As Trump Covets Nobel Peace Prize, FIFA Cozies Up to Him With Its Own Award",
      "url": "https://www.nytimes.com/2025/12/05/us/politics/trump-fifa-peace-prize-world-cup-infantino.html",
      "summary": "Gianni Infantino, head of soccer’s governing body, has been ingratiating himself with the president to help ensure a successful 2026 World Cup."
    },
    {
      "title": "Human Remains Found Buried at San Diego Home",
      "url": "https://www.nytimes.com/2025/12/04/us/human-remains-investigation-san-diego-home.html",
      "summary": "Prosecutors are looking at potential connections to a former resident, who faces a murder charge in another case."
    },
    {
      "title": "US supreme court approves redrawn Texas congressional maps | First Thing",
      "url": "https://www.theguardian.com/us-news/2025/dec/05/first-thing-us-supreme-court-approves-redrawn-texas-congressional-maps",
      "summary": "&lt;p&gt;Major win for Trump as majority rejects lower-court ruling that found maps had been racially gerrymandered. Plus, the story of Mr DeepFakes, the world’s most notorious AI porn site&lt;/p&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;Texas can use a redrawn congressional map that adds as many as five Republican-friendly congressional districts, the &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/04/us-supreme-court-texas-congressional-maps\"&gt;supreme court ruled&lt;/a&gt; yesterday, handing Donald Trump a major win in his push to boost Republican seats ahead of next year’s midterm elections.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What did the lower court rule?&lt;/strong&gt; The lower district court previously found that Texas had likely sorted voters based on their race – an unlawful practice called racial gerrymandering – when it adopted the new maps, and ordered the state to use the maps it had adopted after the 2020 census for next year’s election.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Why was the boat targeted?&lt;/strong&gt; “Intelligence confirmed that the vessel was carrying illicit narcotics and transiting along a known narco-trafficking route in the eastern Pacific. Four male narco-terrorists aboard the vessel were killed,” the statement said.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What else is happening?&lt;/strong&gt; Vladimir Putin is &lt;a href=\"https://www.theguardian.com/world/live/2025/dec/05/vladimir-putin-narendra-modi-russia-india-us-ukraine-trade-latest-news-updates?filterKeyEvents=false&amp;amp;page=with%3Ablock-6932a60d8f0808f97b5eacde#block-6932a60d8f0808f97b5eacde\"&gt;visiting Delhi&lt;/a&gt; for a summit with India’s prime minister, Narendra Modi. It comes as Washington seeks to increase pressure on India to cut back trade with Russia. It is the first time Putin has visited India since his full-scale invasion of Ukraine in 2022, and marks another step for him on the international stage since starting a war that has turned Russia into a global pariah.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/05/first-thing-us-supreme-court-approves-redrawn-texas-congressional-maps\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US leader of global neo-Nazi terrorist group signals retribution for arrests",
      "url": "https://www.theguardian.com/us-news/2025/dec/05/neo-nazi-base-leader-on-terrorism-arrest",
      "summary": "&lt;p&gt;Rinaldo Nazzaro says detention of suspected Base members in Spain justifies ‘resistance … by any means necessary’&lt;/p&gt;&lt;p&gt;After Spanish police and Europol’s counter-terrorism section arrested &lt;a href=\"https://www.theguardian.com/world/2025/dec/01/suspected-members-of-neo-nazi-terror-group-the-base-arrested-in-spain\"&gt;three suspected members&lt;/a&gt; of the Base – a globally proscribed neo-Nazi terrorist group – in the eastern province of Castellón, its American leader living in Russia was defiant and signaled further actions.&lt;/p&gt;&lt;p&gt;In a text message to the Guardian, &lt;a href=\"https://www.theguardian.com/world/2020/jan/23/revealed-the-true-identity-of-the-leader-of-americas-neo-nazi-terror-group\"&gt;Rinaldo Nazzaro&lt;/a&gt; called the arrests another “example of political persecution” by world governments that are “further justifying our resistance to its hegemonic rule by any means necessary”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/05/neo-nazi-base-leader-on-terrorism-arrest\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}