{
  "updatedAt": "2025-09-29T06:40:05.475Z",
  "items": [
    {
      "title": "Trump Raises Possibility of Inquiry Into Wray, Another Former F.B.I. Director",
      "url": "https://www.nytimes.com/2025/09/28/us/politics/trump-wray-fbi.html",
      "summary": "In a phone interview with NBC, Mr. Trump said an investigation of Christopher Wray could be underway, days after the Justice Department’s indictment of James B. Comey."
    },
    {
      "title": "What We Know About the Suspect in the Michigan Church Shooting",
      "url": "https://www.nytimes.com/2025/09/28/us/what-we-know-suspect-michigan-church-shooting.html",
      "summary": "The suspect, a 40-year-old man, was killed during the attack, officials said."
    },
    {
      "title": "Stowaway Found Dead in Wheel Well of American Airlines Jet, Police Say",
      "url": "https://www.nytimes.com/2025/09/28/us/american-airlines-stowaway-dead-charlotte.html",
      "summary": "The body was found on Sunday at Charlotte Douglas International Airport in the landing gear compartment of a plane that had recently arrived from Europe, the police said."
    },
    {
      "title": "The Michigan Attack Targeted a Latter-day Saint Church",
      "url": "https://www.nytimes.com/2025/09/28/us/latter-day-saints-church-grand-blanc-township.html",
      "summary": "The building in Grand Blanc Township served a congregation of about 150 members. And that number was growing, according to a frequent visitor."
    },
    {
      "title": "Missouri Governor Signs Congressional Map Redrawn to Boost Republicans",
      "url": "https://www.nytimes.com/2025/09/28/us/missouri-redistricting-governor-congress.html",
      "summary": "Republicans intend to flip a congressional seat in the Kansas City area, but opponents are trying to stop the new map from taking effect."
    },
    {
      "title": "Shooting in Michigan Is the Latest Attack on a Religious Institution",
      "url": "https://www.nytimes.com/2025/09/28/us/churches-schools-shootings.html",
      "summary": "Places of worship and religious schools have been the targets of a series of recent shooting attacks across the country."
    },
    {
      "title": "At least four dead and eight injured after shooting at Mormon church in Michigan",
      "url": "https://www.theguardian.com/us-news/2025/sep/28/mass-shootings-north-carolina-texas-new-orleans",
      "summary": "&lt;p&gt;Church allegedly set ablaze by gunman on weekend when shooting attacks also took place in North Carolina, Texas and New Orleans&lt;/p&gt;&lt;p&gt;At least four people were killed and eight others injured after a gunman opened fire at a Mormon church in &lt;a href=\"https://www.theguardian.com/us-news/michigan\"&gt;Michigan&lt;/a&gt; and then set the building ablaze, authorities said.&lt;/p&gt;&lt;p&gt;Two of the shooting victims died and eight others were hospitalised, officials said initially, while the gunman was shot dead by police. Several hours after the shooting, police reported finding at least two more bodies in the charred remains of the church, which had not yet been cleared and may contain other victims.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/28/mass-shootings-north-carolina-texas-new-orleans\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: more than 100,000 federal workers to quit on Tuesday in largest ever mass resignation",
      "url": "https://www.theguardian.com/us-news/2025/sep/29/president-trump-administration-news-updates-today",
      "summary": "&lt;p&gt;Latest departures in Trump administration’s deferred resignation program come as Congress faces government shutdown deadline – key US politics stories from Sunday 28 September&lt;/p&gt;&lt;p&gt;More than 100,000 federal workers are to formally resign on Tuesday, the largest such mass event in US history, as part of a Trump administration program designed to make sweeping cuts to the federal workforce.&lt;/p&gt;&lt;p&gt;With Congress facing a deadline of Tuesday to authorize more funding or spark a &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/27/government-shutdown-explainer\"&gt;government shutdown&lt;/a&gt;, the White House has also ordered federal agencies to draw up plans for large-scale firings of workers if the partisan fight fails to yield a deal.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/29/president-trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}