{
  "updatedAt": "2025-11-03T06:40:39.141Z",
  "items": [
    {
      "title": "Judge Extends Block of Trump’s National Guard Deployment to Portland",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/trump-oregon-national-guard-deployment.html",
      "summary": "A judge in Oregon said she would issue a final ruling on the matter by Friday. But she suggested that she would ultimately make the block permanent."
    },
    {
      "title": "On ’60 Minutes,’ Trump Says War With Venezuela Is Unlikely but Suggests Maduro’s Time Is Up",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/trump-venezuela-shutdown-nuclear.html",
      "summary": "In an interview with “60 Minutes,” President Trump was circumspect on potential escalation targeting Venezuela. He was also pressed on deportations, the government shutdown and his recent demand for nuclear tests."
    },
    {
      "title": "Explosion at Harvard Building Affected Small Section of Hallway, Officials Say",
      "url": "https://www.nytimes.com/2025/11/02/us/explosion-harvard-damage.html",
      "summary": "There was no structural damage to the building, they said, as investigators pursued two suspects."
    },
    {
      "title": "New Weapons Testing Ordered by Trump Won’t Include Nuclear Explosions, Wright Says",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/trump-nuclear-testing-explosions.html",
      "summary": "Energy Secretary Chris Wright said the testing ordered up in a surprise announcement by President Trump last week would focus on “the other parts” of nuclear weaponry."
    },
    {
      "title": "Indiana Republican Tries Different Approach in Debate on Voting Maps: Listening",
      "url": "https://www.nytimes.com/2025/11/02/us/indiana-redistricting-terre-haute.html",
      "summary": "As redistricting efforts spread across the country, an Indiana state senator said he isn’t sure how he will vote on a plan that President Trump supports."
    },
    {
      "title": "Syria’s President to Visit Washington for First Time Since Taking Power",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/syrian-president-al-shara-washington-visit.html",
      "summary": "The president, Ahmed al-Shara, was until recently wanted by the United States as a terrorist with a $10 million bounty on his head."
    },
    {
      "title": "Top 10 US billionaires’ collective wealth grew by $698bn in past year – report",
      "url": "https://www.theguardian.com/us-news/2025/nov/03/wealth-billionaires-increase-trump",
      "summary": "&lt;p&gt;Oxfam warns Trump policies risk driving inequality to new heights – but Democrats have also exacerbated wealth gap&lt;/p&gt;&lt;p&gt;The collective wealth of the top 10 US billionaires has soared by $698bn in the past year, according to a new &lt;a href=\"https://www.oxfamamerica.org/explore/research-publications/unequal-the-rise-of-a-new-american-oligarchy-and-the-agenda-we-need/\"&gt;report&lt;/a&gt; from Oxfam America published on Monday on the growing wealth divide.&lt;/p&gt;&lt;p&gt;The report warns that &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; policies risk driving US &lt;a href=\"https://www.theguardian.com/inequality\"&gt;inequality&lt;/a&gt; to new heights, but points out that both &lt;a href=\"https://www.theguardian.com/us-news/republicans\"&gt;Republican&lt;/a&gt; and &lt;a href=\"https://www.theguardian.com/us-news/democrats\"&gt;Democratic&lt;/a&gt; administrations have exacerbated the US’s growing wealth gap.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/03/wealth-billionaires-increase-trump\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump says Maduro’s days are numbered but ‘doubts’ US will go to war with Venezuela",
      "url": "https://www.theguardian.com/us-news/2025/nov/03/trump-us-venezuela-maduro-doubts-war",
      "summary": "&lt;p&gt;President’s remarks, made during CBS interview released on Sunday, come as the US amasses military units in Caribbean&lt;/p&gt;&lt;p&gt;Donald Trump has sent mixed signals about potential US intervention in Venezuela, playing down concerns of imminent war against the South American nation but saying its leader Nicolás Maduro’s days were numbered.&lt;/p&gt;&lt;p&gt;The president’s remarks, made during a CBS interview released on Sunday, come as the US &lt;a href=\"https://www.theguardian.com/world/2025/nov/01/trump-maduro-venezuela-coups\"&gt;amasses military units in the Caribbean&lt;/a&gt; and has conducted multiple strikes on alleged drug-trafficking vessels, &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/27/rand-paul-trump-military-airstrikes-venezuela\"&gt;killing dozens&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/03/trump-us-venezuela-maduro-doubts-war\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}