{
  "updatedAt": "2025-11-22T18:35:31.219Z",
  "items": [
    {
      "title": "In the House, Censures Proliferate, Reflecting a Poisonous Climate",
      "url": "https://www.nytimes.com/2025/11/22/us/politics/house-censures.html",
      "summary": "Formal reprimands, once rare, dominated the chamber’s agenda this week, prompting lawmakers in both parties to call for changes to the way the House handles such actions."
    },
    {
      "title": "Marjorie Taylor Greene’s Resignation Hints at Divisions in Trump’s Movement",
      "url": "https://www.nytimes.com/2025/11/22/us/politics/marjorie-taylor-greene-trump-republicans.html",
      "summary": "As the president forced a onetime loyalist from Congress, her defiant departure signaled a coming debate over Republican identity in a post-Trump era."
    },
    {
      "title": "U.S. and Ukrainian Officials to Meet Again on U.S. Peace Plan",
      "url": "https://www.nytimes.com/2025/11/22/us/politics/us-ukraine-peace-plan.html",
      "summary": "In the Trump administration’s latest effort to pressure Ukraine into accepting a 28-point peace plan, officials from the two countries will hold talks in Geneva."
    },
    {
      "title": "Chicago Shootings Leave One Dead and 8 Teenagers Wounded",
      "url": "https://www.nytimes.com/2025/11/22/us/chicago-state-street-shooting.html",
      "summary": "Seven people, ages 13 to 17 were shot at a downtown gathering by the Chicago Theater. A second shooting left a man dead and another teenager in serious condition."
    },
    {
      "title": "New Orleans, a City of Service Workers, Braces for an Immigration Crackdown",
      "url": "https://www.nytimes.com/2025/11/22/us/new-orleans-immigration-border-patrol.html",
      "summary": "Louisiana officials have been eager for a federal intervention, but planned Border Patrol operations have stoked fear in the city’s immigrant work force."
    },
    {
      "title": "Trump Offers a Ukraine Peace Plan the Kremlin Can Love",
      "url": "https://www.nytimes.com/2025/11/22/us/politics/trump-ukraine-russia-peace-plan-kremlin.html",
      "summary": "While President Trump at times suggested he was willing to bolster support for Ukraine, he has repeatedly accommodated Russia’s demands."
    },
    {
      "title": "Stepbrother investigated in death of Florida high schooler on cruise ship",
      "url": "https://www.theguardian.com/us-news/2025/nov/22/stepbrother-investigated-cruise-anna-kepner",
      "summary": "&lt;p&gt;Anna Kepner, 18, from Titusville, was found dead of asphyxiation under a bed on a Carnival cruise ship&lt;/p&gt;&lt;p&gt;The 16-year-old stepbrother of a Florida teenager found dead aboard a Carnival cruise ship this month has been identified as a suspect in her death.&lt;/p&gt;&lt;p&gt;Anna Kepner, an 18-year-old from Titusville, was found dead under a bed on the Carnival Horizon on 8 November, wrapped in a blanket and covered by life vests, &lt;a href=\"https://abcnews.go.com/US/teen-found-dead-carnival-cruise-died-asphyxiation/story?id=127759360\"&gt;ABC News&lt;/a&gt; reported. Preliminary findings indicate she died of asphyxiation from a bar hold – an arm across the neck – with investigators noting two bruises on the side of her neck. A final autopsy and toxicology report are still pending.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/22/stepbrother-investigated-cruise-anna-kepner\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "‘This is not right’: grassroots campaign aims to repeal Missouri Republicans’ gerrymandering",
      "url": "https://www.theguardian.com/us-news/2025/nov/22/missouri-voting-map-republicans",
      "summary": "&lt;p&gt;A new congressional map was abruptly passed by Republicans in mid-September – but voters have a chance to rebuke politicians and stop it from going into effect&lt;/p&gt;&lt;p&gt;When canvassers fan out across neighborhoods, they usually rely on sophisticated lists that will tell them things like a voter’s political party and how likely they are to support a given cause. Jill Imbler isn’t bothering with any of that.&lt;/p&gt;&lt;p&gt;The 69-year-old has lived in Moberly – a Missouri town of about 14,000 people – her entire life. She doesn’t use a GPS when she drives around, knows where people live, and what time they’re likely to be home. And there’s a pretty good chance that she,&lt;strong&gt; &lt;/strong&gt;or one of her six siblings, knows them personally.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/22/missouri-voting-map-republicans\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}