{
  "updatedAt": "2025-11-06T06:39:43.518Z",
  "items": [
    {
      "title": "Lawmakers Seek Investigation of Judges Who Criticized Supreme Court",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/supreme-court-grassley-jordan-investigation.html",
      "summary": "The Republican leaders of the Senate and House Judiciary Committees told Chief Justice John G. Roberts Jr. that anonymous judges who responded to a Times questionnaire may have violated ethics rules."
    },
    {
      "title": "Florida Man Threatened James Comey and Letitia James, Complaint Says",
      "url": "https://www.nytimes.com/2025/11/05/us/man-arrested-threats-james-comey-letitia-james.html",
      "summary": "Gregory Formicone, of Bradenton, Fla., used online comments to call for several of President Trump’s most prominent adversaries to be targeted, the authorities said."
    },
    {
      "title": "Democrats Raise Concerns After Trump Officials Give Boat Strikes Briefing",
      "url": "https://www.nytimes.com/2025/11/05/us/politics/trump-drug-boat-strikes-democrats.html",
      "summary": "The classified meeting did not relieve mounting unease among lawmakers over President Trump’s expanding campaign of lethal strikes against drug cartels."
    },
    {
      "title": "Judge Sets Limits on Chicago-Area ICE Facility at Center of Illinois Protests",
      "url": "https://www.nytimes.com/2025/11/05/us/judge-chicago-ice-facility-conditions.html",
      "summary": "After detainees described squalid conditions at the detention site, a judge ordered the government to provide showers, water, clean toilets and access to lawyers."
    },
    {
      "title": "Switzerland Seeks New U.S. Trade Deal Amid Trump’s Tariffs",
      "url": "https://www.nytimes.com/live/2025/11/05/us/trump-shutdown-news/trump-tariffs-switzerland-trade-deal",
      "summary": ""
    },
    {
      "title": "The Republicans Warning They Have a Problem",
      "url": "https://www.nytimes.com/2025/11/05/us/politics/elections-democrats-trump-republicans.html",
      "summary": "Off-year elections might hold more lessons for Republicans than Democrats."
    },
    {
      "title": "US to cut airline traffic by 10% due to shutdown, Trump transport chief says",
      "url": "https://www.theguardian.com/us-news/2025/nov/05/government-shutdown-duffy-airspace-closures",
      "summary": "&lt;p&gt;Sean Duffy says cuts at 40 locations to reduce stress on air traffic controllers will start Friday if solution not found&lt;/p&gt;&lt;p&gt;The transportation secretary, Sean Duffy, and the FAA administrator, Bryan Bedford,&lt;strong&gt; &lt;/strong&gt;said on Wednesday the federal government would be reducing airline traffic by 10% at 40 “high volume markets” beginning on Friday if the government shutdown does not end by then.&lt;/p&gt;&lt;p&gt;The announcement did not specify which 40 airports would see the reduction and said that a complete list would be announced on Thursday with cuts likely at the nation’s 30 busiest airports, including those serving New York, Washington DC, Chicago, Atlanta, Los Angeles and Dallas. The reduction will affect cargo, private and passenger traffic.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/05/government-shutdown-duffy-airspace-closures\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: supreme court examines president’s global tariffs",
      "url": "https://www.theguardian.com/us-news/2025/nov/05/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;Conservative justices expressed skepticism of the strength of the Trump administration’s position – key US politics stories from 5 November 2025&lt;/p&gt;&lt;p&gt;The conservative majority of United States supreme court justices has been widely criticized for granting Donald Trump an increasing amount of leeway to wield his presidential power. On Wednesday, the court questioned one avenue of the president’s authority: his ability to impose sweeping global tariffs.&lt;/p&gt;&lt;p&gt;Justices heard &lt;a href=\"https://www.supremecourt.gov/oral_arguments/live.aspx\"&gt;oral arguments&lt;/a&gt; on the legality of the tariffs, with conservative justices expressing skepticism of the strength of the Trump administration’s position.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/05/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}