{
  "updatedAt": "2025-10-18T12:48:37.928Z",
  "items": [
    {
      "title": "Demonstrators Across the Country Set to Rally Against Trump",
      "url": "https://www.nytimes.com/2025/10/18/us/protests-trump-no-kings.html",
      "summary": "Protesters are expected to gather in more than 2,600 cities and towns to oppose presidential actions they see as authoritarian."
    },
    {
      "title": "Police Break Up Lego Theft Ring, Recovering Hundreds of Beheaded Figurines",
      "url": "https://www.nytimes.com/2025/10/18/us/lego-theft-california-arrest.html",
      "summary": "Officials said they had discovered tens of thousands of Lego pieces at a California home and arrested a man who trafficked in the stolen collectibles."
    },
    {
      "title": "White House’s Aggressive Tactics Are Complicating Its Education Agenda",
      "url": "https://www.nytimes.com/2025/10/18/us/politics/white-houses-aggressive-tactics-are-complicating-its-education-agenda.html",
      "summary": "The Trump administration alienated many elite schools in its latest effort to overhaul higher education, so it looked elsewhere for allies."
    },
    {
      "title": "There Are Lessons From the Nixon Era in Trump’s Attempts to Freeze Spending",
      "url": "https://www.nytimes.com/2025/10/18/us/politics/trump-supreme-court-impoundment.html",
      "summary": "Half a century ago, Congress protected its power of the purse, and conservatives balked at letting presidents disobey lawmakers’ instructions."
    },
    {
      "title": "The Shutdown Is Stretching On. Trump Doesn’t Seem to Mind.",
      "url": "https://www.nytimes.com/2025/10/18/us/politics/trump-democrats-shutdown-deal.html",
      "summary": "As the shutdown nears a fourth week, President Trump has pushed his political opponents to further dig in."
    },
    {
      "title": "What Powers Does the Border Patrol Have Across the Country?",
      "url": "https://www.nytimes.com/2025/10/18/us/politics/border-patrol-immigration-explainer.html",
      "summary": "The Trump administration is increasingly relying on the agency for immigration enforcement within the U.S."
    },
    {
      "title": "‘No Kings’ protest live updates: millions expected to gather across the US for anti-Trump protests",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/18/anti-trump-no-kings-protests-updates",
      "summary": "&lt;p&gt;Organizers expect more than 2,500 demonstrations across country after high turnout at June protests as Robert De Niro urges Americans to ‘stand up and be counted’&lt;/p&gt;&lt;p&gt;Recovery from a recent surgery for colon cancer will not stop &lt;strong&gt;James Phipps&lt;/strong&gt;, 75, from attending Saturday’s No Kings demonstration in Chicago, Illinois. “I have a burning desire to be a part of the protest.” he said, “because that’s all I’ve done all my life.”&lt;/p&gt;&lt;p&gt;Phipps, born in Marks, Mississippi, was &lt;a href=\"https://seiu73.org/2022/02/new-documentary-shows-life-of-local-73-member-and-civil-rights-activist/\"&gt;involved&lt;/a&gt; in the &lt;a href=\"https://www.theguardian.com/world/civil-rights-movement\"&gt;civil rights movement&lt;/a&gt; in the 1960s from the age of 13, when he was part of racially integrating his local high school and organising with the Student Nonviolent Coordinating Committee. At 15, he became involved in the Mississippi Freedom Labor Union (MFLU), which &lt;a href=\"https://snccdigital.org/events/mississippi-freedom-labor-union-founded/\"&gt;organised&lt;/a&gt; sharecroppers for better wages.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/18/anti-trump-no-kings-protests-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Why do so many gen Z women across the US identify as ‘leftist’?",
      "url": "https://www.theguardian.com/us-news/2025/oct/18/gen-z-women-leftist",
      "summary": "&lt;p&gt;Generation Z women represent the most leftwing demographic in modern US history: ‘There’s definitely a gender divide’&lt;/p&gt;&lt;p&gt;When Emily Gardiner first started paying attention to politics, she was 15, just beginning high school in 2016. It was the start of the first &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt;, a moment that politicized a lot of young Americans.&lt;/p&gt;&lt;p&gt;Now 23, Emily works as a library assistant in eastern Connecticut and is rewriting the second draft of her adult fantasy novel. She describes herself as “definitely leftist, not liberal”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/18/gen-z-women-leftist\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}