{
  "updatedAt": "2025-09-17T18:48:42.071Z",
  "items": [
    {
      "title": "‘Pay Attention!’: Spirit Airlines Pilot Scolded for Flying Near Air Force One",
      "url": "https://www.nytimes.com/2025/09/17/us/airforce-one-spirit-air-traffic-control.html",
      "summary": "An air traffic controller sternly told the pilot to “pay attention,” “get off the iPad” and turn the plane to steer clear of a flight carrying President Trump."
    },
    {
      "title": "Senator Suggests Meeting Between Kennedy and His C.D.C. Director Was Recorded, Then Backtracks",
      "url": "https://www.nytimes.com/2025/09/17/us/politics/kennedy-cdc-director-recording.html",
      "summary": "The senator, Markwayne Mullin, quickly backtracked after pressing the now former director, Susan Monarez, on an exchange with the health secretary."
    },
    {
      "title": "John H. Luckadoo, Last Pilot from a Storied Bomber Group, Dies at 103",
      "url": "https://www.nytimes.com/2025/09/17/us/john-h-luckadoo-dead.html",
      "summary": "As part of a unit known as the Bloody 100th, he flew 25 harrowing missions in his B-17 bomber over German-held territory during World War II."
    },
    {
      "title": "Ousted C.D.C Chief Describes Tense Meeting With Kennedy",
      "url": "https://www.nytimes.com/2025/09/17/us/politics/kennedy-monarez-cdc-meeting.html",
      "summary": "Dr. Susan Monarez told senators at a committee hearing on Wednesday that the health secretary had hurled false and hurtful accusations about the nation’s health agency."
    },
    {
      "title": "What to Know About ‘Hate Speech’ and the First Amendment",
      "url": "https://www.nytimes.com/2025/09/17/us/politics/what-to-know-hate-speech.html",
      "summary": "There has been a lot of talk from Trump administration officials about punishing speech. Here is what the law says."
    },
    {
      "title": "Georgia Election Official Who Defied Trump Enters Governor’s Race",
      "url": "https://www.nytimes.com/2025/09/17/us/brad-raffensperger-georgia-governor-election.html",
      "summary": "Brad Raffensperger, the two-term Republican secretary of state, joins a primary that also includes the state’s lieutenant governor and attorney general."
    },
    {
      "title": "Ex-US health official warns of RFK Jr’s risk to public health: ‘We’re going to see kids dying of vaccine-preventable diseases’ – live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Dr Debra Houry and Susan Monarez say US unprepared to prevent chronic disease or fight next pandemic&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/17/rfk-jr-senate-hearing-cdc-susan-monarez\"&gt;RFK Jr’s actions have greatly diminished US ability to respond to outbreaks, ousted CDC officials say&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Donald Trump has claimed his administration has reached a deal with China to keep TikTok operating in the US, amid uncertainty over what shape the final agreement will take, with suggestions from the Chinese side that Beijing would retain control of the algorithm that powers the site’s video feed.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;“We have a deal on &lt;a href=\"https://www.theguardian.com/technology/tiktok\"&gt;TikTok&lt;/a&gt; ... We have a group of very big companies that want to buy it,” Trump said on Tuesday, without providing further details.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Republicans propose $88m in security for lawmakers after Charlie Kirk killing",
      "url": "https://www.theguardian.com/us-news/2025/sep/17/house-republicans-security-lawmakers",
      "summary": "&lt;p&gt;Funds included in stopgap measure House Republicans released that would keep government through 21 November&lt;/p&gt;&lt;p&gt;Congressional Republicans have proposed $88m in new security spending for lawmakers, judges and top government officials in response to the shooting of conservative activist Charlie Kirk, but the money has been caught up in a partisan battle over government funding that could spark a shutdown.&lt;/p&gt;&lt;p&gt;The funds are included in a stopgap measure Republicans in the House of Representatives released Tuesday that would keep the government open through 21 November without making major changes to policy, and gives negotiators time to work out a long-term deal. Under the proposal, an additional $30m would be available for security for members of Congress, another $30m would go towards protective services for executive branch employees and $28m would be spent on security for supreme court justices.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/17/house-republicans-security-lawmakers\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}