{
  "updatedAt": "2025-11-21T12:55:06.626Z",
  "items": [
    {
      "title": "Trump’s All-but-Forgotten Border Wall Reaches an Angry Laredo, Texas",
      "url": "https://www.nytimes.com/2025/11/21/us/politics/trump-border-wall-laredo-texas.html",
      "summary": "Once the symbol of the president’s immigration policies, the wall has been eclipsed by his deportation efforts, but with $46.5 billion from Congress, construction is ramping up on the Rio Grande."
    },
    {
      "title": "No Phones, Just Good Vibes on These Dance Floors",
      "url": "https://www.nytimes.com/2025/11/21/us/nyc-nightlife-no-phones.html",
      "summary": "After club floors became stilted in the TikTok era, nightlife spaces in New York started to ban phones. “I’d rather live in the moment and feel the joy,” one reveler said."
    },
    {
      "title": "Representative Eric Swalwell Will Run for California Governor",
      "url": "https://www.nytimes.com/2025/11/21/us/eric-swalwell-california-governor.html",
      "summary": "Representative Eric Swalwell, a Democrat, is likely to emphasize his history of fighting President Trump, an approach that many Democratic voters say they want their elected officials to take."
    },
    {
      "title": "Justice Dept. Sues California Over College Benefits for Undocumented Students",
      "url": "https://www.nytimes.com/2025/11/20/us/politics/ucla-undocumented-students-tuition-doj-lawsuit-california.html",
      "summary": "The lawsuit is the third filed by the Justice Department against the state in a week."
    },
    {
      "title": "Pras Michel of the Fugees Gets 14 Years for Illegal Foreign Influence Scheme",
      "url": "https://www.nytimes.com/2025/11/20/us/pras-michel-fugees-campaign-finance-prison.html",
      "summary": "Mr. Michel was convicted in April 2023 of 10 criminal counts, including money laundering, illegal lobbying and witness tampering."
    },
    {
      "title": "Qaeda Convict Returns to Guantánamo Court 17 Years After Trial",
      "url": "https://www.nytimes.com/2025/11/20/us/politics/al-qaeda-guantanamo-court.html",
      "summary": "The Yemeni prisoner spent nearly seven hours at the war court, displaying some of the defiance of his 2008 proceeding."
    },
    {
      "title": "Trump accused of calling for execution of Democrats – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/21/donald-trump-democrats-republicans-zohran-mamdani-us-politics-latest-news-updates",
      "summary": "&lt;p&gt;Chuck Schumer says president’s remarks are ‘outright threat’ as other leading Democrats warn ‘political violence has no place in America’&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The Supreme Court is to meet in private Friday with a high-profile issue on its agenda – president Donald Trump’s birthright citizenship order declaring that children born to parents who are in the United States illegally or temporarily are not American citizens.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The justices could say as soon as Monday whether they will hear Trump’s appeal of lower court rulings that have uniformly struck down the citizenship restrictions, AP reports. They have not taken effect anywhere in the United States.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/21/donald-trump-democrats-republicans-zohran-mamdani-us-politics-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "People in the US: Have you gotten involved in activism or community organizing this year?",
      "url": "https://www.theguardian.com/us-news/2025/nov/21/people-in-the-us-have-you-gotten-involved-in-community-organizing-this-year",
      "summary": "&lt;p&gt;If you’ve been motivated to organize, protest or become more involved in politics, we’d like to hear from you&lt;/p&gt;&lt;p&gt;In cities and towns across the country, Americans are rallying to protect immigrants, civil rights, racial justice, healthcare, Snap benefits, the constitution and the rule of law.&lt;/p&gt;&lt;p&gt;If you are someone who has been motivated to organize, protest or become more involved in politics this year, we would like to hear from you. Our team is hoping to tell your story and to share the ways that individuals or small groups of people have initiated movements to protect their neighbors, communities or their own civil rights.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/21/people-in-the-us-have-you-gotten-involved-in-community-organizing-this-year\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}