{
  "updatedAt": "2025-09-18T18:50:17.482Z",
  "items": [
    {
      "title": "Democrats Pitch Bill to Protect Speech Targeted by Trump",
      "url": "https://www.nytimes.com/2025/09/18/us/politics/democrats-pitch-bill-to-protect-speech-targeted-by-trump.html",
      "summary": "A group of House and Senate Democrats said they would introduce a measure that would bolster legal protections for people targeted by the government for speaking freely."
    },
    {
      "title": "Judge Blocks Administration From Immediately Removing Guatemalan Children",
      "url": "https://www.nytimes.com/2025/09/18/us/politics/guatemalan-children-deportation.html",
      "summary": "Judge Timothy J. Kelly, a Trump appointee, wrote that the government had given dubious justifications for removing the children that “crumbled like a house of cards.”"
    },
    {
      "title": "U.S. to Cut Out Nongovernmental Groups in Refocusing Health Aid",
      "url": "https://www.nytimes.com/2025/09/18/us/politics/us-aid-health-ngos.html",
      "summary": "Secretary of State Marco Rubio said the United States would negotiate agreements to deliver aid in new ways and would focus on the Western Hemisphere and Asia Pacific."
    },
    {
      "title": "In Texas, Parents Fighting Vaccinations Say Their Movement Is Winning",
      "url": "https://www.nytimes.com/2025/09/18/us/politics/vaccine-mandates-covid-measles.html",
      "summary": "Public health advocates hoped that the measles outbreak might persuade the reluctant to get shots. That has not turned out to be true."
    },
    {
      "title": "Trump Asks Supreme Court to Allow Removal of Fed Governor",
      "url": "https://www.nytimes.com/2025/09/18/us/politics/trump-supreme-court-fed.html",
      "summary": "President Trump had pressed to fire Lisa Cook before the central bank’s meeting, at which the Fed voted to cut interest rates."
    },
    {
      "title": "Man Dies After Roller Coaster Ride at Epic Universe",
      "url": "https://www.nytimes.com/2025/09/18/us/universal-ride-death-stardust-racers.html",
      "summary": "The authorities are investigating the death of the visitor to Universal’s new theme park in Orlando, which opened in May."
    },
    {
      "title": "Trump threatens networks who give him ‘bad publicity’ as top Democrat accuses him of trying to ‘snuff out free speech’ – live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
      "summary": "&lt;p&gt;Amid Jimmy Kimmel furor, US president suggests media networks who cover him negatively could lose licenses; Chuck Schumer says Trump’s actions put US on ‘road to autocracy’&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/18/jimmy-kimmel-suspended-trump\"&gt;Trump gleeful as Jimmy Kimmel talkshow taken off air&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-suspension-sparks-shock-fears-for-free-speech-censoring-realtime\"&gt;Kimmel suspension sparks shock and fears for free speech&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;In reaction to the news that &lt;strong&gt;Jimmy Kimmel’&lt;/strong&gt;s late-night show has been indefinitely suspended, the &lt;strong&gt;American Federation of Musicians (AFM)&lt;/strong&gt; said that “Trump’s FCC identified speech it did not like and threatened ABC with extreme reprisals. This is state censorship.”&lt;/p&gt;&lt;p&gt;On X, the president of the American Federation of Musicians of the United States and Canada, &lt;strong&gt;Tino Gagliardi&lt;/strong&gt;, issued a statement in response to &lt;strong&gt;ABC&lt;/strong&gt; taking &lt;strong&gt;Jimmy Kimmel Live!&lt;/strong&gt;, which employs musicians from the &lt;strong&gt;American Federation of Musicians Local 47&lt;/strong&gt; in &lt;strong&gt;Los Angeles&lt;/strong&gt;, off the air. In it he said:&lt;/p&gt;&lt;p&gt;This is not complicated: Trump’s FCC identified speech it did not like and theatened ABC with extreme reprisals. This is state censorship. It’s now happening in the United States of America, not some far-off country."
    },
    {
      "title": "Calls grow to boycott ABC owner Disney over Jimmy Kimmel suspension",
      "url": "https://www.theguardian.com/us-news/2025/sep/18/jimmy-kimmel-cancelled-disney-boycott",
      "summary": "&lt;p&gt;Critics say ‘authoritarianism isn’t coming – it’s already here’ amid widespread condemnation of talkshow’s suspension&lt;/p&gt;&lt;p&gt;The indefinite suspension of &lt;a href=\"https://www.theguardian.com/tv-and-radio/jimmy-kimmel\"&gt;Jimmy Kimmel’s&lt;/a&gt; late-night show has prompted impassioned calls for a boycott against Disney, ABC’s parent company, and other major media conglomerates that have refused to air Kimmel’s show.&lt;/p&gt;&lt;p&gt;Boycott calls grew after ABC announced it would &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/18/jimmy-kimmel-suspended-trump\"&gt;indefinitely suspend &lt;/a&gt;the popular show following complaints from Federal Communications Commission chairman Brendan Carr. Carr’s complaints stem from Kimmel’s recent monologue in which he addressed the killing of rightwing activist Charlie Kirk &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/18/what-did-jimmy-kimmel-say-said-comments-about-charlie-kirk\"&gt;by saying:&lt;/a&gt; “Many in Maga land are working very hard to capitalize on the murder of Charlie Kirk.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/18/jimmy-kimmel-cancelled-disney-boycott\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}