{
  "updatedAt": "2025-10-15T12:56:05.140Z",
  "items": [
    {
      "title": "U.S. Says It Revoked Visas of Some People Who Criticized Charlie Kirk",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/charlie-kirk-state-department-visas.html",
      "summary": "The State Department’s X account listed six examples of people whom it said had made comments about the assassination of Mr. Kirk, a right-wing activist, and said it was withdrawing their visas."
    },
    {
      "title": "Trump Threatens Spain With Higher Tariffs Over Defense Spending",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/trump-tariffs-spain-military-defense-spending-nato.html",
      "summary": "President Trump said he was considering ‘trade punishment through tariffs’ over Spain’s refusal to increase its military spending."
    },
    {
      "title": "Rep. Seth Moulton to Challenge Edward Markey for Senate in Massachusetts",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/seth-moulton-edward-markey-massachusetts.html",
      "summary": "Mr. Moulton, a 46-year-old fellow Democrat, released a video emphasizing the age difference between himself and Mr. Markey, 79."
    },
    {
      "title": "The Shutdown Enters Its Third Week",
      "url": "https://www.nytimes.com/2025/10/15/us/shutdown-government-caribbean-strike-trump.html",
      "summary": "Cuts to transportation and energy. Funding for food assistance and the military. Here’s the latest from the shutdown."
    },
    {
      "title": "State Department Adviser Charged With Illegally Storing Classified Documents",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/state-department-classified-documents-ashley-tellis.html",
      "summary": "Ashley Tellis, an expert on South Asian affairs, was arrested after the F.B.I. said federal agents found hundreds of pages of sensitive government records at his home in Virginia."
    },
    {
      "title": "What Are Tomahawk Missiles, and Why Might Trump Give Them to Ukraine?",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/tomahawk-missiles-trump-ukraine.html",
      "summary": "Largely used by naval forces for more than 40 years, Ukraine could receive a newly developed land-based launcher to strike Moscow and beyond."
    },
    {
      "title": "Supreme court to hear Voting Rights Act challenge that could affect control of Congress – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
      "summary": "&lt;p&gt;GOP seeking to have section 2, designed to prevent discrimination in voting, declared unconstitutional as battles around redistricting take place across nation&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The far-right US congresswoman &lt;a href=\"https://www.theguardian.com/us-news/marjorie-taylor-greene\"&gt;Marjorie Taylor Greene&lt;/a&gt; is further distancing herself from her fellow Republicans and accusing men in her party of being “weak”.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;In an &lt;a href=\"https://www.washingtonpost.com/politics/2025/10/14/marjorie-taylor-greene-interview-shutdown-aca-epstein-mike-johnson/\"&gt;interview&lt;/a&gt; with the Washington Post, Greene expressed her frustrations with Republicans, signaling her further deviation from the political strategies of her party, as the government shutdown beginning 1 October was slated to enter its third week.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "More than 1,500 people displaced after typhoon remnants devastate Alaskan villages",
      "url": "https://www.theguardian.com/us-news/2025/oct/15/alaska-typhoon-halong-aftermath",
      "summary": "&lt;p&gt;At least one person was killed and two were missing after weekend storm battered two Alaska Native communities&lt;/p&gt;&lt;p&gt;More rain and wind were forecast Wednesday along the Alaska coast where two tiny villages were decimated by the remnants of Typhoon Halong and officials were scrambling to find shelter for more than 1,500 people driven from their homes.&lt;/p&gt;&lt;p&gt;The weekend storm brought high winds and surf that battered the low-lying Alaska Native communities along the Yukon-Kuskokwim Delta in the south-western part of the state, nearly 500 miles (800km) from Anchorage.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/15/alaska-typhoon-halong-aftermath\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}