{
  "updatedAt": "2025-09-18T13:33:36.352Z",
  "items": [
    {
      "title": "The Trump Administration Is Dismantling Climate Policies",
      "url": "https://www.nytimes.com/2025/09/18/us/trump-climate-denial-banquet-kimmel.html",
      "summary": "Once, the Trump administration merely downplayed the threat of global warming. Now it flatly denies the science."
    },
    {
      "title": "Democratic Senators Call for U.S. Recognition of Palestinian State",
      "url": "https://www.nytimes.com/2025/09/18/us/politics/democrats-senators-palestinian-state.html",
      "summary": "The resolution has little chance of advancing in the Republican-controlled Senate, given growing G.O.P. opposition to a two-state solution in the Israel-Palestinian conflict."
    },
    {
      "title": "Amid Republican Crackdown on D.C., City Leaders to Testify",
      "url": "https://www.nytimes.com/2025/09/18/us/dc-leaders-testify.html",
      "summary": "Washington’s mayor and other local officials will be grilled by members of a House committee seeking to expand federal control over the city."
    },
    {
      "title": "Robert Redford and His Beloved Utah Canyon",
      "url": "https://www.nytimes.com/2025/09/18/us/robert-redford-utah.html",
      "summary": "The actor, who died on Tuesday at 89, spent much of his life working to preserve the serene natural beauty of Utah, even as his Sundance Film Festival brought Hollywood glamour to the state."
    },
    {
      "title": "Ash Cloud Over Mount St. Helens Conjures Memories of 1980 Disaster",
      "url": "https://www.nytimes.com/2025/09/17/us/mount-st-helens-volcanic-ash-cloud.html",
      "summary": "A hazy cloud that emerged over the active volcano was the result of high winds rather than a new eruption."
    },
    {
      "title": "As Shutdown Looms, Democrats Outline Demands on Medicaid and Obamacare",
      "url": "https://www.nytimes.com/2025/09/17/us/politics/democrats-spending-demands-shutdown.html",
      "summary": "After rejecting a G.O.P.-written plan to keep federal funding flowing, Democrats released a counteroffer that would add more than $1 trillion in health spending."
    },
    {
      "title": "Trump celebrates Jimmy Kimmel suspension as some networks replace show with Charlie Kirk tribute – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
      "summary": "&lt;p&gt;Jamie Lee Curtis and Ben Stiller join outcry over indefinite removal of Jimmy Kimmel Live! as Senate Democratic leader says the suspension should ‘go to court’&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-live-suspended-indefinitely-after-hosts-charlie-kirk-comments\"&gt;Full report: Jimmy Kimmel Live! suspended over Charlie Kirk comments after US government pressure&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-suspension-sparks-shock-fears-for-free-speech-censoring-realtime\"&gt;‘Censoring you in real time’: Kimmel suspension sparks shock and fears for free speech&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;In reaction to the news that &lt;strong&gt;Jimmy Kimmel’&lt;/strong&gt;s late-night show has been indefinitely suspended, the &lt;strong&gt;American Federation of Musicians (AFM)&lt;/strong&gt; said that “Trump’s FCC identified speech it did not like and threatened ABC with extreme reprisals. This is state censorship.”&lt;/p&gt;&lt;p&gt;On X, the president of the American Federation of Musicians of the United States and Canada, &lt;strong&gt;Tino Gagliardi&lt;/strong&gt;, issued a statement in response to &lt;strong&gt;ABC&lt;/strong&gt; taking &lt;strong&gt;Jimmy Kimmel Live!&lt;/strong&gt;, which employs musicians from the &lt;strong&gt;American Federation of Musicians Local 47&lt;/strong&gt; in &lt;strong&gt;Los Angeles&lt;/strong&gt;, off the air. In it he said:&lt;/p&gt;&lt;p&gt;This is not complicated: Trump’s FCC identified speech it did not like and theatened ABC with extreme reprisals."
    },
    {
      "title": "Who sat next to whom at Trump’s Windsor banquet – and what does it tell us?’",
      "url": "https://www.theguardian.com/us-news/2025/sep/18/who-sat-next-to-whom-at-trumps-windsor-banquet-and-what-does-it-tell-us",
      "summary": "&lt;p&gt;US president placed next to Princess of Wales while Rupert Murdoch had the ear of Starmer’s chief of staff&lt;/p&gt;&lt;p&gt;Buckingham Palace has disclosed a wealth of detail about the state banquet at Windsor Castle hosted by the king for Donald Trump – from the 139 candles to the 1,452 pieces of cutlery, all lovingly polished by hand – but all that anyone really wants to know about is the seating plan.&lt;/p&gt;&lt;p&gt;In Windsor Castle’s St George’s Hall, the 50 metre-long table runs the length of the room, offering a tantalising indication of a pecking order among the 160 guests.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/18/who-sat-next-to-whom-at-trumps-windsor-banquet-and-what-does-it-tell-us\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}