{
  "updatedAt": "2025-09-06T13:02:01.789Z",
  "items": [
    {
      "title": "Grand Juries in D.C. Reject Wave of Charges Under Trump’s Crackdown",
      "url": "https://www.nytimes.com/2025/09/06/us/trump-dc-national-guard-grand-juries-crime.html",
      "summary": "The persistent rejections suggest that the grand jurors may have had enough of prosecutors seeking harsh charges in a highly politicized environment."
    },
    {
      "title": "Settlement Talks Stall Between Harvard and the Trump Administration",
      "url": "https://www.nytimes.com/2025/09/06/us/politics/harvard-trump-negotiations-stall.html",
      "summary": "One major reason is said to be an emerging divide within the administration over whether the current framework is too favorable to Harvard."
    },
    {
      "title": "Many Cities Say Yes to Federal Police Help, but No to ‘Occupation’",
      "url": "https://www.nytimes.com/2025/09/06/us/federal-law-enforcement-national-guard-policing.html",
      "summary": "Some mayors and police chiefs said they would welcome more traditional law enforcement cooperation with federal agents, but see the National Guard as a step too far."
    },
    {
      "title": "George Mason’s president, Gregory Washington, Will Not Apologize to the Trump Administration",
      "url": "https://www.nytimes.com/2025/09/06/us/george-mason-university-gregory-washington-trump-attack.html",
      "summary": "Gregory Washington, George Mason’s first Black president, runs a university that prizes diversity. That has made him a target of the Trump administration."
    },
    {
      "title": "Trump Says U.S. Military Has ‘Never Fought to Win’ Since World War II",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/trump-military-wars.html",
      "summary": "As he signed an order recognizing the Defense Department as the “Department of War,” President Trump said that the country “could have won every war, but we really chose to be very politically correct.”"
    },
    {
      "title": "Will Trump Have to Run From the Economy?",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/trump-economy-jobs-midterms.html",
      "summary": "It’s the issue voters cared most about in 2024, and there are signs of trouble."
    },
    {
      "title": "Climate crisis will increase frequency of lightning-sparked wildfires, study finds",
      "url": "https://www.theguardian.com/us-news/2025/sep/06/climate-crisis-lightning-sparked-wildfires-increase",
      "summary": "&lt;p&gt;These wildfires tend to burn in more remote areas and grow larger faster, posing a higher risk to public safety and health&lt;/p&gt;&lt;p&gt;The climate crisis will continue making lightning-sparked wildfires more frequent for decades to come, which could produce cascading effects and worsen public safety and public health, experts and new research suggest.&lt;/p&gt;&lt;p&gt;Lightning-caused fires tend to burn in more remote areas and therefore usually grow into larger fires than human-caused fires. That means a trend toward more lightning-caused fires is also probably making wildfires more deadly by producing more wildfire smoke and helping to drive &lt;a href=\"https://www.theguardian.com/environment/2025/aug/19/wildfire-smoke-far-more-dangerous-than-thought-say-scientists\"&gt;a surge in air quality issues&lt;/a&gt; from coast to coast, &lt;a href=\"https://eartharxiv.org/repository/view/8187/\"&gt;especially over the past several years&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/06/climate-crisis-lightning-sparked-wildfires-increase\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "One year after Ayşenur Ezgi Eygi was killed, the US has not investigated. Her family wants answers",
      "url": "https://www.theguardian.com/us-news/2025/sep/06/aysenur-ezgi-eygi-west-bank",
      "summary": "&lt;p&gt;The American Turkish woman, 26, was shot in the head on 6 September 2024 by an Israeli sniper in the West Bank&lt;/p&gt;&lt;p&gt;Özden Bennett’s first reaction after learning of her younger sister’s killing was disbelief. Ayşenur Ezgi Eygi had traveled to the occupied West Bank just three days earlier to volunteer with Palestinian communities facing violence at the hands of Israeli soldiers and settlers.&lt;/p&gt;&lt;p&gt;But the shock and grief quickly gave way to dread – “that nothing would come of it, that she would have just died under that olive tree and that was it”, Bennett said this week, before the anniversary of Eygi’s death.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/06/aysenur-ezgi-eygi-west-bank\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}