{
  "updatedAt": "2025-09-12T18:41:36.039Z",
  "items": [
    {
      "title": "A Bullet Casing Quoted ‘Bella Ciao,’ an Antifascist Anthem Now Popular With Video Gamers",
      "url": "https://www.nytimes.com/2025/09/12/us/tyler-robinson-bella-ciao-bullet.html",
      "summary": "The phrase, inscribed on an unfired casing tied to the man arrested in Charlie Kirk’s shooting, was popular in Italy after World War II. It has recently resurfaced in a Netflix series and video games."
    },
    {
      "title": "Man Fatally Shot in Confrontation With ICE Officers in Chicago Area",
      "url": "https://www.nytimes.com/2025/09/12/us/ice-shooting-chicago.html",
      "summary": "The shooting took place amid a federal crackdown on illegal immigration in the region that is being called Operation Midway Blitz."
    },
    {
      "title": "As Trump Vows Vengeance, Utah’s Governor Calls to Lower the Temperature",
      "url": "https://www.nytimes.com/2025/09/12/us/trump-tyler-robinson-utah-shooting.html",
      "summary": "“At some point, we have to find an off-ramp, or it’s going to get much, much worse,” Gov. Spencer Cox, a Republican, said of political violence after a suspect was caught in the assassination of Charlie Kirk."
    },
    {
      "title": "What We Know About Tyler Robinson, Suspect in Charlie Kirk Shooting",
      "url": "https://www.nytimes.com/2025/09/12/us/tyler-robinson-charlie-kirk-shooting-suspect.html",
      "summary": "The suspect, 22, was arrested in southwestern Utah after a friend had contacted the authorities, officials said."
    },
    {
      "title": "Trump Blames the Left and Downplays ‘Radical Right’ After Charlie Kirk Shooting",
      "url": "https://www.nytimes.com/2025/09/12/us/politics/trump-charlie-kirk-shooting.html",
      "summary": "President Trump dismissed a suggestion that there were extremists on both sides of the political spectrum."
    },
    {
      "title": "Here’s What Some of the Bullet Casing Engravings in the Charlie Kirk Shooting Mean",
      "url": "https://www.nytimes.com/2025/09/12/us/charlie-kirk-bullet-casings-engravings.html",
      "summary": "Many of the messages adopt the flippant, sarcastic chatter often found on online message boards and in-game chats."
    },
    {
      "title": "Charlie Kirk shooting suspect: details of messages and gun casings emerge",
      "url": "https://www.theguardian.com/us-news/2025/sep/12/suspect-charlie-kirk-shooting",
      "summary": "&lt;p&gt;Utah officials say they were contacted by family friend of Tyler Robinson, 22, accused of killing rightwing activist&lt;/p&gt;&lt;p&gt;The initial portrait emerging of the man authorities say killed the conservative activist &lt;a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"&gt;Charlie Kirk&lt;/a&gt; in Utah is a complicated one.&lt;/p&gt;&lt;p&gt;Tyler James Robinson, 22, was arrested on Thursday after contacting a family friend who then called the sheriff’s office in Washington county, Utah, officials said. Washington county is 260 miles south of Orem, home of Utah Valley University (UVU), where Kirk was killed.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/12/suspect-charlie-kirk-shooting\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US immigration officers kill man trying to flee vehicle stop near Chicago",
      "url": "https://www.theguardian.com/us-news/2025/sep/12/ice-agent-shooting-chicago",
      "summary": "&lt;p&gt;Fatal shooting occurred during protest outside the Ice processing center in Broadview, Illinois&lt;/p&gt;&lt;p&gt;A man was fatally shot during a vehicle stop on the outskirts of &lt;a href=\"https://www.theguardian.com/us-news/chicago\"&gt;Chicago&lt;/a&gt; by US Immigration and Customs Enforcement (Ice) officers after attempting to flee the scene, according to officials, and another officer was injured during the altercation.&lt;/p&gt;&lt;p&gt;Ice released the following statement after the shooting: “This morning in Chicago, Ice officers were conducting targeted local enforcement activity during a vehicle stop, the suspect resisted and attempted to drive his vehicle into the arrest team, striking an officer and subsequently dragging him as he fled the scene, fearing for his life, the officer discharged his firearm and struck the subject. Both the officer and subject immediately received medical treatment and were transferred to a local hospital.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/12/ice-agent-shooting-chicago\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}