{
  "updatedAt": "2025-11-11T18:37:14.711Z",
  "items": [
    {
      "title": "Some Kansas Republicans Resist Redistricting Efforts Amid Growing Skepticism",
      "url": "https://www.nytimes.com/2025/11/11/us/kansas-redistricting-sharice-davids-congress.html",
      "summary": "The state’s top Republicans wanted to join President Trump’s push to redraw congressional maps. But plans for a special session fell apart when some lawmakers resisted."
    },
    {
      "title": "How the Heavy-Metal Fall of a Dictator Shapes Trump’s Venezuela Policy",
      "url": "https://www.nytimes.com/2025/11/11/us/politics/panama-noriega-maduro.html",
      "summary": "Seizing Panama’s leader was relatively easy. But the similarities between Panama and Venezuela are dangerously misleading, some analysts warn."
    },
    {
      "title": "Judge Rejects Utah’s Republican-Drawn Redistricting Map",
      "url": "https://www.nytimes.com/2025/11/11/us/utah-redistricting-gerrymander-congress.html",
      "summary": "The judge instead adopted a map drawn by a centrist coalition. Democrats celebrated the ruling ahead of the 2026 midterms, but Republicans vowed to fight it."
    },
    {
      "title": "Police Chase Driver Across Southern California Until She Escapes Into Mexico",
      "url": "https://www.nytimes.com/2025/11/11/us/car-chase-police-mexico-la.html",
      "summary": "The woman stole a minivan, police said, beginning a dramatic pursuit that spanned four counties and reached speeds of 90 miles per hour."
    },
    {
      "title": "The NYC Demographic Trends That Shaped Mamdani’s Win",
      "url": "https://www.nytimes.com/2025/11/11/us/mamdani-nyc-voters-election-demographics.html",
      "summary": "Moderate Black voters and young progressives favored Zohran Mamdani for mayor, while Andrew Cuomo won many wealthy New Yorkers and those who voted for Donald Trump."
    },
    {
      "title": "Dismantled by DOGE, a Foreign Policy Center Finds New Life",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/kennan-institute-doge-trump.html",
      "summary": "The Kennan Institute, which researches Russia and the surrounding region, has re-emerged in a form that is smaller but more impervious to government control."
    },
    {
      "title": "Trump calls Senate bill to end shutdown a ‘very big victory’ as deal splits Democrats – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/11/donald-trump-us-government-shutdown-senate-democrats-republicans-politics-live-news-updates",
      "summary": "&lt;p&gt;US president congratulates Republicans on deal now moving to House; Democrats riven over some senators’ support for bill&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/11/shutdown-legislation-house-democrats\"&gt;Top House Democrats vow to oppose shutdown bill over healthcare funding&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/nov/11/how-your-senators-voted-on-the-shutdown-ending-budget-bill\"&gt;How US senators voted on the shutdown-ending budget bill&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;As the supreme court deliberates on the fate of Donald Trump’s sweeping tariffs – which he maintains are a matter of “national security” as justices appeared skeptical during oral arguments on the case last week –&amp;nbsp;the president said that the US would be forced to hand “in excess of three trillion dollars” if the levies are scrapped, in a late night post on Truth Social.&lt;/p&gt;&lt;p&gt;He added:&lt;/p&gt;&lt;p&gt;It would not be possible to ever make up for that kind of a ‘drubbing.’ That would truly become an insurmountable National Security Event, and devastating to the future of our Country – Possibly non-sustainable!&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/11/donald-trump-us-government-shutdown-senate-democrats-republicans-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Search for West Virginia miner trapped by floodwater extends into fourth day",
      "url": "https://www.theguardian.com/us-news/2025/nov/11/west-virginia-miner-trapped-search",
      "summary": "&lt;p&gt;Rescuers have been seeking unnamed man since pocket of water inundated Rolling Thunder mine on Saturday&lt;/p&gt;&lt;p&gt;Emergency responders have been trying to reach a miner trapped deep inside a flooded &lt;a href=\"https://www.theguardian.com/us-news/west-virginia\"&gt;West Virginia&lt;/a&gt; coalmine since Saturday, according to authorities.&lt;/p&gt;&lt;p&gt;A mining crew hit an unknown pocket of water on Saturday about three-quarters of a mile into the Rolling Thunder mine near Drennen, about 50 miles (80km) east of the state capital of Charleston, the Nicholas county commissioner, Garrett Cole, said in a Facebook post.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/11/west-virginia-miner-trapped-search\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}