{
  "updatedAt": "2025-10-14T06:37:27.537Z",
  "items": [
    {
      "title": "Alaska Flooding Leaves 1 Dead and 2 Missing",
      "url": "https://www.nytimes.com/2025/10/14/us/alaska-typhoon-flood-dead.html",
      "summary": "The three people had been reported missing from Kwigillingok, a low-lying village along the Bering Sea that was hit by remnants of Typhoon Halong."
    },
    {
      "title": "Trump’s Two Minds on China Sow a Chaotic Few Days",
      "url": "https://www.nytimes.com/2025/10/13/us/politics/trump-china-tariffs.html",
      "summary": "The president’s bellicose vow of steep new tariffs, followed quickly by a more conciliatory message, pointed to an internal tug of war over his approach."
    },
    {
      "title": "4 People Arrested in Deadly Mississippi Shooting",
      "url": "https://www.nytimes.com/2025/10/13/us/mississippi-shooting-arrests.html",
      "summary": "The shooting in Leland, Miss., which killed six people, was the deadliest of three across the state over the weekend."
    },
    {
      "title": "North Carolina Republicans Plan to Redraw Congressional Map to Add a Seat",
      "url": "https://www.nytimes.com/2025/10/13/us/north-carolina-republicans-redistricting.html",
      "summary": "The Trump administration has pushed Republican leaders to redraw House district maps before the midterm elections next year. His party already holds 10 of North Carolina’s 14 congressional seats."
    },
    {
      "title": "What Happened to Campus Activism Against the War in Gaza?",
      "url": "https://www.nytimes.com/2025/10/13/us/campus-activism-against-the-war-in-gaza.html",
      "summary": "Protests swept campuses after the war began. But tough discipline, pushed by Republicans, curbed a student movement that was one of the largest since the Vietnam War."
    },
    {
      "title": "Ex-Student Stabs 3 Staff Members at California Special Needs School, Police Say",
      "url": "https://www.nytimes.com/2025/10/13/us/torrance-stabbing-school-california.html",
      "summary": "Two of the staff members at the Switzer Learning Center in Torrance, Calif., were taken to a hospital with non-life-threatening injuries, and the third was treated at the scene, the authorities said."
    },
    {
      "title": "A candidate for local office in New York disappeared months ago. He could still win",
      "url": "https://www.theguardian.com/us-news/2025/oct/13/new-york-missing-candidate-long-beach-petros-krommidas",
      "summary": "&lt;p&gt;Long Beach voters have a choice: re-elect the Republican incumbent or the Democrat who seemingly vanished at sea&lt;/p&gt;&lt;p&gt;A political candidate in the New York City suburbs went for a night swim in the Atlantic Ocean this past spring and never returned.&lt;/p&gt;&lt;p&gt;Petros Krommidas’s phone, keys and clothes were found on the sands at Long Beach on Long Island. The 29-year-old former Ivy League rower, who was training for a triathlon, had parked his car just off the picturesque wooden boardwalk.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/13/new-york-missing-candidate-long-beach-petros-krommidas\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: President declares ‘peace in the Middle East’ despite many barriers remaining",
      "url": "https://www.theguardian.com/us-news/2025/oct/14/trump-administration-news-updates-today-latest",
      "summary": "&lt;p&gt;Donald Trump has vowed to use the power of his presidency to ensure that Israel recognises it has achieved ‘all that it can by force of arms’. Key US politics stories from 13 October 2025&lt;/p&gt;&lt;p&gt;“At long last, we have peace in the Middle East,” Donald Trump declared, as he and regional leaders signed a declaration meant to cement a ceasefire in Gaza. Analysts said however that a litany of thorny issues are unresolved, and many barriers to a lasting peace remain.&lt;/p&gt;&lt;p&gt;The president made a lightning visit to Israel, where he lauded prime minister Benjamin Netanyahu in an address to parliament, and then Egypt, for a summit where he pledged to be a guarantor to the Gaza deal.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/14/trump-administration-news-updates-today-latest\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}