{
  "updatedAt": "2025-09-14T13:02:15.095Z",
  "items": [
    {
      "title": "Inside the Most Valuable Team in Women’s Sports",
      "url": "https://www.nytimes.com/2025/09/14/us/inside-the-most-valuable-team-in-womens-sports.html",
      "summary": "Expectations were low for the Golden State Valkyries, the W.N.B.A.’s first expansion team in 17 years, but they captivated Bay Area sports fans and surprised the league by securing a playoff spot in their first season."
    },
    {
      "title": "In an Era of Deep Polarization, Unity Is Not Trump’s Mission",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/trump-kirk-polarization-unity.html",
      "summary": "President Trump does not subscribe to the traditional notion of being president for all Americans."
    },
    {
      "title": "Trump’s Reversals on Immigration Mount Over Economic Concerns",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/trump-immigration-policy-reversals.html",
      "summary": "President Trump has walked back some significant immigration policies that collide with his economic agenda, angering his far-right allies."
    },
    {
      "title": "How Nancy Pelosi Quietly Shaped California’s Redistricting Fight",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/nancy-pelosi-california-redistricting.html",
      "summary": "Private meetings and longtime loyalties helped push what began as a something of a Democratic bluff into a full-fledged counteroffensive against President Trump."
    },
    {
      "title": "On the Supreme Court’s Emergency Docket, Sharp Partisan Divides",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/supreme-court-emergency-docket-partisan.html",
      "summary": "The second Trump administration has filed roughly the same number of applications so far as the Biden administration did over four years. But they have fared quite differently."
    },
    {
      "title": "Inside a ‘Hell on Earth’ in Oklahoma",
      "url": "https://www.nytimes.com/2025/09/14/us/liberty-greer-center-abuse-oklahoma.html",
      "summary": "The Greer Center was supposed to be a refuge for people with developmental disabilities. But accounts from inside the secretive facility paint a starkly different picture, depicting a place where helpless patients faced beatings, waterboarding and constant fear."
    },
    {
      "title": "Rubio arrives in Israel amid tensions over strike on Hamas leaders in Qatar",
      "url": "https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas",
      "summary": "&lt;p&gt;US secretary of state says Trump ‘not happy’ about Israeli attack that targeted Hamas officials in Doha for Gaza talks&lt;/p&gt;&lt;p&gt;The US secretary of state, Marco Rubio, has arrived in Israel seeking to mend a rift with Washington’s other allies in the region over &lt;a href=\"https://www.theguardian.com/world/2025/sep/10/israel-threats-outrage-qatar-strike-hamas\"&gt;Israel’s attempted assassination of Hamas leaders in Qatar&lt;/a&gt; and the accelerated expansion of settlements in the occupied West Bank.&lt;/p&gt;&lt;p&gt;In talks with the Israeli prime minister, Benjamin Netanyahu, Rubio will try to balance criticism of the Israeli airstrike on a Doha building, which killed aides to a Hamas leader and a Qatari security officer, with a message of overall support for Israel before the expected formal recognition of Palestine by a number of other US allies, including the UK, France, Canada, Australia and Belgium.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "How the US rightwing is taking over news media and choking press freedom",
      "url": "https://www.theguardian.com/us-news/2025/sep/14/rightwing-news-media-journalism",
      "summary": "&lt;p&gt;Takeover of broadcast companies by Donald Trump’s allies is harbinger of media capitulation to authoritarian leanings&lt;/p&gt;&lt;p&gt;The US right has appeared to increase its influence on mainstream media in America in recent weeks, especially in television news which has been a major target of the Donald Trump administration.&lt;/p&gt;&lt;p&gt;CBS News – once home to legends of US journalism like Walter Cronkite and Edward R Murrow – installed a Trump ally as its ombudsman, weeks after the family of &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/11/who-is-larry-ellison-richest-person-oracle\"&gt;Larry Ellison&lt;/a&gt;, one of the world’s richest men, and a friend of the US president, sealed control over Paramount, the owner of CBS.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/14/rightwing-news-media-journalism\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}