{
  "updatedAt": "2025-09-18T06:50:32.229Z",
  "items": [
    {
      "title": "Robert Redford and His Beloved Utah Canyon",
      "url": "https://www.nytimes.com/2025/09/18/us/robert-redford-utah.html",
      "summary": "The actor, who died on Tuesday at 89, spent much of his life working to preserve the serene natural beauty of Utah, even as his Sundance Film Festival brought Hollywood glamour to the state."
    },
    {
      "title": "Ash Cloud Over Mount St. Helens Conjures Memories of 1980 Disaster",
      "url": "https://www.nytimes.com/2025/09/17/us/mount-st-helens-volcanic-ash-cloud.html",
      "summary": "A hazy cloud that emerged over the active volcano was the result of high winds rather than a new eruption."
    },
    {
      "title": "As Shutdown Looms, Democrats Outline Demands on Medicaid and Obamacare",
      "url": "https://www.nytimes.com/2025/09/17/us/politics/democrats-spending-demands-shutdown.html",
      "summary": "After rejecting a G.O.P.-written plan to keep federal funding flowing, Democrats released a counteroffer that would add more than $1 trillion in health spending."
    },
    {
      "title": "Trump Administration Announces New Civics Effort With MAGA-Aligned Groups",
      "url": "https://www.nytimes.com/2025/09/17/us/politics/trump-civics-education-maga.html",
      "summary": "President Trump has long sought to imbue the nonpartisan idea of civics — the rights, responsibilities and duties of citizenship — with his politics."
    },
    {
      "title": "California Judge Gets 35 Years to Life for Fatally Shooting His Wife",
      "url": "https://www.nytimes.com/2025/09/17/us/california-judge-convicted-wife-murder.html",
      "summary": "Jeffrey Ferguson, 74, said at his sentencing hearing that the shooting was an accident. “I wish God had taken me instead,” he said."
    },
    {
      "title": "How Vaccines Are Revealing Cracks in Trump’s G.O.P.",
      "url": "https://www.nytimes.com/2025/09/17/us/politics/cassidy-monorez-kennedy-vaccines-cdc.html",
      "summary": "Some Republicans are starting to worry that the issue of health care could cost them politically."
    },
    {
      "title": "Trump celebrates Jimmy Kimmel suspension as some networks replace show with Charlie Kirk tribute – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
      "summary": "&lt;p&gt;Indefinite removal of Jimmy Kimmel Live! show spurs outrage amid Trump administration crackdown on commentary following Charlie Kirk killing&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-live-suspended-indefinitely-after-hosts-charlie-kirk-comments\"&gt;Full report: Jimmy Kimmel Live! suspended indefinitely after host’s Charlie Kirk comments&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-suspension-sparks-shock-fears-for-free-speech-censoring-realtime\"&gt;‘Censoring you in real time’: Kimmel suspension sparks shock and fears for free speech&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;In reaction to the news that &lt;strong&gt;Jimmy Kimmel’&lt;/strong&gt;s late-night show has been indefinitely suspended, the &lt;strong&gt;American Federation of Musicians (AFM)&lt;/strong&gt; said that “Trump’s FCC identified speech it did not like and threatened ABC with extreme reprisals. This is state censorship.”&lt;/p&gt;&lt;p&gt;On X, the American Federation of Musicians of the United States and Canada president &lt;strong&gt;Tino Gagliardi&lt;/strong&gt; issued a statement in response to &lt;strong&gt;ABC&lt;/strong&gt; taking &lt;strong&gt;Jimmy Kimmel Live!&lt;/strong&gt;, which employs musicians from the &lt;strong&gt;American Federation of Musicians Local 47&lt;/strong&gt; in &lt;strong&gt;Los Angeles&lt;/strong&gt;, off the air. In it he said:&lt;/p&gt;&lt;p&gt;This is not complicated: Trump’s FCC identified speech it did not like and theatened ABC with extreme reprisals."
    },
    {
      "title": "Democrats to introduce a No Political Enemies (Nope) act, to protect government critics – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
      "summary": "&lt;p&gt;&lt;strong&gt;This live blog is now closed&lt;/strong&gt;, you can follow the latest on the suspension of Jimmy Kimmel and our latest US politics coverage on a &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live\"&gt;new liveblog here&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Donald Trump has claimed his administration has reached a deal with China to keep TikTok operating in the US, amid uncertainty over what shape the final agreement will take, with suggestions from the Chinese side that Beijing would retain control of the algorithm that powers the site’s video feed.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;“We have a deal on &lt;a href=\"https://www.theguardian.com/technology/tiktok\"&gt;TikTok&lt;/a&gt; ... We have a group of very big companies that want to buy it,” Trump said on Tuesday, without providing further details.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}