{
  "updatedAt": "2025-11-25T12:57:50.750Z",
  "items": [
    {
      "title": "Drug Arrests and Gun Seizures Fell as Homeland Security Pursued Immigration",
      "url": "https://www.nytimes.com/2025/11/25/us/politics/drug-arrests-gun-seizures-homeland-security-immigration.html",
      "summary": "Internal documents reveal the impact on crime fighting as the Trump administration diverts special agents to its mass deportation agenda."
    },
    {
      "title": "Trump Administration Is Taking Billions in Stakes in Firms Like Intel",
      "url": "https://www.nytimes.com/2025/11/25/us/politics/trump-intel-steel-minerals-china.html",
      "summary": "The Trump administration is trading billions of dollars of taxpayer money for ownership stakes in companies. The unusual practice shows no sign of slowing."
    },
    {
      "title": "Prosecutor Used Flawed A.I. to Keep a Man in Jail, His Lawyers Say",
      "url": "https://www.nytimes.com/2025/11/25/us/prosecutor-artificial-intelligence-errors-lawyers-california.html",
      "summary": "The case is among the first in which a prosecutor is accused of filing court papers marred by A.I.-generated mistakes."
    },
    {
      "title": "U.S. Army Secretary Travels to U.A.E. for Meetings With Russian Envoys",
      "url": "https://www.nytimes.com/2025/11/25/us/daniel-driscoll-uae-russia-ukraine.html",
      "summary": "The secretary, Daniel Driscoll, was in Geneva over the weekend for talks with a Ukrainian delegation."
    },
    {
      "title": "At a Congressional Hearing, Residents Detail the Trauma of the L.A. Raids",
      "url": "https://www.nytimes.com/2025/11/24/us/ice-raids-congressional-hearing.html",
      "summary": "More than two dozen people described the upheaval the raids had caused in immigrant communities and aired accusations of mistreatment by agents."
    },
    {
      "title": "Batteries for Rad Power Bikes Get Federal Fire Risk Warning",
      "url": "https://www.nytimes.com/2025/11/24/us/cpsc-rad-power-bikes-batteries.html",
      "summary": "A federal watchdog said two models of batteries found in Rad Power Bikes should be immediately, and safely, disposed of. The bike company disputes the safety agency’s findings."
    },
    {
      "title": "‘Is the price of doing this worth it?’: North Carolina Republicans worry about Trump immigration raids",
      "url": "https://www.politico.com/news/2025/11/23/north-carolina-immigration-raids-trump-00665164",
      "summary": "The concerns surrounding Trump’s immigration clampdown in the Tar Heel state speak to a tension at the center of the president’s immigration agenda."
    },
    {
      "title": "What Trump’s Mamdani praise — and MTG’s ouster — says about MAGA’s future",
      "url": "https://www.politico.com/news/2025/11/22/trump-mtg-mamdani-maga-future-00666113",
      "summary": "A whirlwind Friday is the freshest reminder that the MAGA movement has always been defined more by id than ideology."
    }
  ]
}