{
  "updatedAt": "2025-11-19T06:39:08.853Z",
  "items": [
    {
      "title": "Harvard Opens New Investigation Into Summers and Epstein",
      "url": "https://www.nytimes.com/2025/11/19/us/harvard-summers-epstein-investigation.html",
      "summary": "The university is reviewing newly released emails between convicted sex offender Jeffrey Epstein and former Harvard President Lawrence H. Summers, among other people at the institution."
    },
    {
      "title": "House Rejects Censuring Plaskett For Texts With Epstein In 2019",
      "url": "https://www.nytimes.com/2025/11/18/us/politics/stacey-plaskett-house-censure-epstein.html",
      "summary": "Three Republicans voted with nearly every Democrat in the House to defeat an effort to formally reprimand Delegate Stacey Plaskett, Democrat of the Virgin Islands."
    },
    {
      "title": "Trump Ramps Up Redistricting Pressure on Indiana Republicans",
      "url": "https://www.nytimes.com/2025/11/18/us/indiana-redistricting-trump-republicans.html",
      "summary": "After the State Senate said it would not take up a new map, President Trump said he would support primary challengers against Republicans who bucked him."
    },
    {
      "title": "Democratic Lawmakers Tell Military to Refuse Illegal Orders",
      "url": "https://www.nytimes.com/2025/11/18/us/politics/democratic-lawmakers-illegal-orders.html",
      "summary": "Six lawmakers, who all served in the military or the intelligence community, released the message in a video. The Trump administration sharply criticized the effort."
    },
    {
      "title": "Once a Pariah, Saudi Prince Resets U.S. Relations on His Own Terms",
      "url": "https://www.nytimes.com/2025/11/18/us/politics/prince-mohammed-trump-us-saudi-arabia.html",
      "summary": "Seven years ago, Crown Prince Mohammed bin Salman couldn’t visit Washington. When he arrived at the White House on Tuesday, he got F-35s, the world’s fastest chips and the central role in the remaking of the Middle East."
    },
    {
      "title": "Federal Judge Orders Some Texas Schools to Remove Ten Commandment Posters",
      "url": "https://www.nytimes.com/2025/11/18/us/politics/texas-ten-commandments.html",
      "summary": "The judge sided with families of students who had argued that the displays infringed on their religious freedom."
    },
    {
      "title": "What to know about the US Senate vote on releasing the Epstein files",
      "url": "https://www.theguardian.com/us-news/2025/nov/18/epstein-files-release-vote",
      "summary": "&lt;p&gt;The bill now needs the signature of the president for the justice department to release all unclassified materials on Epstein&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/18/house-vote-jeffrey-epstein-files-donald-trump-republicans-democrats-us-politics-live-news#maincontent\"&gt;US politics – follow live&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The intensively discussed files related to the disgraced former financier and sex trafficker Jeffrey Epstein passed a significant milestone on Tuesday when Congress voted overwhelmingly in favor of releasing them.&lt;/p&gt;&lt;p&gt;After months of deliberate delays and manoeuvres, the House of Representatives voted by 427 to one in favor of the Epstein Files Transparency Act, legislation which would, if enacted, require the justice department to release all unclassified materials on Epstein, who died in jail in 2019 while awaiting trial on sex-trafficking charges. The Senate has unanimously agreed to swiftly pass the bill, which would then head to the White House for Donald Trump’s signature.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/18/epstein-files-release-vote\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Senate agrees to automatically pass bill to release Epstein files as Trump claims to not care – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/18/house-vote-jeffrey-epstein-files-donald-trump-republicans-democrats-us-politics-live-news",
      "summary": "&lt;p&gt;This blog has now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/18/house-vote-epstein-documents\"&gt;Senate agrees to pass Epstein files bill after near-unanimous House vote&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/nov/18/house-representative-vote-on-epstein-files-release\"&gt;How did your representative vote on releasing the Epstein files?&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;The Harvard professor and economist Larry Summers said he would be stepping back from public life after documents released by the House oversight committee revealed email exchanges between Summers and the convicted sex offender &lt;a href=\"https://www.theguardian.com/us-news/jeffrey-epstein\"&gt;Jeffrey Epstein&lt;/a&gt;, who called himself Summers’ “wing man”.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Politico &lt;a href=\"https://www.politico.com/news/2025/11/17/larry-summers-steps-back-from-public-commitments-deeply-ashamed-by-epstein-revelations-00655712\"&gt;reported&lt;/a&gt; on Monday that Summers, a former treasury secretary, expressed deep regret for past messages with Epstein.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/18/house-vote-jeffrey-epstein-files-donald-trump-republicans-democrats-us-politics-live-news\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}