{
  "updatedAt": "2025-10-14T18:36:46.629Z",
  "items": [
    {
      "title": "ICE Sends More Migrants to Guantánamo Bay, Resumes Operations",
      "url": "https://www.nytimes.com/2025/10/14/us/politics/ice-migrants-guantanamo-bay.html",
      "summary": "The offshore holding sites had been empty since Oct. 1. The nationalities of the new arrivals were not immediately known."
    },
    {
      "title": "Supreme Court Denies Alex Jones’s Appeal of Payment to Sandy Hook Families",
      "url": "https://www.nytimes.com/2025/10/14/us/politics/supreme-court-alex-jones-defamation.html",
      "summary": "Mr. Jones was ordered to pay $1.4 billion in damages to families who lost children in the 2012 shooting in Newtown, Conn."
    },
    {
      "title": "Suspect Pleads Guilty in Firebombing of Pennsylvania Governor’s Residence",
      "url": "https://www.nytimes.com/2025/10/14/us/arson-harrisburg-cody-balmer-josh-shapiro.html",
      "summary": "Under a plea agreement, Cody Balmer will be imprisoned for 25 to 50 years for attempted murder and other charges in the attack on Gov. Josh Shapiro’s official residence in Harrisburg in April."
    },
    {
      "title": "Trump to Award Posthumous Medal of Freedom to Charlie Kirk",
      "url": "https://www.nytimes.com/2025/10/14/us/politics/charlie-kirk-medal-of-freedom-trump-birthday.html",
      "summary": "President Trump was scheduled to attend a ceremony at the White House on Tuesday to honor the influential right-wing activist, who was assassinated last month."
    },
    {
      "title": "Meet Zohran Mamdani, the Favorite to Lead New York City",
      "url": "https://www.nytimes.com/2025/10/14/us/meet-zohran-mamdani-the-favorite-to-lead-new-york-city.html",
      "summary": "Our reporters explore his skyrocket, his life and his appeal."
    },
    {
      "title": "Gov. Janet Mills of Maine to Run for Senate, Aiming at Senator Susan Collins",
      "url": "https://www.nytimes.com/2025/10/14/us/politics/janet-mills-senate-race-maine-susan-collins.html",
      "summary": "A two-term Democratic governor, Ms. Mills called herself “battle tested” in an interview. But she faces a Democratic primary before she can challenge the Republican incumbent."
    },
    {
      "title": "House speaker defends White House using research funding to pay military during government shutdown – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Mike Johnson says Trump administration has ‘every right’ to move around ‘duly appropriated dollars from Congress to Department of Defense’&lt;/p&gt;&lt;p&gt;&lt;strong&gt;China has hit back at accusations from the US that it is trying to hurt the world economy, as the trade war between the world’s two biggest economies &lt;a href=\"https://www.theguardian.com/world/2025/oct/13/why-us-china-trade-war-restarted-tariffs\"&gt;appeared to re-escalate&lt;/a&gt;, amped up by aggressive rhetoric on both sides.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;China’s commerce ministry said on Tuesday that the US was “threatening to intimidate” with the prospect of new tariffs on Chinese exports, “which is not the right way to get along with China”. Its spokesperson said that &lt;a href=\"https://www.theguardian.com/world/china\"&gt;China&lt;/a&gt; would “fight to the end” in trade talks.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Newsom vetoes California bill banning cookware with Pfas, ‘forever chemicals’",
      "url": "https://www.theguardian.com/us-news/2025/oct/14/california-pfas-ban-gavin-newsom",
      "summary": "&lt;p&gt;Governor says bill would cause sudden product shift, sparking debate among chefs, lawmakers and environmentalists&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/gavin-newsom\"&gt;Gavin Newsom &lt;/a&gt;vetoed a &lt;a href=\"https://www.theguardian.com/us-news/california\"&gt;California&lt;/a&gt; bill that was set to ban the sale of cookware and other consumer goods manufactured with &lt;a href=\"https://www.theguardian.com/environment/pfas\"&gt;Pfas&lt;/a&gt;, also known as “forever chemicals”, human-made compounds linked to a range of health issues.&lt;/p&gt;&lt;p&gt;The governor’s decision on Monday followed months of debate and advocacy, including from high-profile celebrity chefs such as Thomas Keller and Rachael Ray, who argued that nonstick cookware made with &lt;a href=\"https://www.theguardian.com/environment/pfas\"&gt;Pfas&lt;/a&gt;, when manufactured responsibly, can be safe and effective and urged lawmakers to vote against the proposal.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/14/california-pfas-ban-gavin-newsom\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}