{
  "updatedAt": "2025-09-08T06:53:22.795Z",
  "items": [
    {
      "title": "West Point Alumni Group Cancels Award Honoring Tom Hanks",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/tom-hanks-west-point-award.html",
      "summary": "The group was to bestow the Sylvanus Thayer Award on the actor, but it said it was canceling the event to focus on preparing academy cadets for the future."
    },
    {
      "title": "John Burton, 92, Dies; California Political Boss Who Staged a Comeback",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/john-burton-dead.html",
      "summary": "He left the House of Representatives while struggling with a crack addiction, his political career seemingly over. Actually, it had just begun."
    },
    {
      "title": "Trump Is Met With Mostly Boos at U.S. Open as Security Delays a Match",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/trump-us-open-tennis-boos-delays.html",
      "summary": "With the president in attendance at Arthur Ashe Stadium, the men’s final began as hundreds of people were still waiting to go through security screening."
    },
    {
      "title": "Maryland Gov. Wes Moore, Pressed About a Possible 2028 Run, Focuses on Re-election",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/wes-moore-2028-maryland.html",
      "summary": "Mr. Moore said in a TV interview that he “is not running for president.” The first-term governor, who has traded barbs with President Trump, said he was excited about seeking a second term."
    },
    {
      "title": "Trump Downplays Post Threatening Chicago, Saying He Wants to ‘Clean Up’ City",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/trump-chicago-war-us-open.html",
      "summary": "The president had said on social media that Chicago was “about to find out why it’s called the Department of WAR,” drawing a fierce rebuke from Democrats."
    },
    {
      "title": "RFK Jr., Rejecting Vaccine Data, Fuels Distrust of Public Health Agencies",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/kennedy-health-vaccines-cdc.html",
      "summary": "By promoting suspicions about the institutions he oversees, critics say Robert F. Kennedy Jr. is jeopardizing public health. He says he is pursuing transparency."
    },
    {
      "title": "Trump news at a glance: President tells foreign companies to ‘respect’ immigration law after Hyundai Ice raid",
      "url": "https://www.theguardian.com/us-news/2025/sep/08/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;South Korea has said that 300 of its nationals detained during the immigration raid would be flown home. Key US politics stories from Sunday 7 September at a glance&lt;/p&gt;&lt;p&gt;Donald Trump has told foreign companies that they must hire and train American workers and respect immigration laws, after a raid at a Hyundai Motor manufacturing facility in Georgia saw about 300 South Koreans detained.&lt;/p&gt;&lt;p&gt;Nearly 500 workers in total were detained in the raid on Thursday, with US authorities releasing footage showing them restrained in handcuffs and ankle chains, loaded on to buses.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/08/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump issues ‘last warning’ to Hamas to accept Gaza ceasefire deal",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/trump-gaza-israeli-hostages",
      "summary": "&lt;p&gt;President says ‘the Israelis have accepted my terms’ and urges release of hostages to secure peace agreement&lt;/p&gt;&lt;p&gt;Donald Trump on Sunday issued what he called his “last warning” to Hamas, urging the Palestinian militant group to accept a deal to release hostages from Gaza.&lt;/p&gt;&lt;p&gt;“The Israelis have accepted my Terms. It is time for Hamas to accept as well,” Trump said in a post on his Truth Social platform. “I have warned Hamas about the consequences of not accepting. This is my last warning, there will not be another one!”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/07/trump-gaza-israeli-hostages\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}