{
  "updatedAt": "2025-11-10T12:57:09.685Z",
  "items": [
    {
      "title": "8 Senators Break Ranks With Democrats and Advance G.O.P. Plan to End Shutdown",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/senators-democrat-shutdown-vote.html",
      "summary": "Two of them are retiring, and none of the others face re-election in 2026."
    },
    {
      "title": "Trump Pardons Giuliani and Others Involved in Effort to Overturn 2020 Election",
      "url": "https://www.nytimes.com/2025/11/10/us/giuilani-pardon-trump-john-eastman-sidney-powell.html",
      "summary": "The pardons of former Trump aides, which would only apply in federal court, are largely symbolic and cannot shield them from ongoing state-level prosecutions."
    },
    {
      "title": "Here’s the latest.",
      "url": "https://www.nytimes.com/live/2025/11/10/us/trump-government-shutdown-news/heres-the-latest",
      "summary": ""
    },
    {
      "title": "Trump Tries to Seize ‘Affordability’ as Americans’ Economic Worries Grow",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/trump-affordability-inflation-democrats.html",
      "summary": "The issue has buoyed Democrats and is resonating with an American electorate that is souring on the president’s economic agenda."
    },
    {
      "title": "R.F.K. Allies Embrace ‘Anti-Vax’ Label They Once Rejected",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/anti-vaccine-autism-kennedy.html",
      "summary": "A weekend gathering in Texas drew activists, homeopaths, doctors, lawyers, parents and a Republican senator who asked, “Why isn’t Tony Fauci in prison?”"
    },
    {
      "title": "Prison Guards Shaved His Dreadlocks. The Supreme Court Will Decide if He Can Sue.",
      "url": "https://www.nytimes.com/2025/11/10/us/supreme-court-dreadlocks-prisoner.html",
      "summary": "Lower courts condemned the treatment of Damon Landor, a Rastafarian, but found that a federal law protecting religious rights barred him from suing prison officials for money."
    },
    {
      "title": "First Thing: Senate advances funding bill to end longest US government shutdown in history",
      "url": "https://www.theguardian.com/us-news/2025/nov/10/first-thing-senate-advances-funding-bill-to-end-longest-us-government-shutdown-in-history",
      "summary": "&lt;p&gt;The amended package must be passed by the house and signed by the president. Plus, Volodymyr Zelenskyy on why he’s not afraid of Donald Trump&lt;/p&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;The Senate has made significant progress towards ending the longest US government shutdown in history, narrowly advancing a compromise bill to reauthorize funding and undo the layoffs of some employees.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What did the Democrats say about the bill?&lt;/strong&gt; “This healthcare crisis is so severe, so urgent, so devastating for families back home, that I cannot in good faith support this [resolution] that fails to address the healthcare crisis,” said Chuck Schumer, the Democratic majority leader.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What has the IDF said in response?&lt;/strong&gt; In a written statement, the IDF said it “remains committed to the rule of law and continues to operate in accordance with its legal and ethical obligations, despite the unprecedented operational complexity posed by Hamas’s systematic embedding within civilian infrastructure and its use of civilian sites for military purposes”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/10/first-thing-senate-advances-funding-bill-to-end-longest-us-government-shutdown-in-history\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Snap workers say Trump administration is ‘using country’s poorest as pawns’",
      "url": "https://www.theguardian.com/us-news/2025/nov/10/snap-workers-trump-administration-funding",
      "summary": "&lt;p&gt;Employees providing assistance to recipients expressed fears on how lack of aid will affect those who need it most&lt;/p&gt;&lt;p&gt;When Stacy Smith, a government worker, showed up to work last Monday – the first working day after food benefits lapsed, amid the ongoing federal shutdown – she found a long line outside her office door. Elderly and disabled individuals desperately wanted answers.&lt;/p&gt;&lt;p&gt;Some had gone to buy groceries, not realizing that their usual benefits were unavailable.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/10/snap-workers-trump-administration-funding\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}