{
  "updatedAt": "2025-09-24T06:51:29.510Z",
  "items": [
    {
      "title": "Like His Suspension, Kimmel’s Return Draws a Partisan Reaction",
      "url": "https://www.nytimes.com/2025/09/24/us/politics/jimmy-kimmel-monologue-reaction.html",
      "summary": "Ben Stiller, the actor and comedian, called Mr. Kimmel’s opening words a “brilliant monologue,” while some on the right questioned his authenticity."
    },
    {
      "title": "Adelita Grijalva Wins Arizona House Seat in Special Election, Shrinking G.O.P. Majority",
      "url": "https://www.nytimes.com/live/2025/09/23/us/trump-news/arizona-election-adelita-grijalva-democrat",
      "summary": "Adelita Grijalva won a special election on Tuesday in a reliably blue patch of her swing state to fill the seat held by her father before his death this year."
    },
    {
      "title": "Moulton Readies Primary Challenge Against Markey in Massachusetts",
      "url": "https://www.nytimes.com/2025/09/23/us/politics/seth-moulton-ed-markey-senate.html",
      "summary": "The coming Senate collision in the deep-blue state will be a test of the Democratic Party’s appetite for generational change."
    },
    {
      "title": "Trump at the U.N.: ‘Your Countries Are Going to Hell’",
      "url": "https://www.nytimes.com/video/us/politics/100000010416192/trump-at-the-un-your-countries-are-going-to-hell.html",
      "summary": "President Trump’s speech at the United Nations took an isolating stance. David Sanger, a White House correspondent for The New York Times, explains what that means for the United States."
    },
    {
      "title": "Storm Rips Part of Roof Off Oklahoma Hospital, Forcing Evacuations",
      "url": "https://www.nytimes.com/2025/09/23/us/oklahoma-storms-damage.html",
      "summary": "Some homes in the city of Sallisaw, in the eastern part of the state, were damaged, as were trees, power lines and poles, officials said."
    },
    {
      "title": "In a Sudden Shift, Trump Says Ukraine Can Win the War With Russia",
      "url": "https://www.nytimes.com/2025/09/23/us/politics/trump-russia-ukraine.html",
      "summary": "President Trump’s pivot could give him room to distance himself from a conflict that he once promised to solve in days or weeks."
    },
    {
      "title": "Trump angered by ‘bad escalator’ at UN as White House vows to investigate malfunction",
      "url": "https://www.theguardian.com/us-news/2025/sep/24/trump-angered-by-bad-escalator-stop-united-nations-white-house-vows-investigate-malfunction",
      "summary": "&lt;p&gt;Press secretary speculates the escalator stopped on purpose to humiliate president, but UN says safety function may have been ‘inadvertently triggered’&lt;/p&gt;&lt;p&gt;Donald Trump appeared to laugh it off Tuesday when an escalator and a teleprompter both malfunctioned during his United Nations visit – but for US officials it was no laughing matter.&lt;/p&gt;&lt;p&gt;The White House said an investigation had been launched into whether the moving stairway was stopped on purpose to humiliate the US president, who later bashed the global body in his speech to the UN general assembly in New York.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/24/trump-angered-by-bad-escalator-stop-united-nations-white-house-vows-investigate-malfunction\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Adelita Grijalva expected to win her late father’s House seat in Arizona special election",
      "url": "https://www.theguardian.com/us-news/2025/sep/23/adelita-grijalva-house-seat-arizona",
      "summary": "&lt;p&gt;Grijalva would be state’s first Latina in Congress, and Republicans’ House majority could shrink even further&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates\"&gt;US politics live – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Adelita Grijalva, the daughter of the late progressive congressman Raúl Grijalva, won a special election on Tuesday to fill the seat left open when her father died earlier this year.&lt;/p&gt;&lt;p&gt;Grijalva faced Republican challenger Daniel Butierez in the heavily blue seventh district in Arizona, which covers the southern parts of the state and the borderland areas.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/23/adelita-grijalva-house-seat-arizona\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}