{
  "updatedAt": "2025-10-10T18:35:31.372Z",
  "items": [
    {
      "title": "Melania Trump Says She Has Been Working With Putin to Reunite Missing Ukrainian Children",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/melania-trump-putin-ukraine-children.html",
      "summary": "“President Putin and I have had an open line of communication regarding the welfare of these children,” the first lady announced."
    },
    {
      "title": "Trump Administration Disapproves of Machado’s Nobel Prize, but Rubio Has Been a Big Supporter",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/nobel-trump-rubio-venezuela.html",
      "summary": "Marco Rubio was among eight Republican lawmakers who last year called the Venezuelan opposition leader “courageous and selfless” in a Nobel Prize nomination letter. Trump wanted the honor."
    },
    {
      "title": "Peter M. Fishbein, Lawyer Accused in Savings-and-Loan Lawsuit, Dies at 91",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/peter-fishbein-dead.html",
      "summary": "His firm’s $41 million settlement in representing Charles H. Keating Jr. raised questions about government overreach."
    },
    {
      "title": "Under Trump, E.P.A. Explored if Abortion Pills Could Be Detected in Wastewater",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/epa-abortion-wastewater.html",
      "summary": "Scientists at the Environmental Protection Agency found that they could develop methods to identify traces of the medication if necessary — a practice long sought by the anti-abortion movement."
    },
    {
      "title": "Explosion at Tennessee Ammunition Plant Leaves Multiple Dead and Several Others Missing",
      "url": "https://www.nytimes.com/2025/10/10/us/explosion-ammunition-plant-tennessee.html",
      "summary": "A number of people were missing after a “devastating blast” at Accurate Energetic Systems, about 60 miles southwest of Nashville, a county sheriff said."
    },
    {
      "title": "White House Signals Federal Layoffs Have Begun Amid Government Shutdown",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/federal-layoffs-government-shutdown.html",
      "summary": "The head of the White House budget office said on Friday that reductions in force had started."
    },
    {
      "title": "Federal layoffs have started, Trump’s budget chief says, as Congress remains deadlocked over funding to end shutdown – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Russ Vought, Trump’s OMB chief and Project 2025 architect, says federal ‘reductions in force’ have begun on 10th day of government shutdown&lt;/p&gt;&lt;p&gt;As the shutdown enters its 10th day, and both chambers are out of session today, House speaker &lt;strong&gt;Mike Johnson&lt;/strong&gt; has defended not passing a separate bill that would keep members of the military paid throughout the shutdown.&lt;/p&gt;&lt;p&gt;“Republicans have voted to OPEN the government and get our troops, Border Patrol, TSA, and veterans PAID,” Johnson said, before blaming Democratic leadership for refusing to pass the House-passed continuing resolution. “Chuck Schumer is terrified of a challenge from the Marxist left – so he and the Democrats voted to CLOSE the government-and to STOP PAYCHECKS from being issued.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump officials cancel major solar project in latest hit to renewable energy",
      "url": "https://www.theguardian.com/us-news/2025/oct/10/trump-officials-drop-major-solar-power-project-in-another-renewable-energy-attack",
      "summary": "&lt;p&gt;Esmeralda 7 in Nevada would have produced enough energy to power 2m homes&lt;/p&gt;&lt;p&gt;The &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; has killed a huge proposed &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/04/trump-clean-energy-cuts-democrat-states\"&gt;solar power project&lt;/a&gt; in &lt;a href=\"https://www.theguardian.com/us-news/nevada\"&gt;Nevada&lt;/a&gt; that would have been one of the largest in the world, indicating that the White House plans to attack not only wind power but all renewable energy.&lt;/p&gt;&lt;p&gt;On Thursday, the Bureau of Land Management (BLM) changed the status of the &lt;a href=\"https://www.theguardian.com/us-news/2024/jan/23/us-solar-energy-transition-land\"&gt;Esmeralda 7&lt;/a&gt; project to say its environmental review has been “&lt;a href=\"https://eplanning.blm.gov/eplanning-ui/project/2020804/510\"&gt;cancelled&lt;/a&gt;”, the climate publication Heatmap &lt;a href=\"https://heatmap.news/sparks/esmeralda-7-canceled-nevada-solar?utm_campaign=heatmap_am&amp;amp;utm_medium=email&amp;amp;_hsenc=p2ANqtz--CpT8Gwxiq5a7QEtKdFelple7fVwNWk8nj4O4AHIve0D_2mXXz87nFNdjpYLS9YvluiQaEb1GCApvdg6oeacqKDz0b99SLjOSigga7ilUOzg_Xzvs&amp;amp;_hsmi=384580979&amp;amp;utm_content=384580979&amp;amp;utm_source=hs_email\"&gt;first reported&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/10/trump-officials-drop-major-solar-power-project-in-another-renewable-energy-attack\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}