{
  "updatedAt": "2025-11-12T18:35:54.909Z",
  "items": [
    {
      "title": "How Some Democratic Voters Feel About the Senate Deal to End the Shutdown",
      "url": "https://www.nytimes.com/2025/11/12/us/politics/democrat-voters-government-shutdown-deal.html",
      "summary": "They are as divided as the party. Some wanted to continue to fight. Others were worried about jobs or people depending on SNAP food relief."
    },
    {
      "title": "Virginia’s Governor-Elect Wants a Say Over Leadership at U.Va.",
      "url": "https://www.nytimes.com/2025/11/12/us/virginia-governor-spanberger-uva-president.html",
      "summary": "Abigail Spanberger, a Democrat, told the university’s board that the choice of a new president, to replace one pushed out by Republicans over the summer, should be delayed until she is in office."
    },
    {
      "title": "Here’s the latest.",
      "url": "https://www.nytimes.com/live/2025/11/12/us/epstein-files-trump/heres-the-latest",
      "summary": ""
    },
    {
      "title": "By Not Funding Food Stamps, Trump Risks Lasting Damage to Safety Net",
      "url": "https://www.nytimes.com/2025/11/12/us/politics/trump-food-stamps-safety-net.html",
      "summary": "For the poorest Americans, the expected end to the longest shutdown in history has left doubt and anxiety around the benefits known as SNAP."
    },
    {
      "title": "What to Know About SNAP, America’s Main Food Aid Program",
      "url": "https://www.nytimes.com/2025/11/12/us/politics/snap-food-aid-government-shutdown.html",
      "summary": "The shutdown brought the scale of the federal food aid program into focus and raised questions about how such a rich country could have so many people on nutrition assistance."
    },
    {
      "title": "Israel’s president says Trump asked him to pardon Netanyahu, who has not been convicted.",
      "url": "https://www.nytimes.com/live/2025/11/12/us/trump-government-shutdown-news/israels-president-says-trump-asked-him-to-pardon-netanyahu-who-has-not-been-convicted",
      "summary": ""
    },
    {
      "title": "White House says ‘unnamed victim’ Trump ‘spent hours’ with was Virginia Giuffre, accusing Democrats of ‘fake narrative’ – live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/12/donald-trump-us-government-shutdown-house-democrats-republicans-latest-news-updates",
      "summary": "&lt;p&gt;Spokesperson says Giuffre repeatedly said Trump was not involved in any wrongdoing as she accuses Democrats of trying to ‘smear’ president&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/12/jeffrey-epstein-new-emails-donald-trump\"&gt;Trump knew about Epstein’s conduct, newly released emails suggest&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/12/adelita-grijalva-arizona-swearing-in\"&gt;Democrat who could force Epstein vote to be sworn in after standoff&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;In a new batch of emails&lt;a href=\"https://x.com/OversightDems/status/1988600468990484626?s=20\"&gt; released by Democrats&lt;/a&gt; on the House oversight committee, Jeffrey Epstein wrote that Donald Trump knew about the late financier and sex-offender’s conduct. In the three emails released, Epstein apparently told his accomplice Ghislaine Maxwell that Trump &lt;strong&gt;“spent hours”&lt;/strong&gt; at his house with one of Epstein’s victims.&lt;/p&gt;&lt;p&gt;In two other emails to author Michael Wolff, Epstein wrote that &lt;strong&gt;“of course he knew about the girls”&lt;/strong&gt;, referring to the now-president. According to the exchanges, Epstein also solicited Wolff’s advice about how he should handle Trump discussing their friendship in an interview with CNN. “I think you should let him hang himself,” Wolff writes. “If he says he hasn’t been on the plane or to the house, then that gives you a valuable PR and political currency."
    },
    {
      "title": "Former AOC staffer running for Pelosi’s seat promises to root out corruption – and Trump’s ballroom",
      "url": "https://www.theguardian.com/us-news/2025/nov/12/chakrabarti-aoc-pelosis-trump-ballroom",
      "summary": "&lt;p&gt;Saikat Chakrabarti wants to turn Trump’s gilded ballroom into a museum on authoritarianism&lt;/p&gt;&lt;p&gt;Rooting out corruption in government is at the center of Saikat Chakrabarti’s campaign for &lt;a href=\"https://www.theguardian.com/us-news/us-congress\"&gt;Congress&lt;/a&gt;. And if elected next year, the 39-year-old former Silicon Valley engineer – now running to succeed &lt;a href=\"https://www.theguardian.com/us-news/nancy-pelosi\"&gt;Nancy Pelosi&lt;/a&gt; in her long-held San Francisco seat, says he would put it on display for every American to see.&lt;/p&gt;&lt;p&gt;As part of his anti-corruption agenda, Chakrabarti says he would introduce legislation to turn Donald Trump’s &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/22/donald-trump-white-house-ballroom\"&gt;gilded White House ballroom&lt;/a&gt; into the “Smithsonian Museum on Corruption and Authoritarianism”.Looking ahead to a post-Trump Washington, Chakrabarti envisions filling the 90,000-square-foot structure, to be built in place of the now-demolished East Wing, with exhibits dedicated to the “modern dangers posed by the current wannabe dictator, the ongoing threat of authoritarianism, assaults on the rule of law, and the pervasive corruption of the billionaire class”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/12/chakrabarti-aoc-pelosis-trump-ballroom\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}