{
  "updatedAt": "2025-09-30T12:55:42.856Z",
  "items": [
    {
      "title": "Hundreds of Top Military Officers Gather for Meeting With Trump and Hegseth",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/trump-hegseth-military-officers.html",
      "summary": "The U.S. generals and admirals summoned from around the world have been given little information about the planned event."
    },
    {
      "title": "Here’s How a Government Shutdown Works",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/government-shutdown-congress.html",
      "summary": "Federal funding will lapse this week if Congress does not act. Areas across the government will be affected."
    },
    {
      "title": "In Some States, Strapped Counties Must Impose Trump’s Medicaid Cuts",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/counties-medicaid-cuts.html",
      "summary": "The president’s domestic policy law created complex new work requirements for Medicaid and food stamps, but left the states to administer them. Colorado pushes that burden to its counties."
    },
    {
      "title": "Florida Plans to Hand Over Prime Miami Property for Trump Library",
      "url": "https://www.nytimes.com/2025/09/30/us/miami-property-trump-library.html",
      "summary": "President Trump has not revealed any concrete plans for a future library, but his son and others have been scouting possible sites in South Florida for months."
    },
    {
      "title": "A Liberal Group Returns to Push Democrats to Oppose Trump",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/trump-judges-courts-democrats.html",
      "summary": "The organization, Demand Justice, will use its megaphone to call on lawmakers to “demonstrate steadfast opposition to the dismantling and corruption of our legal system, courts and the rule of law.”"
    },
    {
      "title": "Memphis Braces for the National Guard",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/national-guard-memphis-tennessee.html",
      "summary": "Drained by years of crime and conservative criticism, Memphis is set to receive a wave of federal agents that residents are divided over."
    },
    {
      "title": "‘We’re ending the war on warriors’: Pete Hegseth addresses senior military leaders in Virginia – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
      "summary": "&lt;p&gt;Defense secretary speaks to hundreds of generals and admirals who have been summoned at short notice to the Marine Corps Museum in Quantico&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The US government is hurtling towards its first shutdown in six years, with no signs &lt;a href=\"https://www.theguardian.com/us-news/us-congress\"&gt;congressional&lt;/a&gt; leaders are near agreement on legislation to continue funding beyond the Tuesday night deadline to prevent workers from being furloughed and agencies from shutting their doors.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Congress’s &lt;a href=\"https://www.theguardian.com/us-news/republicans\"&gt;Republican&lt;/a&gt; majority is pushing legislation to fund the government through 21 November, but Democrats have refused to vote for it unless it includes a series of concessions centered on healthcare.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Cat Stevens postpones book tour of North America due to visa issues",
      "url": "https://www.theguardian.com/us-news/2025/sep/30/cat-stevens-postpones-book-tour-visa",
      "summary": "&lt;p&gt;Singer who now goes by Yusuf Islam was set to tour in support of his book, Cat on the Road to Findout, out in the US in October&lt;/p&gt;&lt;p&gt;Cat Stevens, who now goes by Yusuf Islam, has postponed the North American leg of his &lt;a href=\"https://www.theguardian.com/books/2025/sep/26/cat-on-the-road-to-findout-by-yusufcat-stevens-review-fame-faith-and-charity\"&gt;book&lt;/a&gt; tour due to unspecified visa issues, the singer announced on social media Monday.&lt;/p&gt;&lt;p&gt;The Rock &amp;amp; Roll Hall of Fame member was set to tour in support of his book, Cat on the Road to Findout, which will release in the US on 7 October and was made available in the UK earlier in September. The book release won’t be impacted, Islam wrote, noting that “books don’t need visas!”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/30/cat-stevens-postpones-book-tour-visa\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}