{
  "updatedAt": "2025-10-22T12:57:52.752Z",
  "items": [
    {
      "title": "Nancy Pelosi Hasn’t Announced Her 2026 Plans. Scott Wiener Is Running Anyway.",
      "url": "https://www.nytimes.com/2025/10/22/us/pelosi-congress-scott-wiener.html",
      "summary": "Scott Wiener, a Democratic state legislator, says he can’t afford to keep deferring to Representative Nancy Pelosi."
    },
    {
      "title": "Trump Empowers Election Deniers, Still Fixated on 2020 Grievances",
      "url": "https://www.nytimes.com/2025/10/22/us/politics/trump-election-deniers-voting-security.html",
      "summary": "The president has placed proponents of his false claims into government jobs while dismantling systems built to secure voting, raising fears that he aims to seize authority over elections ahead of next year’s midterms."
    },
    {
      "title": "Colleges Face a Reckoning: Is a Degree Really Necessary?",
      "url": "https://www.nytimes.com/2025/10/22/us/value-of-higher-education-attainment-rates-graduation.html",
      "summary": "Wyoming is one of many states that embraced a campaign to encourage more people to enroll in higher education. Some leaders and students wonder if they reached a limit."
    },
    {
      "title": "Vehicle Crashes Into Security Gate Outside the White House",
      "url": "https://www.nytimes.com/2025/10/21/us/white-house-car-crash.html",
      "summary": "The Secret Service said the driver was arrested and there was no longer a threat. President Trump was in the White House at the time, the agency said."
    },
    {
      "title": "Ecuador Rejects Prosecution of Survivor of U.S. Strike on Vessel",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/ecuador-us-strike-survivor.html",
      "summary": "The country has freed the man, one of two survivors of a U.S. military strike on a submersible vessel last week, defying President Trump’s claim that he would be held and prosecuted."
    },
    {
      "title": "What to Know About Trump’s Plan for a Triumphal Arch in Washington",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/trump-arch-washington-memorial.html",
      "summary": "President Trump has proposed construction of an arch in the style of the Arc de Triomphe in Washington in the lead-up to the nation’s 250th anniversary."
    },
    {
      "title": "NY mayor and police distance themselves from Ice raids amid Chinatown protests – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/22/donald-trump-ice-immigration-shutdown-courts-nato-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Comments by Eric Adams and NYPD that city has ‘no involvement’ follow protests over raids related to ‘selling counterfeit goods’&lt;/p&gt;&lt;p&gt;Senate minority leader &lt;strong&gt;Chuck Schumer &lt;/strong&gt;said that the federal immigration raid targeting street vendors in Manhattan was “indiscriminate, wrong, and destructive”.&lt;/p&gt;&lt;p&gt;Department of Homeland Security (DHS) officials said the operation was “targeted” and “focused on criminal activity relating to the selling of counterfeit goods”. The arrests sparked protests outside 26 Federal Plaza, where several immigrants were detained.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/22/donald-trump-ice-immigration-shutdown-courts-nato-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Wild bear pays surprise visit to bear enclosure at California zoo: ‘He was very polite’",
      "url": "https://www.theguardian.com/us-news/2025/oct/22/wild-bear-sequoia-park-zoo",
      "summary": "&lt;p&gt;Sequoia Park Zoo said staff were doing an inspection when they saw a wild black bear looking in at three captive bears&lt;/p&gt;&lt;p&gt;A wild bear in California has broken into a zoo and paid an unexpected visit to the bear enclosure.&lt;/p&gt;&lt;p&gt;In a Facebook post, the Sequoia Park Zoo in Eureka in the northern part of the state &lt;a href=\"https://www.facebook.com/SequoiaParkZoo/posts/pfbid02EWaVPPELFA8ykeZzsEwyHdzeX6JxGziNAR1UMqxvb1U7Gn9ZoboHYJEi68JjxGkSl\"&gt;said&lt;/a&gt; its staff were conducting a routine inspection of part of the complex when they spotted a wild American black bear leaning on a gate and looking in at three captive black bears in their enclosure.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/22/wild-bear-sequoia-park-zoo\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}