{
  "updatedAt": "2025-09-20T18:41:06.253Z",
  "items": [
    {
      "title": "Top Democratic Leaders Ask Trump for Meeting to Avert a Shutdown",
      "url": "https://www.nytimes.com/2025/09/20/us/politics/jeffries-schumer-trump.html",
      "summary": "After a Republican plan to keep funding flowing foundered in the Senate, Representative Hakeem Jeffries and Senator Chuck Schumer accused the president of standing in the way of a solution."
    },
    {
      "title": "Trump Escalates Attack on Free Speech",
      "url": "https://www.nytimes.com/video/us/politics/100000010409626/trump-escalates-attack-on-free-speech.html",
      "summary": "Zolan Kanno-Youngs, a White House correspondent for The New York Times, describes how the Trump administration’s pressuring of ABC to take action against Jimmy Kimmel is part of a broader crackdown by the administration since the assassination of Charlie Kirk."
    },
    {
      "title": "Arrest in Arizona Before Charlie Kirk Memorial Heightens Security Concerns",
      "url": "https://www.nytimes.com/2025/09/20/us/charlie-kirk-memorial-security-arizona.html",
      "summary": "The man was posing as a law enforcement officer, the authorities said, and was taken into custody."
    },
    {
      "title": "U.S. Military Buildup in Caribbean Signals Broader Campaign Against Venezuela",
      "url": "https://www.nytimes.com/2025/09/20/us/politics/trump-venezuela-military-buildup.html",
      "summary": "Trump officials say the mission aims to disrupt the drug trade. But military officials and analysts say the real goal might be driving Venezuela’s president from power."
    },
    {
      "title": "What to Know About Charlie Kirk’s Funeral: Time, How to Watch and Speakers",
      "url": "https://www.nytimes.com/2025/09/20/us/charlie-kirk-funeral-memorial-time-guests.html",
      "summary": "The conservative activist will be honored in a public program on Sunday, with President Trump and several top administration officials expected to speak."
    },
    {
      "title": "Inside The Times’s Reporting and Judgment Calls on Charlie Kirk’s Assassination",
      "url": "https://www.nytimes.com/2025/09/20/us/charlie-kirk-shooting-news-coverage.html",
      "summary": "We gathered some of the journalists closely involved to discuss how we approached coverage and to answer readers’ questions about it."
    },
    {
      "title": "The students who debated with Charlie Kirk: ‘His goal was to verbally defeat us’",
      "url": "https://www.theguardian.com/us-news/ng-interactive/2025/sep/20/charlie-kirk-debate-style",
      "summary": "&lt;p&gt;Young liberals challenged Kirk’s conservative views on the viral YouTube series Surrounded - an ‘unnerving’ spectacle, according to a rhetoric expert&lt;/p&gt;&lt;p&gt;In the days after his killing, &lt;a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"&gt;Charlie Kirk&lt;/a&gt; was remembered by his allies as a great debater. A quote taken from a widely shared &lt;a href=\"https://x.com/BGatesIsaPyscho/status/1966060121299079552\"&gt;video&lt;/a&gt; of Kirk discussing &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/12/charlie-kirk-young-conservatives-social-media\"&gt;his life’s work&lt;/a&gt; – “when people stop talking, that’s when violence happens” – emblematized such eulogies.&lt;/p&gt;&lt;p&gt;Kirk toured American college campuses with his rightwing non-profit Turning Point USA, where he would set up a tent, table and microphone, and debate with undergrads. The goal, he &lt;a href=\"https://www.npr.org/2025/09/11/nx-s1-5537080/the-life-and-legacy-of-charlie-kirk\"&gt;said&lt;/a&gt;, was to “save western civilization”, and remembrances after his death positioned him as a budding statesman – a conservative&lt;strong&gt; &lt;/strong&gt;hero who strode&lt;strong&gt; &lt;/strong&gt;across the political divide for the sake of open dialogue.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/sep/20/charlie-kirk-debate-style\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Man armed with gun and knife detained at Charlie Kirk memorial service venue",
      "url": "https://www.theguardian.com/us-news/2025/sep/20/charlie-kirk-memorial",
      "summary": "&lt;p&gt;US Secret Service in Phoenix says man said he was law enforcement and there to provide private security&lt;/p&gt;&lt;p&gt;A man armed with a gun and a knife was detained Saturday at State Farm Stadium near Phoenix before &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/19/workers-disciplined-charlie-kirk-shooting\"&gt;Charlie Kirk&lt;/a&gt;’s memorial service at that venue on Sunday – with authorities accusing him of brandishing inactive law enforcement credentials and lacking permission to be there.&lt;/p&gt;&lt;p&gt;In a &lt;a href=\"https://x.com/MattFinnFNC/status/1969416460218089629\"&gt;statement&lt;/a&gt; released Saturday, the US Secret Service said that it was coordinating with local law enforcement in Glendale, Arizona, to investigate “an individual who was observed exhibiting suspicious behavior at State Farm Stadium”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/20/charlie-kirk-memorial\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}