{
  "updatedAt": "2025-10-12T06:34:02.538Z",
  "items": [
    {
      "title": "At Least 1 Dead and 3 Injured After Shootings at Mississippi Universities",
      "url": "https://www.nytimes.com/2025/10/11/us/mississippi-shooting-jackson-alcorn.html",
      "summary": "The shootings at historically Black institutions occurred within about 24 hours of three other shootings across rural Mississippi that left at least eight people dead."
    },
    {
      "title": "Jesse L. Douglas, Aide to King in Marches From Selma, Is Dead at 90",
      "url": "https://www.nytimes.com/2025/10/11/us/jesse-l-douglas-dead.html",
      "summary": "A lieutenant to Martin Luther King Jr. and a fellow preacher, he played a vital role in organizing voting-rights protests in 1965 that began with “Bloody Sunday.”"
    },
    {
      "title": "In L.A., a Former Ally of Mayor Bass Is Expected to Run Against Her",
      "url": "https://www.nytimes.com/2025/10/11/us/mayor-bass-austin-beutner.html",
      "summary": "The former supporter, Austin Beutner, who once led the city’s public schools as superintendent, is expected to challenge Ms. Bass’s re-election bid in next year’s mayoral race."
    },
    {
      "title": "At Least 3 Are Injured on the Ground After Helicopter Crashes in California",
      "url": "https://www.nytimes.com/2025/10/11/us/helicopter-crash-huntington-beach-california.html",
      "summary": "Two people were pulled from the wreckage, the police said. It was not clear what led up to the crash or the severity of the victims’ injuries."
    },
    {
      "title": "Appeals Court Allows Federalized National Guard, But Leaves Block on Chicago Deployment in Place",
      "url": "https://www.nytimes.com/2025/10/11/us/national-guard-chicago.html",
      "summary": "An appeals court said National Guard troops could remain under the Trump administration’s control, but left in place an earlier temporary ruling barring troops from deploying into the Chicago area as a legal fight proceeds."
    },
    {
      "title": "Among Portland Protests, It’s Frogs and Sharks and Bears, Oh My!",
      "url": "https://www.nytimes.com/2025/10/11/us/politics/portland-protests.html",
      "summary": "Images of anarchists clad in black gave the city a bad name in 2020. Now, demonstrators in Portland are poking fun at President Trump’s apocalyptic talk with colorful animal suits."
    },
    {
      "title": "Helicopter spins out of control into palm trees at popular California beach",
      "url": "https://www.theguardian.com/us-news/2025/oct/12/helicopter-spins-out-of-control-into-palm-trees-at-popular-california-beach",
      "summary": "&lt;p&gt;Five people taken to hospital after crash at Huntington Beach in front of beachgoers&lt;/p&gt;&lt;p&gt;A helicopter flying above a popular southern California beach suddenly began spiralling out of control, eventually losing altitude and crashing into a row of palm trees as beachgoers looked on.&lt;br&gt;&lt;br&gt; Videos posted online show the aircraft starting to spin above Huntington Beach then plunging towards the edge of the beach, where it becomes wedged between palms and a staircase near the Pacific Coast highway.&lt;/p&gt;&lt;p&gt;The Huntington Beach fire department said five people were taken to hospital including two who were in the helicopter and were “safely pulled from the wreckage” after the crash on Saturday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/12/helicopter-spins-out-of-control-into-palm-trees-at-popular-california-beach\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: US troops will be paid despite shutdown, president claims",
      "url": "https://www.theguardian.com/us-news/2025/oct/12/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;Donald Trump says he has directed the defence secretary to release funds on 15 October. Key US politics stories from 11 October at a glance&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; claimed he had found a way to pay &lt;a href=\"https://www.theguardian.com/us-news/us-military\"&gt;US military&lt;/a&gt; troops despite the federal government shutdown, saying he had instructed his defence secretary, &lt;a href=\"https://www.theguardian.com/us-news/pete-hegseth\"&gt;Pete Hegseth&lt;/a&gt;, to release funds.&lt;/p&gt;&lt;p&gt;Posting on his Truth Social platform, Trump wrote: “I am using my authority, as commander-in-chief, to direct our secretary of war, Pete Hegseth, to use all available funds to get our troops PAID on October 15.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/12/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}