{
  "updatedAt": "2025-10-04T06:34:03.517Z",
  "items": [
    {
      "title": "Man Drives Car Onto Sidewalk Outside L.A. City Hall, Barricading Himself Inside",
      "url": "https://www.nytimes.com/2025/10/03/us/la-city-hall-car.html",
      "summary": "A man in a vehicle displaying a handwritten sign referring to President Trump refused to exit his car as the authorities shut down surrounding streets. The man was taken into custody."
    },
    {
      "title": "Trump Administration Is Said to Plan to Cut Refugee Admissions to a Record Low",
      "url": "https://www.nytimes.com/2025/10/03/us/politics/trump-refugee-admissions-south-africa.html",
      "summary": "Many of the slots would go to white South Africans and others facing “unjust discrimination,” according to people familiar with the matter and documents obtained by The New York Times."
    },
    {
      "title": "Marjorie Taylor Greene Criticizes Senate Republicans for Government Shutdown",
      "url": "https://www.nytimes.com/2025/10/03/us/politics/marjorie-taylor-greene-shutdown.html",
      "summary": "In a social media post, the far-right Georgia congresswoman called on Senate Republicans to eliminate the filibuster, lowering the threshold on future legislation to a simple majority."
    },
    {
      "title": "Federal Workers’ Union Sues Administration Over Partisan Email Language",
      "url": "https://www.nytimes.com/2025/10/03/us/politics/partisan-emails-education-dept-workers-lawsuit.html",
      "summary": "Department of Education employees this week found that their out-of-office emails during the government shutdown had been edited to include partisan language."
    },
    {
      "title": "Journalist Mario Guevara Is Deported After Being Held Over 100 Days",
      "url": "https://www.nytimes.com/2025/10/03/us/mario-guevara-journalist-deported.html",
      "summary": "The Salvadoran journalist was arrested in June while covering a “No Kings” protest outside Atlanta. Those charges were dropped, his lawyers said."
    },
    {
      "title": "Reaching for a Connection to Taylor Swift",
      "url": "https://www.nytimes.com/2025/10/03/us/politics/evan-munsing-taylor-swift.html",
      "summary": "A Democrat in a crowded House primary in Colorado is far from the only politician grasping for Taylor Swift-related straws."
    },
    {
      "title": "Trump says Hamas response to peace plan means ‘peace in the Middle East’ is ‘very close’ – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
      "summary": "&lt;p&gt;US president welcomes Hamas response to his Gaza plan despite group saying further negotiations are required over details. This blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/world/2025/oct/02/hamas-likely-to-accept-trump-peace-plan-with-key-revisions-experts-say\"&gt;Hamas could ask for revisions to Trump Gaza plan, sources and analysts say&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/03/trump-government-shutdown-republicans-democrats\"&gt;US government shutdown day three: Republicans and Democrats make little progress on deal&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/03/trump-administration-shutdown-chicago\"&gt;Trump administration freezes $2.1bn in funds for Chicago transit projects&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;As the world waits for Hamas’s response to Donald Trump’s &lt;a href=\"https://www.theguardian.com/world/2025/sep/29/trump-peace-plan-gaza-israel-hamas\"&gt;peace plan for Gaza&lt;/a&gt;, the US president has issued a new deadline for the militant group of &lt;strong&gt;6pm ET on Sunday&lt;/strong&gt;.&lt;/p&gt;&lt;p&gt;Trump, who on Monday gave Hamas “three or four days” to respond to his ultimatum, said they were being given “one last chance”. He wrote on his Truth Social platform this morning:&lt;/p&gt;&lt;p&gt;Every Country has signed on! &lt;strong&gt;If this LAST CHANCE agreement is not reached, all HELL, like no one has ever seen before, will break out against Hamas&lt;/strong&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "California measure brings rideshare drivers one step closer to unionizing",
      "url": "https://www.theguardian.com/us-news/2025/oct/03/california-ride-hailing-drivers-union",
      "summary": "&lt;p&gt;Governor Gavin Newsom signs measure opening path to more than 800,000 drivers to bargain for wages and benefits&lt;/p&gt;&lt;p&gt;More than 800,000 ride-hailing drivers in California will soon be able to join a union and negotiate for higher wages and better benefits under a measure signed Friday by the governor, &lt;a href=\"https://www.theguardian.com/us-news/gavin-newsom\"&gt;Gavin Newsom&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;Supporters said the new law will open a path for the largest expansion of private-sector collective bargaining rights in the state’s history. The legislation is a significant compromise in the years-long battle between labor unions and tech companies.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/03/california-ride-hailing-drivers-union\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}