{
  "updatedAt": "2025-11-02T18:32:37.202Z",
  "items": [
    {
      "title": "Syria’s President to Visit Washington for First Time Since Taking Power",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/syrian-president-al-shara-washington-visit.html",
      "summary": "The president, Ahmed al-Shara, was, until recently, wanted by the United States as a terrorist with a $10 million bounty on his head."
    },
    {
      "title": "Latest U.S. Military Boat Strike in Caribbean Sea Kills 3, Pete Hegseth Says",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/us-boat-strike-caribbean.html",
      "summary": "The strike, carried out on Saturday, was the 15th announced by the administration in its campaign against vessels it claims are smuggling drugs."
    },
    {
      "title": "For SNAP Recipients, Anxiety Over Funding Leads to Hard Choices",
      "url": "https://www.nytimes.com/2025/11/02/us/im-going-to-stretch-it-anxiety-over-snap-leads-to-hard-choices.html",
      "summary": "At one grocery store in Massachusetts, shoppers grappled with growing fears and lighter carts."
    },
    {
      "title": "Austin Asked Voters to Raise Taxes for the Homeless. It’s Not Going Well.",
      "url": "https://www.nytimes.com/2025/11/02/us/austin-tax-vote.html",
      "summary": "A proposed tax hike before the city on Tuesday has become a referendum on governance in the fast-changing Texas capital."
    },
    {
      "title": "Food Stamp Cuts Expose Trump’s Strategy to Use Shutdown to Advance Agenda",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/trump-strategy-food-stamps.html",
      "summary": "The president has stretched the limits of his powers to help those at the heart of his agenda, not the many in greatest need."
    },
    {
      "title": "Anger Over ICE Raids Is Driving Some Latino Voters to the Polls",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/elections-latino-turnout-ice-raids.html",
      "summary": "Democrats are concerned that the immigration crackdown will hurt Latino turnout on Tuesday. Republicans dispute that the raids will play any role in the election."
    },
    {
      "title": "FBI fires top official amid Kash Patel’s outrage over reports of agency jet use",
      "url": "https://www.theguardian.com/us-news/2025/nov/02/fbi-fires-top-official-kash-patel-jet-use",
      "summary": "&lt;p&gt;Patel reportedly became furious after revelation he flew to visit girlfriend and agency fired official who oversees fleet&lt;/p&gt;&lt;p&gt;A top &lt;a href=\"https://www.theguardian.com/us-news/fbi\"&gt;FBI&lt;/a&gt; official with 27 years standing has reportedly been fired by the bureau after its director, Kash Patel, became enraged by press stories revealing he had used a government jet to travel to see his girlfriend sing the national anthem at a wrestling match.&lt;/p&gt;&lt;p&gt;Steven Palmer, who had worked at the bureau since 1998, was fired as head of the FBI’s critical incident response group which is responsible for handling major security threats as well as overseeing the agency’s fleet of jets. He was the third head of the unit to be dismissed since Patel became the second Trump administration’s FBI director in February.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/02/fbi-fires-top-official-kash-patel-jet-use\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "California set to approve Prop 50 as voters signal displeasure with Trump",
      "url": "https://www.theguardian.com/us-news/2025/nov/02/california-prop-50-democrats-trump",
      "summary": "&lt;p&gt;Voters set to accept new maps to help Democrats counter Republican gerrymandering – and check president’s power&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/california\"&gt;California&lt;/a&gt;’s Proposition 50 began as a warning from the nation’s largest blue state to its largest red one: &lt;a href=\"https://x.com/CAgovernor/status/1958202719052697630\"&gt;don’t poke the bear&lt;/a&gt;. But when Texas &lt;a href=\"https://www.theguardian.com/us-news/2025/aug/18/texas-democrats-california-electoral-maps-redistricting\"&gt;moved ahead &lt;/a&gt;with a rare, mid-decade gerrymander, pushed by Donald Trump as Republicans seek to shore up their fragile House majority in the midterm elections, California made good on its threat.&lt;/p&gt;&lt;p&gt;Now, California voters appear poised to approve a redistricting measure placed on the ballot in August by Democrats and the state’s governor, &lt;a href=\"https://www.theguardian.com/us-news/gavin-newsom\"&gt;Gavin Newsom&lt;/a&gt;, who have cast it as a chance &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/25/california-prop-50-trump-redistricting\"&gt;to check Trump’s power&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/02/california-prop-50-democrats-trump\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}