{
  "updatedAt": "2025-11-07T06:39:14.765Z",
  "items": [
    {
      "title": "To Preserve Records, Homeland Security Now Relies on Officials to Take Screenshots",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/homeland-security-foia.html",
      "summary": "Experts say the new policy, which ditches software that automatically captured text messages, opens ample room for both willful and unwitting noncompliance with federal records laws."
    },
    {
      "title": "San Francisco Sees Nancy Pelosi as a Tireless Leader for the City",
      "url": "https://www.nytimes.com/2025/11/06/us/nancy-pelosi-san-francisco-retirement.html",
      "summary": "Representative Nancy Pelosi, after announcing her retirement, was praised by many San Franciscans for her tireless efforts on behalf of the city. Some of her work went unheralded."
    },
    {
      "title": "Antisemitism Task Force Severs Ties With the Heritage Foundation",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/heritage-foundation-antisemitism-task-force.html",
      "summary": "The move comes as the venerable conservative think tank is roiled by turmoil caused by its leader’s defense of a Tucker Carlson interview with a white nationalist."
    },
    {
      "title": "How Is Trump Changing Colleges and Universities? Tell Us.",
      "url": "https://www.nytimes.com/2025/11/06/us/universities-changes-trump-callout.html",
      "summary": "There has been a shift in campus culture. We want to hear from faculty members across the United States."
    },
    {
      "title": "As Hours Dwindled Before Flight Cuts, the Government Was Publicly Mum",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/flight-cuts-government-airports-faa.html",
      "summary": "Airlines did not wait for an announcement, notifying passengers and airports of expected changes before the Trump administration made official its list of affected airports."
    },
    {
      "title": "Nancy Pelosi&#39;s Rise From Stay-at-Home Mom to House Speaker",
      "url": "https://www.nytimes.com/2025/11/06/us/nancy-pelosi-career-highlights.html",
      "summary": "The daughter of a politician, she didn’t expect to become one. But once she ran for office in 1987, there was no stopping her."
    },
    {
      "title": "US strikes another alleged drug boat bringing death toll from campaign in Latin America to 70",
      "url": "https://www.theguardian.com/us-news/2025/nov/07/us-strikes-another-alleged-drug-boat-latin-america",
      "summary": "&lt;p&gt;US strikes have destroyed at least 18 vessels, but Washington has yet to make public any concrete evidence that its targets posed a threat to America&lt;/p&gt;&lt;p&gt;US forces struck another alleged drug trafficking boat in the Caribbean, killing three people, defense secretary Pete Hegseth has said, bringing the death toll from the Trump administration’s controversial campaign to at least 70.&lt;/p&gt;&lt;p&gt;The US began carrying out such strikes – which some experts say amount to extrajudicial killings even if they target known traffickers – &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/02/trump-venezuela-boat-lethal-strike\"&gt;in early September&lt;/a&gt;, taking aim at vessels in the Caribbean and eastern Pacific.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/07/us-strikes-another-alleged-drug-boat-latin-america\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump administration ‘failed to consider the harms’ in not supporting Snap, judge says in ruling that demands funds by Friday –as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
      "summary": "&lt;p&gt;This live blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/06/trump-administration-news-updates-today\"&gt;Trump news at a glance: administration reduces US flights as shutdown stretches on&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/06/ruling-snap-benefits-funding-trump\"&gt;US judge orders Trump administration to fully fund Snap benefits in November&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;It’s now day 37 of the ongoing government shutdown, the longest on record, with both parties continuing to blame the other for the lapse in funding.&lt;/p&gt;&lt;p&gt;For his part, Donald Trump has turned his attention to the filibuster – the procedural mechanism that requires 60 votes in the Senate to end debate on a piece of legislation and bring it to the floor for a vote. He’s hammered home his wishes on Truth Social, and in front of lawmakers at a White House breakfast on Tuesday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}