{
  "updatedAt": "2025-10-12T18:32:35.043Z",
  "items": [
    {
      "title": "Helena Moreno Is Elected Mayor of New Orleans",
      "url": "https://www.nytimes.com/2025/10/12/us/new-orleans-mayor-primary-helena-moreno.html",
      "summary": "Facing challenging political headwinds and deep frustration among residents, a Democratic city councilwoman promises a turnaround."
    },
    {
      "title": "How Trump’s Chicago Immigration Crackdown Escalated, in 10 Videos",
      "url": "https://www.nytimes.com/2025/10/12/us/chicago-immigration-crackdown-videos.html",
      "summary": "Week by week, the federal campaign to ramp up immigration enforcement in the Chicago area has created fear and inflamed tensions."
    },
    {
      "title": "South Carolina Bar Shooting Leaves at Least 4 Dead, Sheriff Says",
      "url": "https://www.nytimes.com/2025/10/12/us/south-carolina-st-helena-shooting-bar.html",
      "summary": "Four people were in critical condition after an early-morning shooting that left 12 other people injured on Sunday in St. Helena, S.C., according to the Beaufort County Sheriff’s Office."
    },
    {
      "title": "Trump Announces Longtime Aide Dan Scavino as Head of Personnel",
      "url": "https://www.nytimes.com/2025/10/12/us/politics/dan-scavino-trump-white-house-personnel.html",
      "summary": "Mr. Scavino, one of Mr. Trump’s most trusted advisers and a deputy chief of staff, has been by his side since the 2016 campaign."
    },
    {
      "title": "Rethinking Bruce Springsteen’s Difficult Years",
      "url": "https://www.nytimes.com/2025/10/12/us/bruce-springsteen-film-hostage-tennessee-keaton.html",
      "summary": "A film argues that an American icon may have made his best music in some of his lowest moments."
    },
    {
      "title": "The Destructive Legacy of California’s Zombie Fires",
      "url": "https://www.nytimes.com/2025/10/12/us/palisades-zombie-fires.html",
      "summary": "Blazes that firefighters thought had died but then later came roaring back to life have become increasingly common, heightening scrutiny of how first-responders put out wildfires."
    },
    {
      "title": "Trump ‘looking at all options’ amid threats to invoke Insurrection Act, Vance says",
      "url": "https://www.theguardian.com/us-news/2025/oct/12/trump-vance-insurrection-act-military",
      "summary": "&lt;p&gt;Vice-president calls crime ‘out of control’ in US cities as Trump faces legal battles for use of federal forces&lt;/p&gt;&lt;p&gt;The White House is talking about invoking the &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/07/trump-insurrection-act-explainer\"&gt;Insurrection Act&lt;/a&gt; that would allow the deployment of military troops on US soil to quell domestic unrest amid legal challenges over the moves, &lt;a href=\"https://www.theguardian.com/us-news/jd-vance\"&gt;JD Vance&lt;/a&gt; confirmed on Sunday.&lt;/p&gt;&lt;p&gt;Vance was asked on NBC News’s Meet the Press whether &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; was seriously considering invoking the emergency power to deploy national guard forces and even the US military in domestic settings.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/12/trump-vance-insurrection-act-military\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "South Carolina bar shooting leaves four people dead and 20 injured, officials say",
      "url": "https://www.theguardian.com/us-news/2025/oct/12/south-carolina-bar-shooting",
      "summary": "&lt;p&gt;Shooting occurred early Sunday at Willie’s Bar and Grill on idyllic St Helena island &lt;/p&gt;&lt;p&gt;A mass shooting at a crowded bar on an idyllic South Carolina island has left four people dead and at least 20 injured, officials say.&lt;/p&gt;&lt;p&gt;The shooting occurred early Sunday at Willie’s Bar and Grill on St Helena island, officials said. A large crowd was at the scene when sheriff’s deputies arrived and found several people suffering from gunshot wounds.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/12/south-carolina-bar-shooting\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}