{
  "updatedAt": "2025-09-17T13:34:04.063Z",
  "items": [
    {
      "title": "Nonpartisan Groups Struggle to Stay Neutral in California’s Redistricting Fight",
      "url": "https://www.nytimes.com/2025/09/17/us/political-neutrality-redistricting-california.html",
      "summary": "Two nonprofits prided themselves on being neutral voices. Then they found that there seemed to be no middle ground in the nation’s redistricting war."
    },
    {
      "title": "100 Liberal Philanthropies Prepare to Push Back Against Trump Crackdown",
      "url": "https://www.nytimes.com/2025/09/17/us/politics/trump-liberal-philanthropies-pushback.html",
      "summary": "The institutions published an open letter to defend their missions amid fears the Trump administration could target their tax-exempt status."
    },
    {
      "title": "Is the Economy as Healthy as Trump Claims?",
      "url": "https://www.nytimes.com/2025/09/17/us/the-morning-economy-trump-gaza-redford.html",
      "summary": "As the Fed meets, we examine the nation’s economic health."
    },
    {
      "title": "Driver Crashes Car Into F.B.I. Field Office Gate in Pittsburgh",
      "url": "https://www.nytimes.com/2025/09/17/us/fbi-pittsburgh-car-crash.html",
      "summary": "A driver rammed into the entrance of the compound and fled on foot in what officials believed to be a targeted act. Officials named a suspect."
    },
    {
      "title": "Trump’s Visit to Britain Includes Billions in New Tech Deals",
      "url": "https://www.nytimes.com/2025/09/17/us/politics/trumps-visit-to-britain-includes-billions-in-new-tech-deals.html",
      "summary": "Microsoft, Google and Nvidia are among the American tech companies that have pledged to expand in Britain."
    },
    {
      "title": "A Note, a Gun and a Mother’s Conscience Led to an Arrest in Kirk’s Killing",
      "url": "https://www.nytimes.com/2025/09/17/us/politics/charlie-kirk-killer.html",
      "summary": "The man accused of shooting Charlie Kirk left a trail of evidence and had no way to outrun his parents’ recognition, court documents showed."
    },
    {
      "title": "Fired health official to testify to Senate committee about chaos in RFK Jr’s department – live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Susan Monarez was director of the Centers for Disease Control before she was fired in August&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Donald Trump has claimed his administration has reached a deal with China to keep TikTok operating in the US, amid uncertainty over what shape the final agreement will take, with suggestions from the Chinese side that Beijing would retain control of the algorithm that powers the site’s video feed.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;“We have a deal on &lt;a href=\"https://www.theguardian.com/technology/tiktok\"&gt;TikTok&lt;/a&gt; ... We have a group of very big companies that want to buy it,” Trump said on Tuesday, without providing further details.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Members of Congress condemn Kristi Noem over fate of migrant ‘Dreamers’",
      "url": "https://www.theguardian.com/us-news/2025/sep/17/congress-letter-dreamers-daca",
      "summary": "&lt;p&gt;Letter signed by 95 demands to know how many people protected under Daca have been arrested or deported&lt;/p&gt;&lt;p&gt;A group of 95 members of Congress have written a letter to Kristi Noem, the homeland security secretary, condemning the arrest of protected &lt;a href=\"https://www.theguardian.com/us-news/usimmigration\"&gt;immigrants&lt;/a&gt; known as Dreamers and demanding to know how many have been detained and deported in recent months.&lt;/p&gt;&lt;p&gt;In a letter shared with the Guardian and submitted to Noem on Wednesday morning, Democratic representatives denounced the recent rise in the wrongful detention and deportation of immigrants residing in the US under the Deferred Action for Childhood Arrivals (&lt;a href=\"https://www.theguardian.com/us-news/2020/jun/18/daca-dreamers-us-immigration-explainer\"&gt;Daca&lt;/a&gt;) program.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/17/congress-letter-dreamers-daca\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}