{
  "updatedAt": "2025-11-25T18:40:20.921Z",
  "items": [
    {
      "title": "Republicans Fight With Trump’s Team Over Ukraine Talks",
      "url": "https://www.nytimes.com/2025/11/25/us/politics/republicans-trump-ukraine.html",
      "summary": "Senator Mitch McConnell and several other lawmakers accused President Trump’s team of appeasing the Kremlin, warning that doing so would not lead to lasting peace."
    },
    {
      "title": "Vahid Abedini, University of Oklahoma Professor, Released After ICE Detainment",
      "url": "https://www.nytimes.com/2025/11/25/us/vahid-abedini-oklahoma-professor-ice.html",
      "summary": "Vahid Abedini, who colleagues said was in the United States on an H-1B visa, was arrested on his way to a conference in Washington. It was unclear why."
    },
    {
      "title": "Justice Dept. Whistleblower Joins Legal Group Battling the Trump Administration",
      "url": "https://www.nytimes.com/2025/11/25/us/politics/erez-reuveni-democracy-forward.html",
      "summary": "Erez Reuveni, a lawyer who once defended the president’s immigration policies in court, will now work for an advocacy group that sues to stop them."
    },
    {
      "title": "Drug Arrests and Gun Seizures Fell as Homeland Security Pursued Immigration",
      "url": "https://www.nytimes.com/2025/11/25/us/politics/drug-arrests-gun-seizures-homeland-security-immigration.html",
      "summary": "Internal documents reveal the impact on crime fighting as the Trump administration diverts special agents to its mass deportation agenda."
    },
    {
      "title": "Trump Administration Is Taking Billions in Stakes in Firms Like Intel",
      "url": "https://www.nytimes.com/2025/11/25/us/politics/trump-intel-steel-minerals-china.html",
      "summary": "The Trump administration is trading billions of dollars of taxpayer money for ownership stakes in companies. The unusual practice shows no sign of slowing."
    },
    {
      "title": "Prosecutor Used Flawed A.I. to Keep a Man in Jail, His Lawyers Say",
      "url": "https://www.nytimes.com/2025/11/25/us/prosecutor-artificial-intelligence-errors-lawyers-california.html",
      "summary": "The case is among the first in which a prosecutor is accused of filing court papers marred by A.I.-generated mistakes."
    },
    {
      "title": "US attorney general vows to appeal dismissal of criminal cases against James Comey and Letitia James – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/25/us-politics-pam-bondi-appeal-james-comey-letitia-james-cases-donald-trump-venezuela-latest-updates",
      "summary": "&lt;p&gt;Pentagon said it was investigating Arizona senator Mark Kelly for violating military law by appearing in video in which lawmakers told military members to ‘refuse illegal orders’&lt;/p&gt;&lt;p&gt;Senator &lt;strong&gt;Mark Kelly&lt;/strong&gt; has responded to the Pentagon’s announcement that it is investigating the Arizona lawmaker for possible breaches of military law after he joined five other Democratic members of Congress in a video calling for US troops to refuse illegal orders.&lt;/p&gt;&lt;p&gt;“I said something that was pretty simple and non controversial, and that was that members of the military should follow the law,” Kelly said in an MS NOW interview with Rachel on Monday. “And in response to that, Donald Trump said I should be executed.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/25/us-politics-pam-bondi-appeal-james-comey-letitia-james-cases-donald-trump-venezuela-latest-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Mark Kelly: call for troops to disobey illegal orders is ‘non-controversial’",
      "url": "https://www.theguardian.com/us-news/2025/nov/25/mark-kelly-troops-disobey-illegal-orders-comments",
      "summary": "&lt;p&gt;Senator hits back at Trump administration after Pentagon launches investigation for possible breaches of military law&lt;/p&gt;&lt;p&gt;US senator Mark Kelly said it was “non-controversial” for him and other Democrats to implore military personnel to disobey “illegal orders” from the Trump administration – hitting back at &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/24/pentagon-investigation-mark-kelly-arizona\"&gt;accusations&lt;/a&gt; of “serious allegations of misconduct” leveled against him by the Pentagon.&lt;/p&gt;&lt;p&gt;“I said something that was pretty simple and non-controversial – and that was that members of the military should follow the law,” the Arizona Democrat senator, a former US Navy officer and astronaut who flew on four separate space shuttle missions between 2001 and 2011, &lt;a href=\"https://www.youtube.com/watch?v=6A3kC2h2Bu8\"&gt;told&lt;/a&gt; MS Now on Monday night.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/25/mark-kelly-troops-disobey-illegal-orders-comments\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}