{
  "updatedAt": "2025-12-03T18:42:29.039Z",
  "items": [
    {
      "title": "Trump Plans to Pardon Henry Cuellar, Texas Democrat Indicted on Bribery Charges",
      "url": "https://www.nytimes.com/2025/12/03/us/politics/trump-pardons-henry-cuellar-texas-democrat.html",
      "summary": "The president used the latest pardon announcement to attack his predecessor, Joseph R. Biden Jr."
    },
    {
      "title": "Epstein Files Reveal Private Home Photos in Latest Release by Democrats",
      "url": "https://www.nytimes.com/2025/12/03/us/politics/epstein-island-home.html",
      "summary": "In publicizing the photos and videos, Democrats in Congress appeared to be intensifying pressure on the Justice Department to release its files on the Epstein case."
    },
    {
      "title": "How Is America Changing Under President Trump? We Want to Hear From You.",
      "url": "https://www.nytimes.com/2025/12/03/us/trump-policy-changes.html",
      "summary": "A New York Times reporter wants to hear from you about changes you are seeing in your community since Mr. Trump took office."
    },
    {
      "title": "A Progressive Democrat Makes a Long-Shot Senate Bid in Red Kentucky",
      "url": "https://www.nytimes.com/2025/12/03/us/politics/charles-booker-senate-kentucky.html",
      "summary": "Charles Booker is running again for the chamber as Democrats take chances even in heavily Republican states like Kentucky, where Senator Mitch McConnell is retiring."
    },
    {
      "title": "Trump Administration Begins Immigration Operation in New Orleans",
      "url": "https://www.nytimes.com/2025/12/03/us/border-patrol-new-orleans-immigration.html",
      "summary": "It is unclear how long the effort will last in Louisiana, where the Republican governor has welcomed the agents with open arms even as immigrant communities fear what might come."
    },
    {
      "title": "Hegseth Invoked the ‘Fog of War’ in a Boat Strike. What Does That Mean?",
      "url": "https://www.nytimes.com/2025/12/03/us/fog-of-war-hegseth-boat-strike.html",
      "summary": "Defense Secretary Pete Hegseth used the term, which alludes to uncertainty in battle, in reference to a deadly U.S. military attack in the Caribbean."
    },
    {
      "title": "Democrats decry ‘harrowing’ photos of Epstein’s private island home and demand end to Trump’s ‘cover-up’ – live",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/03/donald-trump-somali-immigrants-ice-minnesota-pete-hegseth-caribbean-boats-venezuela-us-politics-live-latest-news-updates",
      "summary": "&lt;p&gt;New media release shows Epstein’s home, including several rooms, a telephone, and a chalk board with the words ‘intellectual,’ ‘deception’ and ‘power’&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/dec/03/epstein-caribbean-island-new-photo-video-release\"&gt;House Democrats release new images of Epstein’s private Caribbean island&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The Department of Homeland Security (DHS) announced it had &lt;strong&gt;started its immigration enforcement operation in New Orleans today&lt;/strong&gt;.&lt;/p&gt;&lt;p&gt;In a statement, the department said &lt;strong&gt;Operation Catahoula Crunch&lt;/strong&gt; would target “criminal illegal aliens roaming free thanks to sanctuary policies”. New Orleans is the latest Democratic-run city (albeit in a Republican-led state) to see federal immigration agents on its streets. Most recently, the Trump administration targeted Charlotte, North Carolina, and touted the arrest of more than 300 undocumented immigrants.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/03/donald-trump-somali-immigrants-ice-minnesota-pete-hegseth-caribbean-boats-venezuela-us-politics-live-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "House Democrats release new images of Epstein’s private Caribbean island",
      "url": "https://www.theguardian.com/us-news/2025/dec/03/epstein-caribbean-island-new-photo-video-release",
      "summary": "&lt;p&gt;Images and videos taken in 2020, a year after he died in jail, show the late sex offender’s home&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/03/donald-trump-somali-immigrants-ice-minnesota-pete-hegseth-caribbean-boats-venezuela-us-politics-live-latest-news-updates\"&gt;US politics – live updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;House Democrats released &lt;a href=\"https://www.dropbox.com/scl/fo/e7n5g4wz0cjngv9u9qys2/AHNOf8vcSNtejTpIcQGaICs?dl=0&amp;amp;e=1&amp;amp;preview=IMG_9221_Redacted.pdf&amp;amp;rlkey=c8fds6c4a8t6zwoiglx4c7kt3&amp;amp;st=16dpmuw0\"&gt;a handful of photos and videos&lt;/a&gt; from Jeffrey Epstein’s private Caribbean island on Wednesday, offering a rare glimpse into a secretive place where Epstein is alleged to have trafficked young girls.&lt;/p&gt;&lt;p&gt;The new images and videos show Epstein’s home, including bedrooms, a telephone, what appears to be an office or library, and a chalkboard on which the words “fin”, “intellectual”, “deception” and “power” are written. One photo shows a room with a dentist chair and masks hanging on the wall. The New York Times &lt;a href=\"https://www.nytimes.com/2019/08/28/business/jeffrey-epstein-island.html\"&gt;reported&lt;/a&gt; that Epstein’s last girlfriend was a dentist who shared an office with one of his shell companies. The videos appear to be a walk-through of the property.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/03/epstein-caribbean-island-new-photo-video-release\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}