{
  "updatedAt": "2025-10-17T18:33:41.693Z",
  "items": [
    {
      "title": "U.S. Detains 2 Survivors of Latest Military Strike in Caribbean",
      "url": "https://www.nytimes.com/2025/10/17/us/politics/us-military-strike-survivors.html",
      "summary": "The capture of prisoners presents a major new set of legal and policy problems for the Trump administration in its escalating campaign."
    },
    {
      "title": "Bessent Stakes Credibility and Taxpayer Money on Argentina Bet",
      "url": "https://www.nytimes.com/2025/10/17/us/politics/trump-argentina-bailout-bessent.html",
      "summary": "Treasury Secretary Scott Bessent’s multibillion-dollar bailout of a serial defaulter raises the specter of losses for the United States."
    },
    {
      "title": "Massachusetts School Employee Dies After Trying to Restrain Student",
      "url": "https://www.nytimes.com/2025/10/17/us/massachusetts-school-staff-dies-student-kick.html",
      "summary": "The student, 14, has been charged with assault."
    },
    {
      "title": "Some Chicago Businesses Feeling the Impact of Trump’s Immigration Blitz",
      "url": "https://www.nytimes.com/2025/10/17/us/chicago-economy-business-immigration-crackdown.html",
      "summary": "More customers and workers are staying home, they say, leading to lower revenue and worries of wider economic repercussions for the city."
    },
    {
      "title": "John Bolton Pleads Not Guilty to Charges of Mishandling Classified Documents",
      "url": "https://www.nytimes.com/2025/10/17/us/politics/bolton-pleads-not-guilty.html",
      "summary": "Mr. Bolton appeared in federal court in Greenbelt, Md., a day after he was indicted by a grand jury."
    },
    {
      "title": "Trump Pushes Indiana Lawmakers to Redraw State Maps",
      "url": "https://www.nytimes.com/2025/10/17/us/politics/trump-indiana-senate-state-maps.html",
      "summary": "A call Friday morning by the president to Republican state senators is part of an escalating pressure campaign by the White House."
    },
    {
      "title": "Donald Trump claims ‘we’re getting along with China’ amid escalating trade war – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates",
      "summary": "&lt;p&gt;US president also says he is likely to meet China’s president Xi Jinping in South Korea&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The &lt;a href=\"https://www.theguardian.com/us-news/us-senate\"&gt;US Senate&lt;/a&gt; failed on Thursday to re-open the government and to vote to fund the military during the federal government shutdown, ensuring that the standoff will stretch into next week.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The Senate vote on a short-term &lt;a href=\"https://www.theguardian.com/us-news/republicans\"&gt;Republican&lt;/a&gt; funding bill failed for the 10th time with just 51 votes. A second vote on Pentagon funding in the afternoon similarly failed in a floor vote, meaning the process to begin fully funding military operations also becomes a non-starter. After the votes, senators are expected to leave Washington for the weekend, almost guaranteeing the shutdown lasts until at least Monday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "No Kings: what to know about the anti-Trump protests attracting millions",
      "url": "https://www.theguardian.com/us-news/2025/oct/17/no-kings-protests-millions-trump",
      "summary": "&lt;p&gt;More than 2,500 US rallies are planned in all 50 states as protesters call for limits on presidential power&lt;/p&gt;&lt;p&gt;Millions are expected to show out for protests on Saturday at more than 2,500 locations across America, from small towns to large cities, to speak against the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;No Kings, the coalition behind a mass demonstration in June, is again calling people to the streets to send the simple message that &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; is not a king, pushing back against what they see as increasing authoritarianism.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/17/no-kings-protests-millions-trump\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}