{
  "updatedAt": "2025-10-14T12:56:19.596Z",
  "items": [
    {
      "title": "Trump to Award Posthumous Medal of Freedom to Charlie Kirk",
      "url": "https://www.nytimes.com/2025/10/14/us/politics/charlie-kirk-medal-of-freedom-trump-birthday.html",
      "summary": "President Trump was scheduled to attend a ceremony at the White House on Tuesday to honor the influential right-wing activist, who was assassinated last month."
    },
    {
      "title": "Meet Zohran Mamdani, the Favorite to Lead New York City",
      "url": "https://www.nytimes.com/2025/10/14/us/meet-zohran-mamdani-the-favorite-to-lead-new-york-city.html",
      "summary": "Our reporters explore his skyrocket, his life and his appeal."
    },
    {
      "title": "Gov. Janet Mills of Maine to Run for Senate, Aiming at Senator Susan Collins",
      "url": "https://www.nytimes.com/2025/10/14/us/politics/janet-mills-senate-race-maine-susan-collins.html",
      "summary": "A two-term Democratic governor, Ms. Mills called herself “battle tested” in an interview. But she faces a Democratic primary before she can challenge the Republican incumbent."
    },
    {
      "title": "Trump to Meet With Argentina’s Leader as U.S. Moves Ahead With Bailout",
      "url": "https://www.nytimes.com/2025/10/14/us/politics/trump-argentina-leader-bailout.html",
      "summary": "President Javier Milei will visit the White House on Tuesday after the Trump administration agreed to provide Argentina a $20 billion lifeline."
    },
    {
      "title": "Where Jews and Arab Americans Live Side by Side, Renewed Hope",
      "url": "https://www.nytimes.com/2025/10/14/us/ceasefire-gaza-israel.html",
      "summary": "Detroit has one of the largest Arab American populations and a vibrant Jewish community. Both groups feel some relief, and lingering doubt."
    },
    {
      "title": "Will the Supreme Court Use a Louisiana Case to Gut the Voting Rights Act?",
      "url": "https://www.nytimes.com/2025/10/14/us/politics/supreme-court-voting-rights-act.html",
      "summary": "The justices have shown a willingness to chip away at the landmark civil rights legislation. A Louisiana case could unravel much of its remaining power."
    },
    {
      "title": "‘Instability and confusion’ as CDC slashes 1,300 jobs before reinstating half",
      "url": "https://www.theguardian.com/us-news/2025/oct/14/cdc-job-cuts-partial-reversal",
      "summary": "&lt;p&gt;Entire offices erased at health agency in Friday move before Trump administration says 700 notices were sent in error&lt;/p&gt;&lt;p&gt;More than a thousand employees at the US Centers for Disease Control and Prevention (CDC) received notice that they were losing their jobs on Friday in a move that erased entire offices and was &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/13/firings-cdc-employees-reversed\"&gt;partially reversed&lt;/a&gt; over the weekend.&lt;/p&gt;&lt;p&gt;It caused “instability and whiplash”, said &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/04/cdc-rfk-jr-infectious-disease-testimony\"&gt;Debra Houry&lt;/a&gt;, former chief medical officer at the CDC.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/14/cdc-job-cuts-partial-reversal\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Letitia James warns of ‘powerful voices trying to silence the truth’ – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
      "summary": "&lt;p&gt;New York attorney general strikes a defiant tone during Mamdani rally in first appearance since her indictment&lt;/p&gt;&lt;p&gt;&lt;strong&gt;China has hit back at accusations from the US that it is trying to hurt the world economy, as the trade war between the world’s two biggest economies &lt;a href=\"https://www.theguardian.com/world/2025/oct/13/why-us-china-trade-war-restarted-tariffs\"&gt;appeared to re-escalate&lt;/a&gt;, amped up by aggressive rhetoric on both sides.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;China’s commerce ministry said on Tuesday that the US was “threatening to intimidate” with the prospect of new tariffs on Chinese exports, “which is not the right way to get along with China”. Its spokesperson said that &lt;a href=\"https://www.theguardian.com/world/china\"&gt;China&lt;/a&gt; would “fight to the end” in trade talks.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}