{
  "updatedAt": "2025-09-05T18:45:39.476Z",
  "items": [
    {
      "title": "Joseph McNeil, Young Spark in a Civil Rights Battle, Dies at 83",
      "url": "https://www.nytimes.com/2025/09/05/us/joseph-mcneil-dead.html",
      "summary": "He and his classmates from a historically Black college in Greensboro, N.C., desegregated a Woolworth’s lunch counter in 1960, inspiring similar protests across the nation."
    },
    {
      "title": "What We Know About Trump’s Crime and Immigration Crackdown Across the U.S.",
      "url": "https://www.nytimes.com/article/trump-national-guard-military-cities.html",
      "summary": "The president has sent soldiers and federal agents to some cities, and promised to do the same in others, prompting lawsuits and stirring outrage among local leaders."
    },
    {
      "title": "Trump Administration Threatens Abrego Garcia With Deportation to El Salvador",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/trump-deportations-abrego-garcia-el-salvador.html",
      "summary": "A court had ruled that Kilmar Armando Abrego Garcia could not be sent back to his homeland, but now the administration sees a legal loophole."
    },
    {
      "title": "BART Trains Shut Down for the Morning Commute in the Bay Area",
      "url": "https://www.nytimes.com/2025/09/05/us/bart-transit-outage-bay-area.html",
      "summary": "Bay Area Rapid Transit suffered a systemwide outage for the second time in four months because of a computer problem."
    },
    {
      "title": "The Return of the ‘War Department’ Is a Message From Trump",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/trump-war-department-defense-history.html",
      "summary": "President Trump and his defense secretary say they want to return to the era when America won wars. They largely ignore the greatest accomplishment of the past 80 years: avoiding superpower conflict."
    },
    {
      "title": "South Koreans Swept Up in Immigration Raid at Hyundai E.V. Plant in Georgia",
      "url": "https://www.nytimes.com/2025/09/05/us/georgia-battery-plant-hyundai-lg-ice-raid.html",
      "summary": "They were among nearly 500 workers apprehended at a construction site for a South Korean battery maker, officials said. The episode prompted diplomatic concern in Seoul."
    },
    {
      "title": "Most of 475 people arrested by US immigration agents at Georgia Hyundai facility are Korean nationals – live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Ice’s investigative arm executed the warrant as part of an ongoing criminal investigation, homeland security spokesperson tells Reuters&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/05/immigration-ice-raid-hyundai-georgia\"&gt;Hundreds of workers detained in major Ice raid at US Hyundai factory&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Tensions between Michelle Wu, the mayor of Boston, and the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; have been escalating in recent months over the administration’s aggressive immigration policies, with reports now signaling the possibility of a federal immigration enforcement surge in the city.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The friction came to a head last week when the Trump administration reportedly began preparing an “immigration enforcement blitz” for Boston in the coming weeks, according to &lt;a href=\"https://www.politico.com/news/2025/08/29/trump-admin-plans-immigration-enforcement-surge-in-boston-00536276\"&gt;Politico&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "At least 475 workers detained in major Ice raid at US Hyundai factory",
      "url": "https://www.theguardian.com/us-news/2025/sep/05/immigration-ice-raid-hyundai-georgia",
      "summary": "&lt;p&gt;South Korea concerned after hundreds were arrested at Georgia work site making batteries for Hyundai and Kia cars&lt;/p&gt;&lt;p&gt;Hundreds of workers at a factory being built in &lt;a href=\"https://www.theguardian.com/us-news/state-of-georgia\"&gt;Georgia&lt;/a&gt; to make car batteries for Hyundai and Kia electric vehicles were detained in a huge raid by Immigration and Customs Enforcement (&lt;a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\"&gt;Ice&lt;/a&gt;) on Thursday that stopped construction.&lt;/p&gt;&lt;p&gt;The facility is part of what would be the biggest industrial investment in the state’s history and had been hailed as a huge boost for the economy by Georgia’s Republican governor, Brian Kemp.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/05/immigration-ice-raid-hyundai-georgia\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}