{
  "updatedAt": "2025-10-10T12:52:59.718Z",
  "items": [
    {
      "title": "Letitia James Is Among Prominent Black Women Targeted by Trump",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/letitia-james-black-women-trump-targets.html",
      "summary": "Fani T. Willis, a district attorney who brought election interference charges against Mr. Trump, and Lisa Cook, who serves on the Federal Reserve Board, have also been investigated."
    },
    {
      "title": "How Letitia James, Now Indicted, Will Stay as New York’s Attorney General",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/letitia-james-new-york-attorney-general-indicted.html",
      "summary": "New York state’s chief legal officer, now a criminal defendant, runs an 800-lawyer agency that is at the center of state government."
    },
    {
      "title": "What Courts Have Said in Challenges to Trump’s National Guard Deployments",
      "url": "https://www.nytimes.com/2025/10/10/us/federal-courts-national-guard-trump.html",
      "summary": "Federal courts across the country have heard legal challenges to the mobilization of troops in Los Angeles, Washington, Portland, Ore., and Chicago. Here’s how some judges have ruled."
    },
    {
      "title": "How Right-Wing Influencers Are Shaping the Guard Fight in Portland",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/right-wing-influencers-portland.html",
      "summary": "President Trump and his administration are amplifying the voices of pro-White House podcasters and streamers eager to ratify the president’s description of Oregon’s largest city as a “hellscape.”"
    },
    {
      "title": "Senate Passes Bipartisan $925 Billion Defense Policy Bill",
      "url": "https://www.nytimes.com/2025/10/09/us/senate-passes-bipartisan-925-billion-defense-policy-bill.html",
      "summary": "The legislation would provide a 3.8 percent pay raise for American troops, while funding weapons and overhauling military procurement."
    },
    {
      "title": "Judge Rejects ‘Unprecedented’ Indictment Amid Trump’s D.C. Clampdown",
      "url": "https://www.nytimes.com/2025/10/09/us/politics/judge-rejects-indictment-dc.html",
      "summary": "The federal magistrate judge, Zia M. Faruqui, accused prosecutors of relying on a “facially invalid” indictment to charge a man with felony gun possession."
    },
    {
      "title": "Letitia James accuses Donald Trump of ‘weaponizing’ US justice system after her indictment – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Prosecutor who led civil fraud investigation against Trump in 2023 says charges against her are baseless&lt;/p&gt;&lt;p&gt;&lt;strong&gt;We’ll hear from Donald Trump at 10am E&lt;/strong&gt;&lt;strong&gt;T today, when he heads to Walter Reed &lt;/strong&gt;&lt;strong&gt;medical &lt;/strong&gt;&lt;strong&gt;center for his “semi-annual” physical exam.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;We’ll be keeping an ear out for any reaction he has to the indictment of &lt;strong&gt;Letitia James&lt;/strong&gt;, his longtime political adversary.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "First Thing: Hamas and Israel implement ceasefire",
      "url": "https://www.theguardian.com/us-news/2025/oct/10/first-thing-hamas-and-israel-implement-ceasefire",
      "summary": "&lt;p&gt;Israeli troops begin pulling back from parts of Gaza. Plus, stories from survivors who were trapped on Everest&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"&gt;&lt;strong&gt;Don’t already get First Thing in your inbox? Sign up here&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;Thousands of displaced Palestinians headed back towards their abandoned homes on Friday after a ceasefire between Israel and Hamas came into effect and Israeli troops began pulling back from parts of Gaza.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;How was the ceasefire deal done? &lt;/strong&gt;The turning point was a meeting in New York on the sidelines of the UN general assembly chaired by Donald Trump, soon after his baroque speech to the gathering. Trump described the sidelines conversation as his most important meeting at the UN."
    }
  ]
}