{
  "updatedAt": "2025-10-03T12:51:14.190Z",
  "items": [
    {
      "title": "Here’s the latest.",
      "url": "https://www.nytimes.com/live/2025/10/03/us/trump-news-government-shutdown/heres-the-latest",
      "summary": ""
    },
    {
      "title": "As Political Violence Rises, Justice Kavanaugh’s Would-Be Assassin to Be Sentenced",
      "url": "https://www.nytimes.com/2025/10/03/us/supreme-court-assassination-attempt-sentencing.html",
      "summary": "Prosecutors have asked a judge for at least 30 years in prison for Sophie Roske, who traveled from California to Maryland intending to kill Justice Brett Kavanaugh."
    },
    {
      "title": "Duke Was Paring Back Diversity Programs. Trump Targeted It Anyway.",
      "url": "https://www.nytimes.com/2025/10/03/us/duke-university-dei-diversity-trump.html",
      "summary": "Duke University kept a low profile. But it is the alma mater of Stephen Miller, a top Trump official who often criticized the school while he was a student."
    },
    {
      "title": "23-Year-Old Climber Dies in Fall from Yosemite’s El Capitan",
      "url": "https://www.nytimes.com/2025/10/03/us/climber-dies-yosemite-el-capitan.html",
      "summary": "The death of Balin Miller, 23, shocked his family and onlookers who were watching his ascent of the famed rock face."
    },
    {
      "title": "Large Fire Burns at Chevron Refinery in El Segundo After Explosion",
      "url": "https://www.nytimes.com/2025/10/03/us/el-segundo-refinery-fire-chevron.html",
      "summary": "It was not immediately clear what caused the blast, which residents said felt like an earthquake. The fire was still burning more than two hours after it started."
    },
    {
      "title": "Apple Takes Down ICE Tracking Apps Amid Trump Pressure Campaign",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/apple-iceblock-app-store-trump.html",
      "summary": "Trump administration officials have issued several legal threats over ICEBlock, a popular app that allows users to alert others to the presence of nearby immigration agents."
    },
    {
      "title": "Fire still burning at California Chevron refinery following explosion",
      "url": "https://www.theguardian.com/us-news/2025/oct/03/large-fire-breaks-out-at-el-segundo-refinery-in-los-angeles",
      "summary": "&lt;p&gt;No injuries reported in El Segundo, site of company’s second-biggest US refinery, which supplies jet fuel for LA airport&lt;/p&gt;&lt;p&gt;A fire that broke out at &lt;a href=\"https://www.theguardian.com/business/chevron\"&gt;Chevron’s&lt;/a&gt; El Segundo refinery that supplies jet fuel for Los Angeles International Airport (LAX) was still burning on Friday morning after an explosion at the plant.&lt;/p&gt;&lt;p&gt;The press office of Gavin Newsom, the California governor, had confirmed that the fire erupted on Thursday night on the outskirts of the city, with a county official adding that the flames had been confined to one area.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/03/large-fire-breaks-out-at-el-segundo-refinery-in-los-angeles\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Sean ‘Diddy’ Combs to be sentenced after conviction on federal prostitution-related charges – live updates",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
      "summary": "&lt;p&gt;Music mogul could face lengthy prison sentence after being convicted of some charges in July; court proceedings to begin at 10am eastern time&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/music/2025/oct/03/sean-diddy-combs-sentencing\"&gt;Sean ‘Diddy’ Combs sentencing: what to know&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;A former girlfriend, R&amp;amp;B singer Casandra “Cassie” Ventura, testified during the trial that Combs ordered her to have “disgusting” sex with strangers hundreds of times during their decade-long relationship.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The jury was repeatedly shown video clips of Combs dragging and beating Cassie in a Los Angeles hotel hallway after one of those multiday sexual marathons, which she referred to as “freak-offs” during her four days of testimony.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}