{
  "updatedAt": "2025-11-30T12:52:08.081Z",
  "items": [
    {
      "title": "The Political Price Shock of Data Centers and Electric Bills",
      "url": "https://www.nytimes.com/2025/11/30/us/politics/the-new-price-of-eggs-the-political-shocks-of-data-centers-and-electric-bills.html",
      "summary": "Democrats zeroed in on utilities and affordability to win Republican support in upset elections in Georgia and Virginia. Can the same playbook work in 2026?"
    },
    {
      "title": "Remembering WW2 Camps, Japanese Americans Fight Trump’s Immigration Crackdown",
      "url": "https://www.nytimes.com/2025/11/30/us/japanese-internment-camp-trump-immigration.html",
      "summary": "Japanese Americans are seeing parallels between the government’s incarceration of their families during World War II and the current detention of Latinos."
    },
    {
      "title": "4 Dead After Shooting at Banquet Hall in California",
      "url": "https://www.nytimes.com/2025/11/29/us/shooting-stockton-california.html",
      "summary": "The shooting in Stockton, a city in California’s Central Valley, left 10 others wounded. The authorities said they were looking for a suspect."
    },
    {
      "title": "Trump Frees Fraudster Just Days Into Seven-Year Prison Sentence",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/trump-david-gentile-commutation.html",
      "summary": "David Gentile had been found guilty for his role in what prosecutors described as a $1.6 billion scheme that defrauded thousands of investors."
    },
    {
      "title": "Webster Springs, W.Va. United In Grief Over Death of National Guard Specialist Sarah Beckstrom",
      "url": "https://www.nytimes.com/2025/11/29/us/national-guard-shooting-beckstrom-webster-springs.html",
      "summary": "In Webster Springs, everyone knows one another. When National Guard Specialist Sarah Beckstrom was killed, that connection was even further strengthened."
    },
    {
      "title": "Top Trump Aides to Meet With Ukrainians in Florida on Sunday",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/trump-aides-ukraine-florida-meeting.html",
      "summary": "Secretary of State Marco Rubio, Steve Witkoff and Jared Kushner plan to discuss peace terms again after an uproar over a 28-point proposal drafted with Russian input."
    },
    {
      "title": "‘We have become so divided’: Georgia district prepares for life after Marjorie Taylor Greene",
      "url": "https://www.theguardian.com/us-news/2025/nov/30/marjorie-taylor-greene-house-seat-georgia",
      "summary": "&lt;p&gt;Republicans and Democrats alike look to fill congressional firebrand’s House seat when she departs in 2026&lt;/p&gt;&lt;p&gt;Marjorie Taylor Greene for president. Randy Bone rolled the idea around in his hands for a second as he stood inside his wife’s antique shop in Ringgold, Georgia. He’s heard the talk. He’s even seen the prediction market action. He doesn’t have a problem with his boisterous, attention-seeking congresswoman."
    },
    {
      "title": "Power surge: law changes could soon bring balcony solar to millions across US",
      "url": "https://www.theguardian.com/us-news/2025/nov/30/balcony-solar-power-states-laws",
      "summary": "&lt;p&gt;Tweaks to state laws mean many Americans will be able to benefit from small, simple plug-in solar panels&lt;/p&gt;&lt;p&gt;Acquiring solar panels at home can be an expensive hassle for people in the US. But small, simple, plug-in solar panels for use on balconies are soon to become available for millions of Americans, with advocates hoping the technology will quickly go mainstream.&lt;/p&gt;&lt;p&gt;Earlier this year, Utah became the first state in the country to pass legislation allowing people to purchase and install small, portable solar panels that plug into a standard wall socket.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/30/balcony-solar-power-states-laws\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}