{
  "updatedAt": "2025-09-10T06:50:10.264Z",
  "items": [
    {
      "title": "Protesters Call Out Trump as He Dines Out in Washington",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/trump-dc-joes-seafood-protesters.html",
      "summary": "Mr. Trump made the short trek from the White House to Joe’s Seafood, Prime Steak &amp; Stone Crab to show that his federal crackdown on crime in the nation’s capital was working."
    },
    {
      "title": "With Qatar Attack, Israel Again Leaves Trump in the Dark",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/israel-trump-gaza-qatar-bombing.html",
      "summary": "President Trump said he was “very unhappy about the way that went down.”"
    },
    {
      "title": "Fears Return for L.A. Immigrants After Supreme Court Allows Raids to Resume",
      "url": "https://www.nytimes.com/2025/09/09/us/los-angeles-immigrant-reaction.html",
      "summary": "Los Angeles residents are anxious once again following a Supreme Court ruling that allowed aggressive immigration raids to resume."
    },
    {
      "title": "James Walkinshaw, Democrat of Virginia, Wins House Special Election",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/james-walkinshaw-virginia-house.html",
      "summary": "James Walkinshaw will fill a seat left open by the death of his former boss, Gerald Connolly, and shrink the Republicans’ majority in the chamber."
    },
    {
      "title": "Latest Revelations Complicate Trump’s Sweeping Denials About Epstein",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/trumps-epstein-response.html",
      "summary": "President Trump often succeeds in pivoting the national conversation, but he is finding that more difficult when it comes to Jeffrey Epstein."
    },
    {
      "title": "Man Pleads Guilty to Planning Attack on Power Substation in Tennessee",
      "url": "https://www.nytimes.com/2025/09/09/us/tennessee-energy-facility-destroy-guilty.html",
      "summary": "Skyler Philippi, 24, planned to use a drone packed with explosive materials to further an extremist ideology, prosecutors said."
    },
    {
      "title": "White House denies that Trump wrote Epstein letter and calls investigation a Democrat ‘hoax’ – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news",
      "summary": "&lt;p&gt;White House press secretary denies that president wrote Epstein a card that included the outline of a woman’s body for the sex trafficker’s 50th birthday. This blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/09/trump-epstein-photo-check-woman\"&gt;Photo of novelty check suggests Epstein ‘sold’ Trump a woman&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/09/trump-response-epstein-files\"&gt;The president doth protest too much: Trump’s denial on Epstein is backfiring&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;My colleague, &lt;strong&gt;Oliver Holmes&lt;/strong&gt;, has been &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/09/epstein-50th-birthday-book-who-is-in-it-and-what-did-they-say-donald-trump-bill-clinton-peter-mandelson\"&gt;going through the Jeffrey Epstein 50th birthday album&lt;/a&gt; that House Democrats on the oversight committee released on Monday, after they subpoenaed Epstein’s estate.&lt;/p&gt;&lt;p&gt;As Oliver notes, much of the book seems to be a collection of flattering and celebratory letters – often highly sexualised – from people who knew Epstein. They include photos of him embracing women in bikinis whose faces were redacted, and others showing scenes featuring wild animals having sex.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Bill Clinton&lt;/strong&gt;, who had left the US presidency a couple years before the publication of the book, is listed in the “friends” section.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Peter Mandelson&lt;/strong&gt;, the current UK ambassador to the United States, called Epstein his “best pal”. There are also photographs in the book which show Mandelson in shorts gazing from a balcony and in a white dressing gown laughing with Epstein.&lt;/p&gt;&lt;p&gt;One of the most striking images in the collection is a drawing of Epstein handing young girls balloons and a lollipop in 1983, alongside another drawing of him 20 years later, receiving a massage from topless women in 2003.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: White House would back forensic analysis of signature on Epstein letter",
      "url": "https://www.theguardian.com/us-news/2025/sep/10/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;Trump, who was friends with Epstein before becoming president but had a falling out with the former financier, has denied giving him a letter. Key US politics stories from 9 September 2025&lt;/p&gt;&lt;p&gt;The White House has said it would support a forensic analysis of the signature on a letter purportedly given by Donald Trump to convicted sex offender Jeffrey Epstein that Trump’s aides say is not the president’s.&lt;/p&gt;&lt;p&gt;Trump, who was friends with Epstein before becoming president but had a falling out with the former financier years before his death, has denied giving him a letter that appears in a birthday book for Epstein with the sketch of a woman’s body and a note about secrets.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/10/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}