{
  "updatedAt": "2025-11-09T18:33:04.966Z",
  "items": [
    {
      "title": "Trump Renews Attacks on Obamacare in New Push Over Government Shutdown",
      "url": "https://www.nytimes.com/2025/11/09/us/politics/trump-shutdown-obamacare.html",
      "summary": "The president claimed that the Affordable Care Act benefited insurance companies over people, saying he would work with both parties on the issue “once the Government is open.”"
    },
    {
      "title": "Where Democrats Will Duel Next for the Party’s Future",
      "url": "https://www.nytimes.com/2025/11/09/us/politics/democrats-midterms-senate-house.html",
      "summary": "In Michigan, Maine and many other states, primary candidates will decide the party’s direction on a host of policy issues, and ultimately whether it has a center-left or left-wing vision."
    },
    {
      "title": "Trump Loyalists Push ‘Grand Conspiracy’ as New Subpoenas Land",
      "url": "https://www.nytimes.com/2025/11/09/us/politics/trump-conspiracy-probe-subpoenas.html",
      "summary": "The Justice Department moved an inquiry that appeared initially focused on the former C.I.A. director John O. Brennan to South Florida and is beginning to recruit line prosecutors."
    },
    {
      "title": "A Two-Headed Coin That Always Comes Up ‘Trump’",
      "url": "https://www.nytimes.com/2025/11/09/us/trump-commemorative-coin.html",
      "summary": "Would a proposed coin featuring the president on both sides commemorate America’s founding, or undercut its founding principles?"
    },
    {
      "title": "The Celebrated Chef Who Robbed Banks",
      "url": "https://www.nytimes.com/2025/11/09/us/chef-bank-robber.html",
      "summary": "Valentino Luchin, 62, once owned an acclaimed Italian restaurant. Now he sits in a Bay Area jail."
    },
    {
      "title": "New SF Clinic Helps People Facing Health Breakdowns in Public",
      "url": "https://www.nytimes.com/2025/11/09/us/san-francisco-drug-mental-health-clinic-lurie.html",
      "summary": "A former Goodwill thrift store now houses an urgent care clinic for people experiencing mental health breakdowns in public."
    },
    {
      "title": "Ghislaine Maxwell reportedly ‘much happier’ after prison transfer by Trump officials",
      "url": "https://www.theguardian.com/us-news/2025/nov/09/ghislaine-maxwell-trump-admin-prison-transfer",
      "summary": "&lt;p&gt;Jeffrey Epstein associate, serving 20 years for sex-trafficking crimes, is now in minimum-security federal prison in Texas&lt;/p&gt;&lt;p&gt;Longtime &lt;a href=\"https://www.theguardian.com/us-news/jeffrey-epstein\"&gt;Jeffrey Epstein&lt;/a&gt; associate &lt;a href=\"https://www.theguardian.com/us-news/ghislaine-maxwell\"&gt;Ghislaine Maxwell&lt;/a&gt;, who is serving a 20-year prison sentence for &lt;a href=\"https://www.theguardian.com/us-news/2021/dec/29/ghislaine-maxwell-sex-trafficking-trial-verdict\"&gt;sex-trafficking crimes&lt;/a&gt;, has reportedly said that she is “much, much happier” after the Trump administration transferred her to a minimum-security federal prison in Texas, according to emails obtained by &lt;a href=\"https://www.nbcnews.com/news/us-news/ghislaine-maxwell-prison-emails-minimum-security-bryan-texas-rcna242218\"&gt;NBC News&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;Maxwell, 63, was &lt;a href=\"https://www.theguardian.com/us-news/2025/aug/01/ghislaine-maxwell-prison-transfer\"&gt;moved&lt;/a&gt; from a low-security prison in Tallahassee, Florida, to the minimum-security Federal Prison Camp Bryan in Texas in August –&amp;nbsp;just days after she was &lt;a href=\"https://www.theguardian.com/us-news/2025/jul/25/ghislaine-maxwell-justice-department-meeting\"&gt;interviewed&lt;/a&gt; about the Epstein case by deputy attorney general, Todd Blanche. Blanche is a former personal lawyer for &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt;, who had been friends with the late Epstein – a convicted sex offender – before winning two presidencies.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/09/ghislaine-maxwell-trump-admin-prison-transfer\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "They flew to New York to help Mamdani – now they want to bring the hope to LA",
      "url": "https://www.theguardian.com/us-news/2025/nov/09/new-york-zohran-mamdani-los-angeles",
      "summary": "&lt;p&gt;Activists in Los Angeles say the energy from the Hollywood strikes has been reignited by the success of the mayor-elect&lt;/p&gt;&lt;p&gt;While the excitement for mayor-elect Zohran Mamdani has radiated through New York, his win has also energized young activists across the country – particularly some in Los Angeles, who flew to the east coast to canvass for Mamdani and now want to bring their experiences westward.&lt;/p&gt;&lt;p&gt;Standing near the poll site at the Metropolitan Museum of Art, Neda Davarpanah – a screenwriter and actor based in Los Angeles – was inspired by Mamdani’s campaign for mayor so she flew out to New York in late October to canvass on the Upper East Side.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/09/new-york-zohran-mamdani-los-angeles\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}