{
  "updatedAt": "2025-11-03T12:56:13.961Z",
  "items": [
    {
      "title": "In Redistricting Battles, Here’s How Trump, Republicans and Democrats Are Faring",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/midterm-elections-redistricting-trump.html",
      "summary": "President Trump is imploring lawmakers to redraw their congressional maps to stave off Democratic control of the House. But the debate over redistricting has revealed fissures within both parties."
    },
    {
      "title": "Elections Across the U.S. Will Test Democrats’ Momentum Ahead of 2026 Midterms",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/us-elections-democrats-trump.html",
      "summary": "Democrats have no federal contests that would allow them to check President Trump’s power, but governors’ races, mayoral contests and referendums will test momentum and divisions in both parties."
    },
    {
      "title": "The Nationwide Battle Over Electoral Maps",
      "url": "https://www.nytimes.com/video/us/elections/100000010489716/the-nationwide-battle-over-electoral-maps.html",
      "summary": "What began with Texas drawing what could be five new Republican districts in the House of Representatives at President Trump’s behest has spiraled into a nationwide redistricting race. Nick Corasaniti, a New York Times reporter covering national politics, gives an overview."
    },
    {
      "title": "Supreme Court Confronts Trump and His Tariffs in Test of Presidential Power",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/supreme-court-trump-tariffs.html",
      "summary": "The justices face so-called legitimacy dilemma as they deal with a tricky legal dispute and a president who has made clear he would view defeat as a personal insult."
    },
    {
      "title": "‘Political Scores’ Use Reams of Data to Predict Your Vote",
      "url": "https://www.nytimes.com/2025/11/03/us/political-score-voting-predictions.html",
      "summary": "Meet Mark Grebner, the Michigan statistician who helped pioneer the science of predicting whether someone will vote Republican or Democratic."
    },
    {
      "title": "The Monthslong Legal Battle to Save Foreign Aid",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/twisted-path-foreign-aid-court-case.html",
      "summary": "One lawsuit, underway since February, has sought to compel President Trump to honor Congress’s vision for foreign aid. It still has a long way to go."
    },
    {
      "title": "US government shutdown nearing record for longest in history as Trump delays food benefits to millions – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
      "summary": "&lt;p&gt;Republicans claim US president ‘desperate’ to end shutdown, which has now entered 33rd day&lt;/p&gt;&lt;p&gt;Tuesday is Election Day in several states. It will be an early indication of how voters feel in the first year of the second Trump administration.&lt;/p&gt;&lt;p&gt;Both Democrats and Republicans will be carefully watching the outcomes in the gubernatorial races in &lt;strong&gt;Virginia&lt;/strong&gt; and &lt;strong&gt;New Jersey&lt;/strong&gt;, the high-profile mayoral contest in &lt;strong&gt;New York&lt;/strong&gt; and the electorally significant redistricting referendum in &lt;strong&gt;California&lt;/strong&gt;, where Democrats have asked voters to approve redrawing the state’s congressional map.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Philadelphia’s progressive district attorney seeks third term as shootings decline. Critics contend he’s soft on criminals",
      "url": "https://www.theguardian.com/us-news/2025/nov/03/philadelphia-progressive-district-attorney-larry-krasner-third-term",
      "summary": "&lt;p&gt;Larry Krasner is favored to be re-elected on 4 November while progressive prosecutors around the country have been losing favor with voters&lt;/p&gt;&lt;p&gt;&lt;em&gt;This story was originally published by&lt;a href=\"https://www.thetrace.org/2025/10/larry-krasner-election-kada-scott-philly/\"&gt; &lt;/a&gt;&lt;/em&gt;&lt;em&gt;&lt;a href=\"https://www.thetrace.org/2025/10/larry-krasner-election-kada-scott-philly/\"&gt;the Trace&lt;/a&gt;, a non-profit newsroom covering gun violence in America. &lt;a href=\"http://www.thetrace.org/newsletter\"&gt;Sign up for its newsletters here&lt;/a&gt;.&lt;/em&gt;&lt;/p&gt;&lt;p&gt;As Philadelphia’s district attorney, Larry Krasner, attempted to explain himself, a pensive scowl replaced the look of assured confidence usually etched on his face.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/03/philadelphia-progressive-district-attorney-larry-krasner-third-term\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}