{
  "updatedAt": "2025-11-18T06:39:13.720Z",
  "items": [
    {
      "title": "Trump Says America Is in ‘Golden Age,’ Straining to Address Affordability",
      "url": "https://www.nytimes.com/2025/11/17/us/politics/trump-mcdonalds-affordability-inflation.html",
      "summary": "Speaking at a gathering of McDonald’s franchise owners and operators, the president boasted that he had “normalized” inflation."
    },
    {
      "title": "Tennessee Judge Temporarily Blocks National Guard Deployment in Memphis",
      "url": "https://www.nytimes.com/2025/11/17/us/politics/national-guard-memphis-ruling.html",
      "summary": "The judge said the case “raises important questions concerning the use of the state’s military forces for domestic law enforcement purposes.”"
    },
    {
      "title": "Larry Summers to Step Back From Public Commitments Over Epstein Emails",
      "url": "https://www.nytimes.com/2025/11/17/us/harvard-larry-summers-epstein.html",
      "summary": "New emails showed that Lawrence H. Summers, a former Harvard president, had stayed in touch with Jeffrey Epstein for years after Mr. Epstein faced sex trafficking charges."
    },
    {
      "title": "Trump Has the Power to Release the Epstein Files. Why Doesn’t He?",
      "url": "https://www.nytimes.com/2025/11/17/us/politics/trump-epstein-files-congress.html",
      "summary": "The president has reversed himself and encouraged lawmakers to vote for compelling the Justice Department to turn over investigation documents, but he never really needed their approval."
    },
    {
      "title": "Heritage Foundation Board Member Resigns Over Video Defending Tucker Carlson",
      "url": "https://www.nytimes.com/2025/11/17/us/politics/heritage-foundation-tucker-carlson-nick-fuentes.html",
      "summary": "The member, Robert P. George, said the think tank’s president had refused to retract his video defending Tucker Carlson’s friendly interview with an openly antisemitic white supremacist."
    },
    {
      "title": "Trump Gives Mixed Messages About Military Action Against Venezuela",
      "url": "https://www.nytimes.com/2025/11/17/us/politics/trump-venezuela-maduro.html",
      "summary": "President Trump said that he was open to talking with President Nicolás Maduro but that the United States has “to take care of Venezuela” as the U.S. builds a military force in the Caribbean."
    },
    {
      "title": "Man charged with murder of Oakland football coach John Beam",
      "url": "https://www.theguardian.com/us-news/2025/nov/17/oakland-football-coach-murder-john-beam",
      "summary": "&lt;p&gt;Cedric Irving Jr, 27, charged over death of ‘legend’ Beam, who was shot and killed on Laney College campus last week&lt;/p&gt;&lt;p&gt;A 27-year-old man was charged on Monday with the murder of the beloved Oakland football coach John Beam, who died last week after being shot in the head on the junior college campus in northern California where he worked.&lt;/p&gt;&lt;p&gt;Cedric Irving Jr, who does not have a criminal record, was charged with murder and use of a gun during the crime, Alameda county district attorney Ursula Jones Dickson said at a &lt;a href=\"https://www.youtube.com/watch?v=KS0X1-7Y7Tw\"&gt;news conference&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/17/oakland-football-coach-murder-john-beam\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump changes course on Epstein files; administration sues California over mask ban – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/17/donald-trump-jeffrey-epstein-files-republicans-democrats-world-cup-us-politics-live-news-updates",
      "summary": "&lt;p&gt;This live blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/17/trump-administration-news-updates-latest\"&gt;Trump news at a glance: in a U-turn, president tells Republicans to vote to release Epstein files&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;US Border Patrol officials said they had arrested 81 people over five hours in Charlotte, North Carolina, on Saturday, the first day of the targeted operation.&lt;br&gt;&lt;br&gt; The crackdown involving federal agents was only announced last week.&lt;/p&gt;&lt;p&gt;Mass deportation and strict enforcement of immigration laws have been a key part of Trump’s agenda since returning to office this year.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/17/donald-trump-jeffrey-epstein-files-republicans-democrats-world-cup-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}