{
  "updatedAt": "2025-11-22T06:36:10.467Z",
  "items": [
    {
      "title": "Fire Breaks Out on Cargo Ship in the Port of Los Angeles",
      "url": "https://www.nytimes.com/2025/11/22/us/cargo-ship-fire-los-angeles-port.html",
      "summary": "More than 100 firefighters were responding after the electrical fire started on the vessel, Mayor Karen Bass of Los Angeles said. All crew members were evacuated and no injuries were reported."
    },
    {
      "title": "Texas A&amp;M Wrong to Fire Professor Melissa McCoul Over Gender Lesson, Panel Rules",
      "url": "https://www.nytimes.com/2025/11/21/us/texas-am-professor-gender-lesson-panel-ruling.html",
      "summary": "The firing put the school at the center of national debates over gender identity and academic freedom. A faculty panel ruled unanimously against the termination."
    },
    {
      "title": "Federal Suit Seeking Names of Some Jewish Employees at Penn Sparks Backlash",
      "url": "https://www.nytimes.com/2025/11/21/us/eeoc-university-pennsylvania-antisemitism-jewish.html",
      "summary": "The Trump administration says it needs the information to investigate antisemitism and accuses the university of flouting a subpoena."
    },
    {
      "title": "Marjorie Taylor Greene Says She Will Resign in January, After Break From Trump",
      "url": "https://www.nytimes.com/2025/11/21/us/politics/marjorie-taylor-greene-resigns.html",
      "summary": "Ms. Greene, who was elected in 2020, had positioned herself as a die-hard Trump supporter until a series of recent ruptures with the president, who recently unendorsed her."
    },
    {
      "title": "‘Fascist’? ‘Communist’? For an Afternoon, Trump and Mamdani Were Just 2 Guys From Queens.",
      "url": "https://www.nytimes.com/2025/11/21/us/politics/trump-mamdani-scene.html",
      "summary": "Acid insults were set aside as New York’s mayor-elect and the president promoted their shared goals."
    },
    {
      "title": "Comey Seeks to Dismiss Charges Based on Grand Jury Errors",
      "url": "https://www.nytimes.com/2025/11/21/us/politics/comey-halligan-dismiss-charges.html",
      "summary": "The request to dismiss the case came after Lindsey Halligan acknowledged she had never shown a final version of the indictment to the entire grand jury for a vote."
    },
    {
      "title": "Marjorie Taylor Greene to resign from Congress in January amid fallout with Trump",
      "url": "https://www.theguardian.com/us-news/2025/nov/21/marjorie-taylor-greene-resigns",
      "summary": "&lt;p&gt;Decision by Georgia Republican and leading Maga figure to give up House seat comes after dramatic break with Trump, lately over the Epstein files bill&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/21/trump-marjorie-taylor-greene\"&gt;Reaction: Trump calls resignation ‘great news for the country’&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/21/marjorie-taylor-greene-career-key-takeaways\"&gt;From staunch Trump ally to ‘traitor’: key takeaways of Marjorie Taylor Greene’s career&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Marjorie Taylor Greene &lt;a href=\"https://x.com/mtgreenee/status/1992037226415554642\"&gt;announced&lt;/a&gt; on Friday evening she will be resigning from office effective 5 January 2026, in the wake of souring relations with President Donald Trump, mostly recently over a vote to force the release of files related to the late Jeffrey Epstein.&lt;/p&gt;&lt;p&gt;In a four-page statement, the Georgia congresswoman said the legislative branch had been “sidelined” and accused Republican leaders of refusing to advance conservative priorities such as border security or “America First” policies.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/21/marjorie-taylor-greene-resigns\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump calls Marjorie Taylor Greene resignation ‘great news for the country’",
      "url": "https://www.theguardian.com/us-news/2025/nov/21/trump-marjorie-taylor-greene",
      "summary": "&lt;p&gt;President says ‘I think she should be happy’ while Democratic colleague praises her for stance on Epstein files&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/21/marjorie-taylor-greene-resigns\"&gt;Full report: Marjorie Taylor Greene to resign from Congress in January&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/21/marjorie-taylor-greene-career-key-takeaways\"&gt;From staunch Trump ally to ‘traitor’: key takeaways of Marjorie Taylor Greene’s career&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Marjorie Taylor Greene, the Republican Georgia congresswoman who had a dramatic blow-up with Donald Trump despite being his longtime ally, announced on Friday she would be resigning – which the president called “great news”.&lt;/p&gt;&lt;p&gt;“Loyalty should be a two-way street,” Greene said in a lengthy resignation statement shared on social media, adding that it was “unfair and wrong” that Trump turned on her for disagreeing with him.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/21/trump-marjorie-taylor-greene\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}