{
  "updatedAt": "2025-10-23T12:56:50.019Z",
  "items": [
    {
      "title": "4 Members of Illinois Politician Darren Bailey’s Family Are Killed in Helicopter Crash",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/darren-bailey-family-helicopter-crash-montana.html",
      "summary": "Darren Bailey, a Republican candidate for governor, lost his son, daughter-in-law and two grandchildren, ages 12 and 7, in a helicopter accident in Montana, his campaign said."
    },
    {
      "title": "Harvard Records an Increase in Asian Students and a Drop in Black Students",
      "url": "https://www.nytimes.com/2025/10/23/us/harvard-admissions-data-black-asian-latino-students.html",
      "summary": "The shift mirrors trends at other elite schools after a ban on affirmative action. The Trump administration has said it wants to scrutinize demographics to ensure schools aren’t using racial preferences."
    },
    {
      "title": "Unlike Trump, Most Who Seek Money for Official Misconduct Face Long Odds",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/trump-misconduct-claims.html",
      "summary": "The Federal Tort Claims Act, the law the president invoked to try to obtain hundreds of millions of dollars, is ordinarily a legal labyrinth that few can navigate."
    },
    {
      "title": "A Girls Basketball Team Gives Up Its Title After Spotting a Scoring Error",
      "url": "https://www.nytimes.com/2025/10/23/us/oklahoma-girls-basketball-team-championship-title.html",
      "summary": "The team in Oklahoma City forfeited its district championship earlier this year after the coach verified that a scoring error had incorrectly crowned them as winners."
    },
    {
      "title": "In Seattle as in New York, a Mayoral Race Turns on Generational Change",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/seattle-mayor.html",
      "summary": "Mayor Bruce Harrell of Seattle, 67, is facing a challenge from Katie Wilson, 43, who has a penchant for social media and a focus on cost of living, all reminiscent of Zohran Mamdani."
    },
    {
      "title": "Inside Our Reporter’s Collection of Guantánamo Portraits",
      "url": "https://www.nytimes.com/video/us/100000010405893/inside-our-reporters-collection-of-guantanamo-portraits.html",
      "summary": "Carol Rosenberg, a reporter who has covered the U.S. military prison at Guantánamo Bay since it opened in 2002, describes a collection of stylized portraits of its detainees in the war against terrorism. The photos were taken as part of a Red Cross program for the detainees to communicate with their families."
    },
    {
      "title": "Trump plans to send federal agents to San Francisco ‘right out of dictator’s handbook’, says Newsom – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates",
      "summary": "&lt;p&gt;California governor condemns latest immigration enforcement operation, expected to cause showdown between administration and local leaders&lt;/p&gt;&lt;p&gt;&lt;strong&gt;More than half of Americans, including about three in 10 Republicans, believe president Donald Trump is using federal law enforcement to go after his enemies, according to a new Reuters/Ipsos poll that also found growing concern about US political divisions nine months into his second term in office.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Some 55% of poll respondents in the six-day poll, which closed on Monday, agreed with a statement that the Republican president is using law enforcement to target his enemies, while 26% disagreed and the rest were unsure or did not respond.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Revealed: police across US spread false rumors about Venezuelan gang threats",
      "url": "https://www.theguardian.com/us-news/2025/oct/23/venezuela-tren-de-aragua-gang-police",
      "summary": "&lt;p&gt;Claim that Tren de Aragua planned to attack officers was widely shared – only for FBI to later acknowledge it was mistaken, internal files show&lt;/p&gt;&lt;p&gt;An unverified rumor that Venezuelan gang members were preparing to kill police officers spread like wildfire through US law enforcement agencies last year, internal records reveal, only for federal officials to later quietly acknowledge the claim was mistaken.&lt;/p&gt;&lt;p&gt;The intelligence report, which appears to have first been disseminated by a local New Mexico police department in July 2024, suggested that the Tren de Aragua (TdA) gang had directed its members to “fire on or attack” law enforcement. The vague assertion quickly traveled among law enforcement agencies. It even made its way into a formal proclamation by Texas governor Greg Abbott, and was repeated by Republican Congress members as evidence of the dangers of Venezuelan immigrants and Democrats’ border policies.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/23/venezuela-tren-de-aragua-gang-police\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}