{
  "updatedAt": "2025-09-13T06:43:04.898Z",
  "items": [
    {
      "title": "Lawsuit Accuses Trump Officials of More Wrongful Deportations",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/trump-lawsuit-wrongful-deportations-ghana.html",
      "summary": "Plaintiffs accused the Trump administration of using so-called third-country deportations to violate court-ordered protections for migrants, echoing the case of Kilmar Armando Abrego Garcia."
    },
    {
      "title": "California’s $23 Billion Plan to Restore Federal Cuts to Scientific Research",
      "url": "https://www.nytimes.com/2025/09/13/us/california-scientific-research-bond.html",
      "summary": "Democrats are calling for the creation of a state equivalent of the National Institutes of Health, but first state lawmakers and then voters would need to approve it."
    },
    {
      "title": "Vance Invokes Charlie Kirk in Midterms Push to G.O.P. Donors",
      "url": "https://www.nytimes.com/2025/09/12/us/politics/vance-charlie-kirk-republican-donors.html",
      "summary": "Vice President JD Vance urged major contributors to win the 2026 midterms to honor Charlie Kirk, who was Mr. Vance’s close friend."
    },
    {
      "title": "How Law Enforcement Got the Man Suspected of Killing Charlie Kirk",
      "url": "https://www.nytimes.com/2025/09/12/us/charlie-kirk-law-enforcement-fbi-capture.html",
      "summary": "F.B.I. leaders touted the immense federal deployment assigned to find the assassin. But their big break came with a single tip — from the suspect’s own family."
    },
    {
      "title": "The suspect was a member of the Mormon church at a young age.",
      "url": "https://www.nytimes.com/live/2025/09/12/us/charlie-kirk-news-suspect/the-suspect-was-a-member-of-the-mormon-church-at-a-young-age",
      "summary": ""
    },
    {
      "title": "Charlie Kirk Engaged in Debate on Religion Before He Was Shot",
      "url": "https://www.nytimes.com/2025/09/12/us/charlie-kirk-debate-utah-shooting.html",
      "summary": "The New York Times examined video footage to better understand what was said during Mr. Kirk’s event at Utah Valley University."
    },
    {
      "title": "Widow of Charlie Kirk says her ‘cries will echo around the world like a battle cry’",
      "url": "https://www.theguardian.com/us-news/2025/sep/12/erika-kirk-charlie-kirk",
      "summary": "&lt;p&gt;In statement Friday, Erika Kirk says ‘evildoers responsible for my husband’s assassination have no idea what they have done’&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/12/trump-fox-friends-charlie-kirk-shooting\"&gt;Trump declines to call for unity after Charlie Kirk killing in stunning move&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Erika Kirk, the widow of rightwing activist and provocateur &lt;a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"&gt;Charlie Kirk&lt;/a&gt;, said in a statement Friday evening that her late husband’s message and mission will be “stronger, bolder, louder and greater than ever” and that her “cries will echo around the world like a battle cry”.&lt;/p&gt;&lt;p&gt;“I loved knowing one of his mottos was ‘never surrender’,” she said of her late husband. “We’ll never surrender.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/12/erika-kirk-charlie-kirk\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Widow of Kirk gives statement after husband’s shooting – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
      "summary": "&lt;p&gt;&lt;strong&gt;This blog is closed. You can see &lt;/strong&gt;&lt;a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"&gt;&lt;strong&gt;further coverage of the Charlie Kirk shooting here&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;Here are some images coming to us via the wires.&lt;/p&gt;&lt;p&gt;Democracy is the way that we have diverse societies that don’t kill each other, largely,” Lilliana Mason, a leading scholar of partisanship, &lt;a href=\"https://youtube.com/watch?v=vIQiVQ21VN0\"&gt;observed recently&lt;/a&gt;. She added: “As soon as we stop believing in it, it disappears.” Dr Mason’s own research suggests that there is sharply rising tolerance of political violence. On Wednesday, it claimed one more victim.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}