{
  "updatedAt": "2025-10-30T12:55:48.146Z",
  "items": [
    {
      "title": "Trump and Xi Agree to a Yearlong Trade Truce",
      "url": "https://www.nytimes.com/2025/10/30/us/trump-and-xi-agree-to-a-yearlong-trade-truce.html",
      "summary": "The deal rolls back many tariffs and retaliatory measures."
    },
    {
      "title": "Trump and Xi Ease Off the Trade War, but New Nuclear Threat Brings a Chill",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/trump-xi-trade-meeting.html",
      "summary": "The two leaders reached an agreement on fentanyl, some tariffs and rare earths, at least for a year. But even as the global trade picture cleared a little, Mr. Trump spurred new worries about nuclear proliferation."
    },
    {
      "title": "Inmates Win $6 Million Settlement for Abuse Claims Against Prison Officers",
      "url": "https://www.nytimes.com/2025/10/30/us/massachusetts-inmates-abuse-settlement.html",
      "summary": "The inmates said the officers carried out a weekslong campaign of violence in 2020 at the state’s lone maximum security prison."
    },
    {
      "title": "Trump’s Search for Eternity: Heaven? Maybe Not, He Says. Monuments? Absolutely.",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/trump-heaven-legacy.html",
      "summary": "After a lifetime of scandal, the president expresses doubt that he will be admitted to paradise. But he appears increasingly intent on finding other paths to eternity."
    },
    {
      "title": "What New Jersey Could Reveal About the Rightward Shift of Hispanic Voters",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/republicans-hispanics-new-jersey.html",
      "summary": "An off-year governor’s race will test the durability of the gains President Trump made in 2024, when the state’s majority-Hispanic townships all swung in his direction."
    },
    {
      "title": "Trump’s Test Threat Could Fuel Nuclear Tensions With China",
      "url": "https://www.nytimes.com/2025/10/29/us/politics/nuclear-test-ban.html",
      "summary": "Beijing has been expanding its arsenal, and distrust between China and the United States over nuclear weapons has deepened, with little hope of an agreement."
    },
    {
      "title": "Senators demand answers on ICE’s use of full-body restraints on deportees",
      "url": "https://www.theguardian.com/us-news/2025/oct/30/ice-full-body-restraints-democratic-senators",
      "summary": "&lt;p&gt;Group of 11 Democratic senators has raised concerns about use of Wrap full-body restraints on US deportation flights&lt;/p&gt;&lt;p&gt;A “near-total secrecy” surrounding deportation flights and the use of full-body restraints onboard is raising “serious human rights concerns”, a group of 11 Democratic US senators wrote in a letter on Thursday to top immigration officials.&lt;/p&gt;&lt;p&gt;Senator Chris Van Hollen of Maryland called upon US Immigration and Customs Enforcement to provide a full accounting of its air operations and to stop using the black and yellow restraints known as the Wrap until the agency explains its policies for the device and resolves other questions about its use on immigration detainees.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/30/ice-full-body-restraints-democratic-senators\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump-Xi meeting shows price of confrontation was too high for both sides",
      "url": "https://www.theguardian.com/us-news/2025/oct/30/trump-xi-jinping-meeting-us-china-price-confrontation",
      "summary": "&lt;p&gt;Outcome appears closer to truce than durable peace but outline of broader diplomatic relationship is visible&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates\"&gt;Trump meets Xi in South Korea – live updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;When Donald Trump launched his trade war against China in April, threatening tariffs as high as 145%, the Chinese government said it would never bow to blackmail and vowed to “fight to the end”.&lt;/p&gt;&lt;p&gt;The question now is whether the &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/30/trump-and-xi-meet-in-south-korea-for-crunch-talks-on-trade\"&gt;consensus reached between Trump and Xi Jinping&lt;/a&gt; in Busan, South Korea, on Thursday means that the fight really has come to an end, and if so on whose terms.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/30/trump-xi-jinping-meeting-us-china-price-confrontation\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}