{
  "updatedAt": "2025-09-25T13:41:28.151Z",
  "items": [
    {
      "title": "Ryan Walters, Oklahoma Education Chief Who Promoted Bibles in Schools, to Resign",
      "url": "https://www.nytimes.com/2025/09/25/us/ryan-walters-oklahoma-resign.html",
      "summary": "Ryan Walters had drawn criticism from liberals and conservatives alike over his push to place Bibles in classrooms and bring more prayer into public schools."
    },
    {
      "title": "Tylenol Issues Clarification After White House Resurfaces 2017 Tweet on Usage During Pregnancy",
      "url": "https://www.nytimes.com/2025/09/25/us/politics/tylenol-tweet-2017-pregnancy-autism.html",
      "summary": "Tylenol’s parent company, Kenvue, said an eight-year-old social media post was “being taken out of context” as the Trump administration warns pregnant women not to take the drug."
    },
    {
      "title": "Times Reporters Answer Your Vaccine Questions",
      "url": "https://www.nytimes.com/2025/09/25/us/times-reporters-answer-your-vaccine-questions.html",
      "summary": "We received hundreds of queries about efficacy, safety, cost and access."
    },
    {
      "title": "Runway Safety Bed Stops Skidding Plane in Virginia",
      "url": "https://www.nytimes.com/2025/09/25/us/virginia-jet-roanoke-blacksburg-airport.html",
      "summary": "The concrete bed stopped a commercial flight that lost control during landing. The safety system slows a runaway aircraft by collapsing under its weight."
    },
    {
      "title": "Democratic Report Says Disorder at DOGE Jeopardized Americans’ Data",
      "url": "https://www.nytimes.com/2025/09/25/us/politics/democratic-report-disorder-doge.html",
      "summary": "Members of a Senate panel described a haphazard working and living environment that involved transferring sensitive information to servers “without any verified security controls.”"
    },
    {
      "title": "What We Know About the Shooting at a Dallas ICE Facility",
      "url": "https://www.nytimes.com/2025/09/25/us/dallas-ice-facility-shooting-suspect.html",
      "summary": "One detainee was killed and two others were wounded after a gunman opened fire on Wednesday. The gunman died of a self-inflicted gunshot wound."
    },
    {
      "title": "Fema’s acting chief reportedly could not be reached during deadly Texas floods",
      "url": "https://www.theguardian.com/us-news/2025/sep/25/fema-texas-floods",
      "summary": "&lt;p&gt;Disaster relief agency reportedly didn’t answer two-thirds of calls after criticism for slow response during devastation&lt;/p&gt;&lt;p&gt;The US Federal Emergency Management Agency (Fema)’s acting administrator was largely unreachable after &lt;a href=\"https://www.theguardian.com/us-news/texas-floods-2025\"&gt;deadly flooding&lt;/a&gt; swept through &lt;a href=\"https://www.theguardian.com/us-news/texas\"&gt;Texas&lt;/a&gt; in July, according to a new report.&lt;/p&gt;&lt;p&gt;That meant the agency could not deploy search-and-rescue resources as quickly as possible. The federal agency had already &lt;a href=\"https://www.theguardian.com/us-news/2025/jul/23/fema-director-texas-flood-response\"&gt;faced criticism&lt;/a&gt; for its slow response to the disaster in which more than 130 people died.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/25/fema-texas-floods\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Federal prosecutors reportedly gave US attorney memo suggesting not to file charges against James Comey – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
      "summary": "&lt;p&gt;Prosecutors in eastern district of Virginia detailed to Lindsey Halligan why not to file criminal charges against former FBI director, ABC news says&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Dozens of House &lt;a href=\"https://www.theguardian.com/us-news/democrats\"&gt;Democrats&lt;/a&gt; have signed a letter to &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; and secretary of state &lt;a href=\"https://www.theguardian.com/us-news/marco-rubio\"&gt;Marco Rubio&lt;/a&gt;, urging the administration to recognize Palestinian statehood.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The letter, led by &lt;a href=\"https://www.theguardian.com/us-news/california\"&gt;California&lt;/a&gt; Democrat Ro Khanna, has 46 signatures, and lawmakers will send it to the US president on Friday, &lt;strong&gt;according to plans first provided to the Guardian&lt;/strong&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}