{
  "updatedAt": "2025-09-08T18:48:25.234Z",
  "items": [
    {
      "title": "Republican Senators Investigate Palisades Fire Response",
      "url": "https://www.nytimes.com/2025/09/08/us/palisades-fire-investigation-los-angeles.html",
      "summary": "Two senators have begun an investigation into whether government officials could have done more to stop the Los Angeles fire. President Trump and other Republicans have blamed Democratic leaders for the disaster."
    },
    {
      "title": "Democrats Demand to Know More About Security Clearance Revocations",
      "url": "https://www.nytimes.com/2025/09/08/us/politics/security-clearances-trump-gabbard-democrats.html",
      "summary": "Members of the House Intelligence Committee want more information about the decision to strip the clearances from 37 current and former officials."
    },
    {
      "title": "Trump Administration Says It Has Begun Immigration Crackdown in Chicago",
      "url": "https://www.nytimes.com/2025/09/08/us/chicago-immigration-crackdown-trump-administration.html",
      "summary": "In Chicago, advocates for immigrants said they saw several arrests on Sunday, but were uncertain of the scale of federal action."
    },
    {
      "title": "Witness to Michael Brown’s Shooting in Ferguson Dies of Gunshot Injuries",
      "url": "https://www.nytimes.com/2025/09/08/us/dorian-johnson-ferguson-michael-brown.html",
      "summary": "Dorian Johnson was shot in a domestic incident, 11 years after Mr. Brown’s death in a confrontation with a police officer led to nationwide protests."
    },
    {
      "title": "Supreme Court Lifts Restrictions on L.A. Immigration Stops",
      "url": "https://www.nytimes.com/2025/09/08/us/politics/supreme-court-los-angeles-immigration.html",
      "summary": "A federal judge had ordered agents not to make indiscriminate stops relying on factors like a person’s ethnicity or that they speak Spanish."
    },
    {
      "title": "Trump Administration, Again, Asks Supreme Court to Let It Block Foreign Aid",
      "url": "https://www.nytimes.com/2025/09/08/us/politics/trump-supreme-court-foreign-aid.html",
      "summary": "The court has been largely receptive to the administration’s claims of executive power."
    },
    {
      "title": "US supreme court backs Trump on aggressive immigration raids – live updates",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Court allows federal agents to proceed with raids in southern California targeting people for deportation based on their race or language&lt;/p&gt;&lt;p&gt;Intent on vindication after spending four months in prison last year, &lt;strong&gt;Peter Navarro&lt;/strong&gt; asked a federal appeals court on Sunday night to force &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump’s&lt;/a&gt; justice department to explain why it would not defend his 2022 conviction for defying a &lt;a href=\"https://www.theguardian.com/us-news/us-capitol-breach\"&gt;January 6&lt;/a&gt; committee subpoena.&lt;/p&gt;&lt;p&gt;The request to the US court of appeals for the DC circuit is fraught for the department as it would have to confront the appearance that it &lt;a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cadc.40540/gov.uscourts.cadc.40540.2132720.0.pdf\"&gt;quietly dropped the case&lt;/a&gt; in order to shield Navarro after he was tapped as a senior adviser to the president.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Supreme court lifts restrictions on Los Angeles immigration raids in win for Trump",
      "url": "https://www.theguardian.com/us-news/2025/sep/08/trump-supreme-court-ice-immigration-california",
      "summary": "&lt;p&gt;Conservative majority lifts restraining order from judge who found’roving patrols’ were conducting indiscriminate arrests&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates\"&gt;US politics live – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Federal agents can resume sweeping immigration operations in Los Angeles after the US supreme court lifted an order barring the Donald Trump administration from stopping people solely based on their race, language or job.&lt;/p&gt;&lt;p&gt;The court ruled in favor of Trump’s administration, granting a stay against a restraining order from another judge that found “roving patrols” of immigration agents were conducting indiscriminate arrests in LA. The ruling from the conservative majority is a win for the administration in its ongoing effort to enact mass deportations.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/08/trump-supreme-court-ice-immigration-california\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}