{
  "updatedAt": "2025-10-13T06:39:41.645Z",
  "items": [
    {
      "title": "Dozens Rescued in Remote Alaskan Villages in Storm That Swept Away Homes",
      "url": "https://www.nytimes.com/2025/10/13/us/alaska-flooding-rescues.html",
      "summary": "The Coast Guard and the Alaska National Guard were conducting search-and-rescue operations in two villages along the Bering Sea on Sunday."
    },
    {
      "title": "A Tennessee Sheriff Becomes the Face of Grief After Plant Explosion",
      "url": "https://www.nytimes.com/2025/10/12/us/tennessee-sheriff-plant-explosion-tears.html",
      "summary": "The blast that killed 16 people has left area residents reeling, including Sheriff Chris Davis of Humphreys County, who has fought back tears in his public briefings."
    },
    {
      "title": "2 Dead After Small Plane Crashes Into Semitrailers Near Texas Airfield",
      "url": "https://www.nytimes.com/2025/10/12/us/fort-worth-plane-crash-hicks-field.html",
      "summary": "It was unknown what led up to the crash on Sunday afternoon near Hicks Airfield outside of Fort Worth."
    },
    {
      "title": "Trump Has Not Ruled Out Invoking Insurrection Act to Deploy National Guard, Vance Says",
      "url": "https://www.nytimes.com/2025/10/12/us/politics/jd-vance-trump-insurrection-act.html",
      "summary": "Vice President JD Vance asserted in an interview on NBC News’ “Meet the Press” that crime was “out of control” in major U.S. cities."
    },
    {
      "title": "Trump Heads to Israel and Then Egypt as Hostage-Prisoner Swap Nears",
      "url": "https://www.nytimes.com/2025/10/12/us/politics/trump-leaves-for-a-visit-to-israel-and-will-later-co-chair-a-meeting-in-egypt-on-the-gaza-peace-plan.html",
      "summary": "In Israel, he plans to meet with hostage families and address the Knesset, and in Egypt, he will help lead a summit with more than 20 countries to discuss the peace process in Gaza."
    },
    {
      "title": "Why Now? The Lost Chances to Reach a Hostage Deal, and a Cease-Fire, Months Ago",
      "url": "https://www.nytimes.com/2025/10/12/us/politics/lost-chances-hostage-deal-gaza-israel.html",
      "summary": "On Gaza, President Trump put few, if any, guardrails on Israel’s offensive, bucking international demands for a cease-fire. Then he changed course."
    },
    {
      "title": "Trump news at a glance: Insurrection Act on the cards, says Vance, as president touts peace in the Middle East",
      "url": "https://www.theguardian.com/us-news/2025/oct/13/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;JD Vance confirms White House seriously considering invoking 1807 insurrection act as Trump heads to Israel. Key US politics stories from Sunday 12 October at a glance.&lt;/p&gt;&lt;p&gt;The Trump administration is considering ways to invoke emergency powers, including utilising the Insurrection Act of 1807, which would allow president Donald Trump to deploy troops on US soil in the event of major unrest.&lt;/p&gt;&lt;p&gt;Despite legal pushback, vice-president JD Vance has confirmed the White is seriously considering the idea. “The president’s looking at all of his options,” he told NBC’s News’s Meet the Press on Sunday, adding that “we are talking about this because crime has gotten out of control in our cities”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/13/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump says ‘war is over’ in Gaza as Israel awaits release of hostages",
      "url": "https://www.theguardian.com/us-news/2025/oct/12/trump-israel-gaza-war-hostages",
      "summary": "&lt;p&gt;US president says Middle East will ‘normalize’ before he boarded flight to Israel for world leaders’ peace summit&lt;/p&gt;&lt;p&gt;The war in &lt;a href=\"https://www.theguardian.com/world/gaza\"&gt;Gaza&lt;/a&gt; has ended and the Middle East is going to “normalize”, &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; said on Sunday as he flew to &lt;a href=\"https://www.theguardian.com/world/israel\"&gt;Israel&lt;/a&gt;, which was waiting for Hamas to &lt;a href=\"https://www.theguardian.com/world/2025/oct/12/israel-and-gaza-prepare-for-release-of-hostages-and-prisoners\"&gt;release&lt;/a&gt; Israeli hostages as world leaders were gathering to discuss the next steps toward peace.&lt;/p&gt;&lt;p&gt;“The war is over, you understand that,” Trump told reporters onboard Air Force One as he began a flight from Washington DC to Israel.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/12/trump-israel-gaza-war-hostages\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}