{
  "updatedAt": "2025-11-15T06:36:10.677Z",
  "items": [
    {
      "title": "Trump Cuts Ties With Marjorie Taylor Greene, Calling Her ‘Wacky’",
      "url": "https://www.nytimes.com/2025/11/14/us/politics/trump-marjorie-taylor-greene-split.html",
      "summary": "The rupture exposed the divides within President Trump’s MAGA base over the Epstein files and more."
    },
    {
      "title": "Officers were hurt in a crash while protecting Vance’s motorcade in Tennessee.",
      "url": "https://www.nytimes.com/live/2025/11/14/us/trump-shutdown-news/vance-motorcade-accident-tennessee",
      "summary": "A police officer who was on a motorcyc"
    },
    {
      "title": "Trump Says He No Longer Supports Marjorie Taylor Greene",
      "url": "https://www.nytimes.com/2025/11/14/us/politics/trump-marjorie-taylor-greene.html",
      "summary": "The president accused the Georgia congresswoman of turning on him and being disloyal."
    },
    {
      "title": "Judge Orders Trump Not to Threaten University of California’s Funding",
      "url": "https://www.nytimes.com/2025/11/14/us/trump-university-of-california-funding.html",
      "summary": "An extraordinary rebuke to the federal government’s campaign against elite schools, the ruling could upend settlement talks with the university system."
    },
    {
      "title": "Trump Escalates Pressure on Venezuela, but Endgame Is Unclear",
      "url": "https://www.nytimes.com/2025/11/14/us/politics/trump-pressure-venezuela.html",
      "summary": "President Trump’s aides have provided conflicting accounts of what, exactly, they are seeking to achieve, as America’s largest aircraft carrier heads toward the Caribbean region."
    },
    {
      "title": "Why Matt Gaetz Is Still Around",
      "url": "https://www.nytimes.com/2025/11/14/us/politics/matt-gaetz-washington-trump.html",
      "summary": "The former congressman has remained a fixture in Washington."
    },
    {
      "title": "Trump turns on former ally Marjorie Taylor Greene as Epstein questions mount – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/14/us-politics-latest-news-donald-trump-ice-bishops-jeffrey-epstein",
      "summary": "&lt;p&gt;This live blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/14/trump-administration-news-updates-today\"&gt;Trump news at a glance: Pam Bondi announces investigation into Trump’s adversaries’ ties to Jeffrey Epstein&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The US trade representative, &lt;strong&gt;Jamieson Greer&lt;/strong&gt;, said that the US has “essentially reached a deal with Switzerland”, after the country was hit with a 39% tariff on Swiss exports to the US.&lt;/p&gt;&lt;p&gt;“We’re really excited about that deal and what it means for American manufacturing,” Greer told CNBC today in an interview.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/14/us-politics-latest-news-donald-trump-ice-bishops-jeffrey-epstein\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump ends support for Marjorie Taylor Greene amid growing Epstein feud",
      "url": "https://www.theguardian.com/us-news/2025/nov/14/trump-marjorie-taylor-greene-support",
      "summary": "&lt;p&gt;President turns on ‘Wacky Marjorie’ after congresswoman criticizes effort to block release of key Epstein documents&lt;/p&gt;&lt;p&gt;Donald Trump announced Friday that he is withdrawing his support and endorsement of Republican lawmaker Marjorie Taylor Greene, a longtime ally and previously fierce defender of the president and the Maga movement.&lt;/p&gt;&lt;p&gt;Trump’s move away from Greene came just hours after she said in an interview she thought the president’s attempts to stop the release of the files related to disgraced financier Jeffrey Epstein is “insanely the wrong direction to go”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/14/trump-marjorie-taylor-greene-support\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}