{
  "updatedAt": "2025-10-26T12:49:56.703Z",
  "items": [
    {
      "title": "Halloween Season Is Here. Bring on the Horror.",
      "url": "https://www.nytimes.com/2025/10/26/us/halloween-season-is-here-bring-on-the-horror.html",
      "summary": "Why are scary movies doing so well right now?"
    },
    {
      "title": "What Voters Think of Trump’s White House Ball",
      "url": "https://www.nytimes.com/2025/10/26/us/politics/trump-white-house-ballroom-voters-reaction.html",
      "summary": "There is outrage. But also optimism. And then there is the question: Given everything else going on, why now?"
    },
    {
      "title": "In Trump-Friendly Iowa, the President’s Policies Have Hit Hard",
      "url": "https://www.nytimes.com/2025/10/26/us/politics/iowa-trump-economy.html",
      "summary": "The state has become a stronghold for President Trump. Now, his efforts on trade, energy and immigration are squeezing farmers, disrupting labor and threatening industries."
    },
    {
      "title": "Under Trump, Voice of America Is Down but Not Out",
      "url": "https://www.nytimes.com/2025/10/26/us/politics/under-trump-voice-of-america-is-down-but-not-out.html",
      "summary": "Buttressed by courts and support from some Republican lawmakers, federally funded newsrooms that President Trump has tried to eliminate have yet to be rendered obsolete."
    },
    {
      "title": "Honduran Man Struck and Killed On a Virginia Highway While Fleeing ICE",
      "url": "https://www.nytimes.com/2025/10/25/us/ice-honduran-killed-virginia.html",
      "summary": "ICE officers were in the process of detaining Josue Castro-Rivera, 24, of Honduras, before he ran onto a busy highway in Norfolk and was struck by a pickup truck, officials said."
    },
    {
      "title": "Ex-L.A.P.D. Officer Indicted in On-Duty Shooting of Unarmed Homeless Man",
      "url": "https://www.nytimes.com/2025/10/25/us/lapd-homeless-shooting-murder-charge.html",
      "summary": "Clifford Proctor, 60, was charged with second-degree murder in the 2015 killing of Brendon Glenn during an attempted arrest."
    },
    {
      "title": "As Trump cracks down, faith groups step up for immigrants: ‘What has happened to our heart?’",
      "url": "https://www.theguardian.com/us-news/2025/oct/26/trump-immigration-faith-groups",
      "summary": "&lt;p&gt;Nuns, bishops and laity from California to Texas have created a network of help to uphold church teachings&lt;/p&gt;&lt;p&gt;Catholic parishioners rushed to deliver food boxes to immigrants too terrified to leave their homes in the California city of Coachella after federal immigration agents swept through Latino neighborhoods during the summer.&lt;/p&gt;&lt;p&gt;Just south of Arizona’s border in Nogales, Mexico, Catholic nuns, laypeople and volunteers at the &lt;a href=\"https://www.kinoborderinitiative.org/\"&gt;Kino Border Initiative&lt;/a&gt;, despite rising threats against aid workers, cook and serve two meals daily for immigrants who have been deported or lost their chances at US asylum in &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt;’s crackdown.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/26/trump-immigration-faith-groups\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Gun violence prevention groups disqualified from grants built around their work",
      "url": "https://www.theguardian.com/us-news/2025/oct/26/gun-violence-prevention-non-profit-grants-disqualified",
      "summary": "&lt;p&gt;Trump administration altering program that was a lifeline for pioneering non-profits helping reduce gun violence&lt;/p&gt;&lt;p&gt;The Trump administration has released solicitations for a grant program meant to stop gun violence in underserved communities. But this year, the non-profits the grant was built around are disqualified from applying, according to an application notice released by the Department of Justice (DoJ) in September.&lt;/p&gt;&lt;p&gt;The Community Based Violence Intervention and Prevention Initiative (CVIPI), was created in 2022, to support groups working in rural and urban communities struggling to address violence and fund research studying the programs’ efficacy.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/26/gun-violence-prevention-non-profit-grants-disqualified\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}