{
  "updatedAt": "2025-10-01T06:37:54.083Z",
  "items": [
    {
      "title": "What Are the Effects of a Government Shutdown?",
      "url": "https://www.nytimes.com/video/us/100000010431360/government-shutdown-economic-effects.html",
      "summary": "Ben Casselman, the chief economics correspondent for The New York Times, describes the economic effects of a government shutdown."
    },
    {
      "title": "A More Polarized Senate Drives Shutdown Gridlock",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/polarized-senate-shutdown-gridlock.html",
      "summary": "With few senators from conservative states in their ranks, Democrats feel less pressure to capitulate, while more conservative Republicans are not inclined to cut a deal."
    },
    {
      "title": "Full Federal Appeals Court to Hear Alien Enemies Act Case",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/appeals-court-alien-enemies-act.html",
      "summary": "The decision vacated a finding by a panel of the court’s judges regarding President Trump’s use of the Alien Enemies Act to deport immigrants, but did not clear the way for such expulsions to resume."
    },
    {
      "title": "Judge Disqualifies Nevada’s Acting U.S. Attorney From Handling Cases",
      "url": "https://www.nytimes.com/2025/09/30/us/nevada-acting-us-attorney-chattah-disqualified.html",
      "summary": "A federal judge said Sigal Chattah was not “validly serving as acting U.S. attorney.” The Trump administration had appointed her to the post in a way that circumvented federal procedures."
    },
    {
      "title": "Judge Blocks Trump Move to Cut FEMA Funds Over Immigration Policy",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/trump-fema-funds-immigration.html",
      "summary": "A coalition of blue states and Washington, D.C., accused the Trump administration of illegally “taking money from its enemies” in freezing emergency preparedness grants."
    },
    {
      "title": "Are You Quitting the Military? We Want to Hear From You.",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/military-leaders-quit-callout.html",
      "summary": "The New York Times is looking for generals and admirals who are quitting the military following an address from the defense secretary."
    },
    {
      "title": "US government shutdown live: first closure since 2018 begins after funding bill fails",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
      "summary": "&lt;p&gt;Competing bills rejected in Senate as Republicans and Democrats accuse each other of partisan politics. Follow the latest news and updates after the US government shut down&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/01/us-government-shuts-down\"&gt;US government shuts down after Democrats refuse to back Republican funding plan&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;The US government is hurtling towards its first shutdown in six years, with no signs &lt;a href=\"https://www.theguardian.com/us-news/us-congress\"&gt;congressional&lt;/a&gt; leaders are near agreement on legislation to continue funding beyond the Tuesday night deadline to prevent workers from being furloughed and agencies from shutting their doors.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Congress’s &lt;a href=\"https://www.theguardian.com/us-news/republicans\"&gt;Republican&lt;/a&gt; majority is pushing legislation to fund the government through 21 November, but Democrats have refused to vote for it unless it includes a series of concessions centered on healthcare.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "What does a government shutdown mean and why is this year’s threat more serious?",
      "url": "https://www.theguardian.com/us-news/2025/sep/27/government-shutdown-explainer",
      "summary": "&lt;p&gt;The US government has shut down because Congress couldn’t reach a funding agreement. Here’s what to know about what happens next&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates\"&gt;US government shutdown – live updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Much of the federal government officially began to shut down on Wednesday, after &lt;a href=\"https://www.theguardian.com/us-news/us-congress\"&gt;Congress&lt;/a&gt; failed to reach a funding agreement before the midnight deadline. The shutdown will have a wide range of effects on government services and potentially the US economy.&lt;/p&gt;&lt;p&gt;Republicans put forward a stopgap measure to keep agencies open through 21 November, but Democrats have withheld their support, demanding the bill address &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/30/government-shutdown-healthcare-medicaid\"&gt;recent Medicaid cuts and extend health insurance subsidies&lt;/a&gt; under the Affordable Care Act scheduled to expire at the end of the year. Republican leaders dismissed their demands as a non-starter and united to block Democrats’s short-term funding proposal.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/27/government-shutdown-explainer\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}