{
  "updatedAt": "2025-11-07T12:54:51.253Z",
  "items": [
    {
      "title": "Here’s the latest on the flight reductions.",
      "url": "https://www.nytimes.com/live/2025/11/07/us/shutdown-airports-flight-cuts/heres-the-latest-on-the-flight-reductions",
      "summary": ""
    },
    {
      "title": "How Families Are Coping with SNAP Cuts During the Shutdown",
      "url": "https://www.nytimes.com/2025/11/07/us/politics/snap-benefits-cuts-shutdown.html",
      "summary": "For the 42 million people who rely on the country’s largest anti-hunger program, it has been a chaotic, nerve-racking week. Here are some of their stories."
    },
    {
      "title": "As Idaho Grows Ever Redder, Boise Worries About Its Isolation",
      "url": "https://www.nytimes.com/2025/11/07/us/politics/boise-idaho-trump-conservatism.html",
      "summary": "Two city councilors won re-election on Tuesday, though their support for a pride flag at City Hall had sparked challenges from the right. Still, Idaho’s deep embrace of President Trump has the city worried."
    },
    {
      "title": "The Decline of America’s Largest Environmental Organization",
      "url": "https://www.nytimes.com/video/us/100000010489108/the-decline-of-americas-largest-environmental-organization.html",
      "summary": "David A. Fahrenthold, an investigative reporter, describes the struggles of the Sierra Club, one of the largest environmental groups in the U.S. The group has lost about 60 percent of its supporters since 2020."
    },
    {
      "title": "They Can’t Stand Trump. But His I.V.F. Policy Might Help Them Have Children.",
      "url": "https://www.nytimes.com/2025/11/07/us/politics/trump-ivf-women-pregnancy.html",
      "summary": "Even those opposed to President Trump were encouraged by his announcement of a discount on I.V.F. drugs, a policy that followed months of complex negotiations."
    },
    {
      "title": "The Sierra Club Embraced Social Justice. Then It Tore Itself Apart.",
      "url": "https://www.nytimes.com/2025/11/07/us/politics/sierra-club-social-justice.html",
      "summary": "The environmental group gave up its singular focus on climate change for a broader agenda. The ensuing internal strife left it weakened as it takes on the Trump administration."
    },
    {
      "title": "Flight cancellations take effect amid government shutdown – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Airlines had already started cutting services ahead of today’s 6am ET directive to reduce traffic at 40 major airports&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Russia urged the United States on Friday to clarify what it called contradictory signals about a resumption of nuclear testing, saying such a step would trigger responses from Russia and other countries.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;President Donald Trump last week ordered the US military to immediately restart the process for testing nuclear weapons, Reuters reported. But he did not make clear if he meant flight-testing of nuclear-capable missiles or a resumption of tests involving nuclear explosions - something neither the US nor Russia has done for more than three decades.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "‘We’re sick of the OnlyFans model’: Stella Barey’s porn site lets gen Z sex workers have a life",
      "url": "https://www.theguardian.com/us-news/ng-interactive/2025/nov/07/stella-barey-hidden-porn-creators-onlyfans",
      "summary": "&lt;p&gt;The 28-year-old’s platform, Hidden, offers a Tumblr-like sensibility in an industry roiled by slop and lets adult content creators earn without burning out&lt;/p&gt;&lt;p&gt;Stella Barey has an hour for lunch. At 1.30pm, she loads her banged-up Tacoma with her three Belgian malinois and drives to a secret Los Angeles hiking trail. There, she gulps down a tapioca pudding and laces up her sneakers. After checking over her shoulder for foot traffic, she pulls down her brown sweatpants and jiggles her bare ass for the camera. Then come the undies."
    }
  ]
}