{
  "updatedAt": "2025-11-16T12:50:01.700Z",
  "items": [
    {
      "title": "Homeland Security Department Shifts Its Focus to Immigration Crackdown",
      "url": "https://www.nytimes.com/2025/11/16/us/politics/dhs-agents-reassigned.html",
      "summary": "The Department of Homeland Security was established to keep Americans safe. Under President Trump, it has so shifted its focus to illegal immigration that other aspects of its mission are suffering."
    },
    {
      "title": "How to Make Sense of Law Enforcement in the Streets",
      "url": "https://www.nytimes.com/video/us/politics/100000010484295/how-to-make-sense-of-law-enforcement-in-the-streets.html",
      "summary": "The variety of federal forces deployed to support President Trump’s mass deportation campaign and anticrime efforts continues to expand. Often, it can be difficult for the public to tell them apart, or to understand what powers each agency has."
    },
    {
      "title": "4 Dead After Suspected Migrant Boat Overturns Near a San Diego Area Beach",
      "url": "https://www.nytimes.com/2025/11/15/us/panga-boat-capsizes-imperial-beach.html",
      "summary": "The boat capsized off the coast, officials said. Four people were taken to a hospital and one person was taken into custody."
    },
    {
      "title": "U.S. Border Patrol Launches Operation in Charlotte, N.C.",
      "url": "https://www.nytimes.com/2025/11/15/us/us-border-patrol-charlotte-nc-immigration.html",
      "summary": "It is unclear how long the operation will last in North Carolina’s largest city, which has a growing immigrant population."
    },
    {
      "title": "Fetterman Is Released From the Hospital After a Fall",
      "url": "https://www.nytimes.com/2025/11/15/us/john-fetterman-fall-hospital-released.html",
      "summary": "The Pennsylvania senator was hospitalized on Thursday after he fell during a morning walk near his home in Braddock, Pa. He required 20 stitches."
    },
    {
      "title": "Man Who Stuffed Parakeets in His Pants Faces Smuggling Charge",
      "url": "https://www.nytimes.com/2025/11/15/us/parakeets-smuggling-in-pants.html",
      "summary": "The man was found with the heavily sedated birds in his underwear as he crossed the border from Mexico in late October, federal prosecutors said."
    },
    {
      "title": "Scrutiny grows over LA fire origins after bombshell report: ‘Our Pearl Harbor moment’",
      "url": "https://www.theguardian.com/us-news/2025/nov/16/la-fire-palisades-report",
      "summary": "&lt;p&gt;Reports that fire crews were ordered to leave original site of blaze prompt tough questions for city and LAFD leaders&lt;/p&gt;&lt;p&gt;Concerns over a small brush fire that reignited days later into the mammoth Palisades fire – the&lt;a href=\"https://www.wildfirela.org/history/\"&gt; most destructive&lt;/a&gt; in Los Angeles history – have grown in recent weeks amid reports that firefighters were ordered to leave the original site of the smaller blaze despite their concerns the ground was still smoldering.&lt;/p&gt;&lt;p&gt;Now, questions remain about how leaders at the Los Angeles fire department responded to a fire that&lt;a href=\"https://www.theguardian.com/us-news/2025/jan/09/california-wildfires-pacific-palisades-los-angeles\"&gt; leveled entire communities&lt;/a&gt;, and who within the agency knew about concerns the fire could still pose a threat. A former LA city councilor says the aftermath and recovery effort should serve as a Pearl Harbor moment for the city, which should never again be in a position with flames encroaching on all sides.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/16/la-fire-palisades-report\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "It’s all gravy: Thanksgiving air traffic to be normal after US government reopens",
      "url": "https://www.theguardian.com/us-news/2025/nov/16/thanksgiving-air-travel-us-government-reopen",
      "summary": "&lt;p&gt;Experts say air traffic controllers quickly returning to work, with promise of full back pay, and even $10,000 bonus&lt;/p&gt;&lt;p&gt;Fears that it would take weeks or even months for flight schedules in the US to return to normal in the wake of the US federal government shutdown do not appear to be coming true and the busy upcoming holiday season should be normal for travel, experts say.&lt;/p&gt;&lt;p&gt;That is at least in part because air traffic controllers are quickly returning to work, according to the Department of Transportation.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/16/thanksgiving-air-travel-us-government-reopen\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}