{
  "updatedAt": "2025-09-13T13:09:45.134Z",
  "items": [
    {
      "title": "The Police Found Messages After Kirk’s Killing. What They Mean Is Unclear.",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/tyler-robinson-messages-bullets-charlie-kirk.html",
      "summary": "The messages relied on an enigmatic, coded communication style used by the habitually online."
    },
    {
      "title": "Kirk Assassination Puts America’s Political Spotlight on Campuses Again",
      "url": "https://www.nytimes.com/2025/09/13/us/charlie-kirk-college-campuses-american-political-battles.html",
      "summary": "Colleges are often the setting, and the target, of the nation’s most heated politics. Charlie Kirk’s work on campuses was one factor."
    },
    {
      "title": "NPR and PBS Must Transform After Trump’s Cuts Cripple Broadcasters",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/public-broadcasting-cuts.html",
      "summary": "Radio and television stations, facing enormous budget holes, are pleading with NPR and PBS to lower their fees as they examine whether to drop national programming altogether."
    },
    {
      "title": "U.C. Berkeley Gives Names of Students and Faculty to Government for Antisemitism Probe",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/trump-berkeley-antisemitism-investigation.html",
      "summary": "The University of California, Berkeley, told around 160 people that their names were in documents related to antisemitism complaints that were demanded by the Trump administration."
    },
    {
      "title": "Lawsuit Accuses Trump Officials of More Wrongful Deportations",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/trump-lawsuit-wrongful-deportations-ghana.html",
      "summary": "Plaintiffs accused the Trump administration of using so-called third-country deportations to violate court-ordered protections for migrants, echoing the case of Kilmar Armando Abrego Garcia."
    },
    {
      "title": "California’s $23 Billion Plan to Restore Federal Cuts to Scientific Research",
      "url": "https://www.nytimes.com/2025/09/13/us/california-scientific-research-bond.html",
      "summary": "Democrats are calling for the creation of a state equivalent of the National Institutes of Health, but first state lawmakers and then voters would need to approve it."
    },
    {
      "title": "How Charlie Kirk turned campuses into cultural battlefields – and ushered in Trump’s assault on universities",
      "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-campus-culture-wars",
      "summary": "&lt;p&gt;The slain head of Turning Point USA stoked campus culture wars and ‘treated faculty and students as enemies’’&lt;/p&gt;&lt;p&gt;Charlie Kirk, the far-right activist &lt;a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"&gt;killed this week&lt;/a&gt; while speaking at a campus event at Utah Valley University, never graduated from the community college he briefly attended. But his lack of a degree didn’t stop him from assuming a defining role in the ongoing transformation of US higher education.&lt;/p&gt;&lt;p&gt;Kirk pioneered a style of ideological warfare against what he viewed as bastions of leftism, helping turn campuses into cultural battlefields and paving the way for &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt;’s unprecedented campaign to weaken American universities and subject them to his movement’s ideological agenda.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-campus-culture-wars\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Assassination in Utah, school shooting in Colorado: one day in US gun violence",
      "url": "https://www.theguardian.com/us-news/2025/sep/13/gun-violence-charlie-kirk-colorado-school-shooting",
      "summary": "&lt;p&gt;Reaction to the shocking killing of Charlie Kirk has largely overlooked the obvious: the country is awash with guns and people prepared to use them on fellow Americans&lt;/p&gt;&lt;p&gt;At 12.23pm on Wednesday, as the rightwing influencer and provocateur &lt;a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"&gt;Charlie Kirk&lt;/a&gt; was addressing a large crowd at Utah Valley University, a single shot rang out. He was struck fatally by a bullet in the neck, sending thousands of screaming students scattering in all directions and propelling the country into a new and dangerous crisis.&lt;/p&gt;&lt;p&gt;Exactly one minute later, &lt;a href=\"https://www.denverpost.com/2025/09/11/evergreen-high-school-shooting-colorado-updates/\"&gt;at 12.24pm&lt;/a&gt;, about 450 miles to the east in Colorado, a 911 call came in to first responders in the mountain town of Evergreen. A 16-year-old student had opened fire with a revolver on high school grounds, critically injuring two fellow students before turning the handgun on himself.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/13/gun-violence-charlie-kirk-colorado-school-shooting\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}