{
  "updatedAt": "2025-11-03T18:35:24.335Z",
  "items": [
    {
      "title": "In ’60 Minutes’ Interview, Trump Says He Doesn’t Know Binance Billionaire He Pardoned",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/trump-60-minutes-interview-binance-cz-pardon.html",
      "summary": "Changpeng Zhao had admitted to violations that allowed criminals to move money on the cryptocurrency exchange he founded, which struck a lucrative deal involving the Trump family’s own venture."
    },
    {
      "title": "Jack Smith, Trump’s Target, Moves From Defense to Counterattack",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/jack-smith-trump-investigations.html",
      "summary": "The former special counsel has told people in his orbit he welcomes the opportunity to present the public case against the president denied to him by adverse court rulings and the 2024 election."
    },
    {
      "title": "Trial Begins for D.C. Man Accused of Throwing a Sandwich at a Federal Agent",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/dc-sandwich-guy-trial.html",
      "summary": "Jury selection started on Monday for Sean C. Dunn, who was charged with misdemeanor assault after hitting a federal agent with a “sub-style sandwich.”"
    },
    {
      "title": "Trump Administration to Send Only Partial Food Stamp Payments This Month",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/snap-food-stamps-trump.html",
      "summary": "The government said it would send the aid after a court ruled last week that it must preserve the program known as SNAP during the shutdown."
    },
    {
      "title": "Ford Foundation Leader Vows to Protect Elections and Law as Trump Threatens Crackdown",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/ford-foundation-heather-gerken-trump.html",
      "summary": "Heather K. Gerken, a voting rights scholar and former dean of Yale Law School, plans to intensify its emphasis on democracy as it girds for attacks from the Trump administration."
    },
    {
      "title": "In Redistricting Battles, Here’s How Trump, Republicans and Democrats Are Faring",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/midterm-elections-redistricting-trump.html",
      "summary": "President Trump is imploring lawmakers to redraw their congressional maps to stave off Democratic control of the House. But the debate over redistricting has revealed fissures within both parties."
    },
    {
      "title": "Trump administration says it will partially fund Snap food aid benefits– live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
      "summary": "&lt;p&gt;Trump administration says in court filing it plans to use emergency funds to partially cover November Snap benefits for millions of Americans&lt;/p&gt;&lt;p&gt;Looking ahead, on Wednesday, &lt;strong&gt;the supreme court will hear arguments on whether Donald Trump’s sweeping tariffs on dozens of countries are legal.&lt;/strong&gt; It’s set to be one of the most consequential rulings on the expanse of Trump’s presidential power in his second term.&lt;/p&gt;&lt;p&gt;My colleague, &lt;strong&gt;Eduardo Porter&lt;/strong&gt;, has this helpful breakdown on the question at the heart of this case. A dozen states have challenged the president’s contention that the International Emergency Economic Powers Act (IEEPA) of 1977 gives him the power to impose tariffs on imports from every country in the world to defend the nation from a several “threats” facing the US.&lt;/p&gt;&lt;p&gt;Justices will focus much of their attention on whether IEEPA authorizes the president to &lt;a href=\"https://ag.ny.gov/sites/default/files/court-filings/state-of-oregon-et-al-v-donald-j-trump-united-states-department-of-homeland-security-et-al-complaint-2025.pdf\"&gt;levy a tariff&lt;/a&gt; – a word that is not mentioned in the text of the law and is, moreover, a form of taxation, over which, per the constitution, Congress has exclusive power.&lt;/p&gt;&lt;p&gt;IEEPA &lt;a href=\"https://www.law.cornell.edu/uscode/text/50/1701\"&gt;gives the president&lt;/a&gt; authority “to deal with any unusual and extraordinary threat, which has its source in whole or substantial part outside the United States, to the national security, foreign policy, or economy of the United States, if the president declares a national emergency with respect to such threat”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump administration will provide half of usual funds to Snap recipients in November",
      "url": "https://www.theguardian.com/us-news/2025/nov/03/trump-partially-fund-food-stamps-snap",
      "summary": "&lt;p&gt;Contingency funds will keep benefits going for nearly 42 million people in the food assistance program, Trump says&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news\"&gt;US politics live – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; said it would provide partial relief to recipients of food stamps on Monday as the federal government shutdown approached a record-breaking length.&lt;/p&gt;&lt;p&gt;Amid mounting uncertainty among the nearly 42 million people on the Supplemental Nutrition Assistance Program (Snap), the Department of Agriculture said it would use contingency funds to keep benefits going, albeit just 50% of the usual funds recipients receive on their cards.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/03/trump-partially-fund-food-stamps-snap\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}