{
  "updatedAt": "2025-10-09T06:38:14.751Z",
  "items": [
    {
      "title": "Who is Jonathan Rinderknecht? What We Know About The Palisades Fire Arrest",
      "url": "https://www.nytimes.com/2025/10/08/us/palisades-fire-arrest-jonathan-rinderknecht.html",
      "summary": "Federal officials arrested a man they said started a small blaze in January that later rekindled and grew into the fire that devastated Pacific Palisades."
    },
    {
      "title": "Katie Porter Goes Viral for ‘Unhappy’ TV Interview in California Governor’s Race",
      "url": "https://www.nytimes.com/2025/10/08/us/katie-porter-goes-viral-for-unhappy-tv-interview-in-california-governors-race.html",
      "summary": "The former Democratic congresswoman, known for her own grilling of executives on Capitol Hill, threatened to abandon an interview after she was asked several follow-up questions."
    },
    {
      "title": "A Stolen Dinosaur Named Claire Is Returned to a California Gas Station",
      "url": "https://www.nytimes.com/2025/10/08/us/dinosaur-stolen-california-gas-station.html",
      "summary": "The theft of the beloved dinosaur statue upset residents of a California community that was damaged by wildfires earlier this year. Then she was returned with an apology."
    },
    {
      "title": "G.O.P. Blocks Bid to Halt Trump’s Attacks in the Caribbean Sea",
      "url": "https://www.nytimes.com/2025/10/08/us/politics/trump-republicans-war-powers-caribbean-venezuela.html",
      "summary": "Republicans in the Senate blocked a measure that would terminate the president’s legally disputed campaign targeting alleged drug runners."
    },
    {
      "title": "Pope Leo Urges U.S. Bishops to Support Immigrants as Trump Escalates Deportations",
      "url": "https://www.nytimes.com/2025/10/08/us/pope-leo-immigration-trump.html",
      "summary": "The pope conveyed the message as President Trump escalated his deportation campaign, including in Chicago, the pope’s hometown."
    },
    {
      "title": "Kash Patel Fires Two F.B.I. Agents Who Worked on Trump Investigation",
      "url": "https://www.nytimes.com/2025/10/08/us/politics/kash-patel-fbi-agents.html",
      "summary": "The agents were identified in documents obtained by a Republican senator as having worked with Jack Smith, the special counsel who led the federal inquiries into Donald J. Trump."
    },
    {
      "title": "‘A fatal blow’: Italian producers fear effects of Trump’s ‘war against pasta’",
      "url": "https://www.theguardian.com/us-news/2025/oct/09/a-fatal-blow-italian-producers-fear-effects-of-trumps-war-against-pasta",
      "summary": "&lt;p&gt;US president’s threat to impose 92% tariffs targeting major manufacturers put family-run firms in the firing line as well&lt;/p&gt;&lt;p&gt;“It’s a real pity,” laments Antonio Rummo of Donald Trump’s latest target in his ever-evolving tariff war: Italian pasta. Rummo is the sixth-generation grandson of the founder of Pasta Rummo, who opened a wheat mill in Benevento in southern Italy in 1846, using the family’s three horses to lug grain from the surrounding Campania region and Puglia to produce fresh pasta.&lt;/p&gt;&lt;p&gt;“Demand for premium pasta in the US has been growing,” says Rummo. Appreciated by consumers for a traditional processing method that guarantees it will cook to &lt;em&gt;al dente&lt;/em&gt; perfection, sales of Pasta Rummo have been thriving.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/09/a-fatal-blow-italian-producers-fear-effects-of-trumps-war-against-pasta\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: a note, a whisper and the first phase of a Gaza ceasefire deal",
      "url": "https://www.theguardian.com/us-news/2025/oct/09/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;Trump announces ‘first steps’ to ‘durable peace’; Kristi Noem compares Antifa to MS-13. Key US politics stories from 8 October at a glance&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous\"&gt;Follow the latest updates live&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;It started with a whisper. Marco Rubio interrupted Donald Trump’s roundtable event with conservative influencers discussing antifa, speaking quietly into Trump’s ear. &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/08/marco-rubio-trump-note-gaza-peace-deal\"&gt;Rubio handed the president a note&lt;/a&gt;, which read “Very close. We need you to approve a Truth Social post soon so you can announce deal first.”&lt;/p&gt;&lt;p&gt;Soon afterwards Trump posted to Truth Social that the “first phase” of a peace plan to pause fighting and release some hostages and prisoners held in Gaza had been agreed by Israel and Hamas, bringing the best hope yet of a definitive end to a bloody two-year conflict.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/09/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}