{
  "updatedAt": "2025-12-01T06:45:32.489Z",
  "items": [
    {
      "title": "College Student Is Deported During Trip Home for Thanksgiving",
      "url": "https://www.nytimes.com/2025/11/30/us/politics/college-student-deported-thanksgiving-texas.html",
      "summary": "Any Lucia López Belloza, 19, was detained by immigration agents at the Boston airport before a flight to surprise her family in Texas for Thanksgiving. She is now in Honduras."
    },
    {
      "title": "Lawmakers Suggest Follow-Up Boat Strike Could Be a War Crime",
      "url": "https://www.nytimes.com/2025/11/30/us/politics/trump-boat-strikes-war-crime.html",
      "summary": "Top Republicans have joined Democrats in demanding answers about the escalating military campaign the Trump administration says is aimed at targeting drug traffickers."
    },
    {
      "title": "Rubio Says ‘Much Work’ to Be Done After Talks With Ukrainian Officials",
      "url": "https://www.nytimes.com/2025/11/30/us/politics/ukraine-yermak-rubio-russia.html",
      "summary": "Secretary of State Marco Rubio and other U.S. officials met with a Ukrainian delegation that was without Andriy Yermak, who resigned as chief of staff to Ukraine’s president on Friday."
    },
    {
      "title": "The Political Price Shock of Data Centers and Electric Bills",
      "url": "https://www.nytimes.com/2025/11/30/us/politics/data-centers-electric-bills-georgia.html",
      "summary": "Democrats zeroed in on utilities and affordability to win Republican support in upset elections in Georgia and Virginia. Can the same playbook work in 2026?"
    },
    {
      "title": "Remembering WW2 Camps, Japanese Americans Fight Trump’s Immigration Crackdown",
      "url": "https://www.nytimes.com/2025/11/30/us/japanese-internment-camp-trump-immigration.html",
      "summary": "Japanese Americans are seeing parallels between the government’s incarceration of their families during World War II and the current detention of Latinos."
    },
    {
      "title": "4 Dead, Including 3 Children, After Shooting at Birthday Party in California",
      "url": "https://www.nytimes.com/2025/11/29/us/shooting-stockton-california.html",
      "summary": "The shooting in Stockton, a city in California’s Central Valley, left 11 others wounded. The authorities said they were looking for a suspect."
    },
    {
      "title": "Trump news at a glance: president says freeze on asylum decisions will last ’a long time’",
      "url": "https://www.theguardian.com/us-news/2025/dec/01/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;Response to national guard shooting has ‘no time limit’; gutting of DHS watchdog could pave way for abuse – key US politics stories from 30 November at a glance&lt;/p&gt;&lt;p&gt;US President Donald Trump has said his administration intends to maintain a &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/29/us-halts-all-asylum-decisions-after-national-guard-shooting\"&gt;pause on asylum decisions&lt;/a&gt; for “a long time”, after an Afghan national &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/26/national-guard-soldiers-shot-washington-dc\"&gt;allegedly shot two National Guard members&lt;/a&gt; near the White House, killing one of them.&lt;/p&gt;&lt;p&gt;When asked to specify how long it would last, Trump said he had “no time limit” in mind for the measure, which the Department of Homeland Security says is linked to a list of 19 countries already facing US travel restrictions.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/01/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump confirms he recently spoke with Venezuela’s Nicolás Maduro",
      "url": "https://www.theguardian.com/us-news/2025/nov/30/trump-nicolas-maduro-venezuela-call",
      "summary": "&lt;p&gt;Trump remained tight-lipped on details of call with Venezuelan president as tensions rise between countries&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; confirmed on Sunday that he had spoken with &lt;a href=\"https://www.theguardian.com/world/venezuela\"&gt;Venezuelan&lt;/a&gt; president &lt;a href=\"https://www.theguardian.com/world/nicolas-maduro\"&gt;Nicolás Maduro&lt;/a&gt;, but he did not provide details on what the two leaders discussed.&lt;/p&gt;&lt;p&gt;“I don’t want to comment on it. The answer is yes,” the US president said when asked if he had spoken with Maduro. He was speaking to reporters onboard Air Force One.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/30/trump-nicolas-maduro-venezuela-call\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}