{
  "updatedAt": "2025-10-02T18:35:43.572Z",
  "items": [
    {
      "title": "Immigration Judge Rejects Abrego Garcia’s Efforts to Seek Asylum in U.S.",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/abrego-garcia-asylum.html",
      "summary": "The decision foreclosed one of the options that lawyers for Kilmar Armando Abrego Garcia had tried in an effort to keep him in the country."
    },
    {
      "title": "Trump ‘Determined’ the U.S. Is Now in a War With Drug Cartels, Congress Is Told",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/trump-drug-cartels-war.html",
      "summary": "A notice calls the people the U.S. military recently killed on suspicion of drug smuggling in the Caribbean Sea “unlawful combatants.”"
    },
    {
      "title": "Democrats Pull Away From AIPAC, Reflecting a Broader Shift",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/democrats-aipac.html",
      "summary": "A quiet retreat by Democrats from the pre-eminent pro-Israel lobbying group is the latest evidence of a realignment underway in Congress on Israel."
    },
    {
      "title": "Ann Fagan Ginger, Venerable Defender of Civil Liberties, Dies at 100",
      "url": "https://www.nytimes.com/2025/10/02/us/ann-fagan-ginger-dead.html",
      "summary": "She was among the last of a generation of activists and lawyers who weathered the Red Scare, and then helped train a new cohort in the decades that followed."
    },
    {
      "title": "Here Are the Dueling Plans Behind the Shutdown Impasse",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/government-shutdown-spending-bill-impasse.html",
      "summary": "Republicans are proposing a straight extension of government spending, while Democrats are demanding the addition of over $1 trillion for health programs."
    },
    {
      "title": "Heading to L.A. for the Olympics? If You’re Into These Sports, You’re in the Wrong State.",
      "url": "https://www.nytimes.com/2025/10/02/us/los-angeles-olympics-oklahoma-city.html",
      "summary": "Much of the Summer Games in 2028 will take place in Southern California. But two events, softball and canoe slalom, will be held in Oklahoma."
    },
    {
      "title": "Trump declares that drug cartels operating in the Caribbean are ‘unlawful combatants’",
      "url": "https://www.theguardian.com/us-news/2025/oct/02/trump-administration-caribbean-drug-cartels",
      "summary": "&lt;p&gt;President also said the US is now in a ‘non-international conflict’, according to a White House memo&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; has declared that drug cartels operating in the Caribbean are “unlawful combatants” and says the United States is now in a “non-international armed conflict”, according to a White House memo obtained by the Associated Press on Thursday.&lt;/p&gt;&lt;p&gt;A US official familiar with the matter who was not authorized to comment publicly told the AP that Congress was notified about the designation by Pentagon officials on Wednesday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/02/trump-administration-caribbean-drug-cartels\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US government shutdown: federal layoffs ‘likely to be in the thousands’, says White House – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
      "summary": "&lt;p&gt;Karoline Leavitt blames Democrats for looming job losses and says Trump administration expects thousands to be furloughed&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/02/government-shutdown-regular-people-effect\"&gt;Here’s what the shutdown means for travel, national parks and housing&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/02/us-government-shutdown-callout\"&gt;Share your views on the US government shutdown&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Karoline Leavitt&lt;/strong&gt; also spoke on Fox News this morning, where she was asked whether Donald Trump’s threats of cuts were just a negotiating tactic. “Oh, &lt;strong&gt;it’s very real&lt;/strong&gt;,” she replied.&lt;/p&gt;&lt;p&gt;“The Democrats should know that they put the White House and the president in this position,” she went on. “And if they don’t want further harm on their constituents back home, then they need to reopen the government. &lt;strong&gt;It’s very simple. Pass the clean continuing resolution and all of this goes away&lt;/strong&gt;.&lt;/p&gt;&lt;p&gt;Look, it’s likely going to be in the thousands."
    }
  ]
}