{
  "updatedAt": "2025-11-13T12:57:58.017Z",
  "items": [
    {
      "title": "Some South Korean Workers Return to Georgia Factory After U.S. Reissues Visas",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/south-korea-workers-factory-return-georgia.html",
      "summary": "The State Department has reissued visas for many workers detained in a September raid, lawyers said, as the Trump administration tries to undo damage from the operation."
    },
    {
      "title": "What’s Behind the Coming House Vote on Releasing the Epstein Files",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/house-vote-epstein-files.html",
      "summary": "Proponents of fuller transparency used an arcane rule to prod their leaders to act. When it became clear they had succeeded, the speaker agreed to hold a vote."
    },
    {
      "title": "Canadian Travel to the United States Falls for 10th Consecutive Month",
      "url": "https://www.nytimes.com/2025/11/13/us/canada-us-travel-decline-flights.html",
      "summary": "The drop has been reflected in air and car travel, according to Canadian statistics. Tensions over tariffs placed by the Trump administration spurred calls for Canadians to spend their money at home."
    },
    {
      "title": "In Explaining His Gaffe, Heritage Foundation Leader Pleads Ignorance",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/in-explaining-his-gaffe-heritage-foundation-leader-pleads-ignorance.html",
      "summary": "Kevin Roberts, under fire for defending Tucker Carlson’s interview with a white nationalist, said that he did not keep up with the news and that he had simply read an aide’s script."
    },
    {
      "title": "How D.C. Area Businesses Aided Furloughed Workers, One Gesture at a Time",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/furloughed-workers-support.html",
      "summary": "The region was already unsettled by sweeping government layoffs and funding cuts when the shutdown started."
    },
    {
      "title": "Comey and James Challenge Appointment of Trump Loyalist Overseeing Their Prosecutions",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/lindsey-halligan-trump-attorney-court-challenge.html",
      "summary": "The outcome could have serious consequences for the cases against two of President Trump’s opponents, James B. Comey, the former F.B.I. director, and Letitia James, the New York attorney general."
    },
    {
      "title": "US government reopens after longest-ever shutdown; House to vote on Epstein files next week – live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/13/donald-trump-jeffrey-epstein-files-us-government-shutdown-latest-news-updates",
      "summary": "&lt;p&gt;Federal workers told to return to office after shutdown ends; House speaker Mike Johnson, who opposes the Epstein bill, vows to hold full vote next week&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/12/house-bill-government-shutdown-vote\"&gt;Trump signs funding bill to end longest US government shutdown&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/13/jeffrey-epstein-emails-trump\"&gt;Newly released emails reveal Epstein kept close eye on Trump&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Democrats appear more enthusiastic than Republicans about voting in next year’s congressional elections following the party’s victories in recent state and local contests, according to a new Reuters/Ipsos poll, which showed Republican President Donald Trump’s approval steady at 40%.&lt;/p&gt;&lt;p&gt;The six-day poll, which closed on Wednesday, showed 44% of registered voters who called themselves Democrats said they were “very enthusiastic” about voting in the November 3, 2026, elections, compared with 26% of Republicans who said the same. Some 79% of Democrats said they would regret it if they didn’t vote in the election, compared to 68% of Republicans.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/13/donald-trump-jeffrey-epstein-files-us-government-shutdown-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Lies, damned lies and AI: the newest way to influence elections may be here to stay",
      "url": "https://www.theguardian.com/us-news/2025/nov/13/ai-campaign-videos-elections",
      "summary": "&lt;p&gt;The use of AI-generated campaign videos – labeled or unlabeled – are likely to permeate future US elections&lt;/p&gt;&lt;p&gt;The &lt;a href=\"https://www.theguardian.com/us-news/new-york\"&gt;New York City&lt;/a&gt; mayoral election may be remembered for the remarkable win of a young democratic socialist, but it was also marked by something that is likely to permeate future elections: the use of AI-generated campaign videos.&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/andrew-cuomo\"&gt;Andrew Cuomo&lt;/a&gt;, who lost to &lt;a href=\"https://www.theguardian.com/us-news/zohran-mamdani\"&gt;Zohran Mamdani&lt;/a&gt; in last week’s election, took particular interest in sharing deepfake videos of his opponent, including one that saw the former governor accused of racism, in what is a developing area of electioneering.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/13/ai-campaign-videos-elections\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}