{
  "updatedAt": "2025-10-11T12:46:50.853Z",
  "items": [
    {
      "title": "What We Know About the Explosion in Central Tennessee",
      "url": "https://www.nytimes.com/2025/10/11/us/tennessee-plant-explosion-what-we-know.html",
      "summary": "The blast happened at a plant owned by Accurate Energetic Systems. Officials did not specify a death toll but said 18 people were missing."
    },
    {
      "title": "Some Americans Are Starting to Feel the Impact of the Government Shutdown",
      "url": "https://www.nytimes.com/2025/10/11/us/politics/government-shutdown-effects.html",
      "summary": "The Trump administration said over 4,000 workers would be laid off. Farmers trying to plan next year’s crops don’t have all the tools they need. Some medical services have been curtailed in Native communities."
    },
    {
      "title": "West Virginia’s School Vaccination Law Has Been Effective. That May Change.",
      "url": "https://www.nytimes.com/2025/10/11/us/west-virginia-school-vaccines.html",
      "summary": "The law allows only medical exemptions, and the state has one of the highest childhood vaccination rates. But hundreds of families are seeking religious exemptions."
    },
    {
      "title": "How the Government Shutdown Will Be Felt",
      "url": "https://www.nytimes.com/video/us/politics/100000010447931/how-the-government-shutdown-will-be-felt.html",
      "summary": "The effects of a shutdown tend to unfold in stages. As agencies, departments and federal employees figure out how to weather the storm, Karoun Demirjian, a Times reporter, explains what to know."
    },
    {
      "title": "Trump’s Shutdown Layoffs Deepen Impasse, Angering Democrats",
      "url": "https://www.nytimes.com/2025/10/11/us/politics/trump-government-shutdown-layoffs-democrats.html",
      "summary": "The president’s move to fire federal workers and his threats to make others go without pay were aimed at pressuring Democrats to cut a deal to reopen the government. The tactics have fueled Democrats’ resolve."
    },
    {
      "title": "Federal Judges, Warning of ‘Judicial Crisis,’ Fault Supreme Court’s Emergency Orders",
      "url": "https://www.nytimes.com/2025/10/11/us/politics/judicial-crisis-supreme-court-trump.html",
      "summary": "Dozens of sitting judges shared with The Times their concerns about risks to the courts’ legitimacy as the Supreme Court releases opaque orders about Trump administration policies."
    },
    {
      "title": "‘Page one of the authoritarian playbook’: how Trump and allies are exploiting Kirk’s killing",
      "url": "https://www.theguardian.com/us-news/2025/oct/11/charlie-kirk-trump-maga-allies",
      "summary": "&lt;p&gt;The president and his Maga allies have used the rightwing influencer’s killing to justify attacks on critics, experts say&lt;/p&gt;&lt;p&gt;Donald Trump and Maga allies have capitalized on the killing of rightwing influencer Charlie Kirk to expand attacks on liberal groups, donors, Democrats, and others by tarring many critics as the “enemy within” and “radical left” in a move that legal scholars and historians call authoritarian and anti-democratic.&lt;/p&gt;&lt;p&gt;Kirk’s killing by a lone gunman spurred Trump and top allies to quickly launch conspiratorial charges against a bevy of political foes and an investigation of billionaire liberal donor George Soros. They also threatened legal action against TV network ABC after their late-night star Jimmy Kimmel’s suspension over clumsy comments about Kirk ended.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/11/charlie-kirk-trump-maga-allies\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "The quiet toll of Trump’s legal immigration crackdown: ‘I’m trying to stay afloat’",
      "url": "https://www.theguardian.com/us-news/2025/oct/11/trump-legal-immigration-crackdown",
      "summary": "&lt;p&gt;Immigration lawyer Kim Xavier says stricter enforcement and delays are leaving even legal immigrants in limbo and fear&lt;/p&gt;&lt;p&gt;Kim Xavier, a senior associate at CoveyLaw, an immigration law firm based in &lt;a href=\"https://www.theguardian.com/us-news/new-york\"&gt;New York&lt;/a&gt;, has spent much of the last year bracing herself for any Friday announcements that might affect her clients.&lt;/p&gt;&lt;p&gt;So when &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; announced on a recent Friday that he will impose a&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/19/trump-h1b-visa-100000-fee\"&gt; $100,000 fee&lt;/a&gt; on H-1B visa applications, the timing&lt;strong&gt; &lt;/strong&gt;was not totally surprising.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/11/trump-legal-immigration-crackdown\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}