{
  "updatedAt": "2025-11-18T12:56:52.973Z",
  "items": [
    {
      "title": "House Is Expected to Vote on Tuesday to Release Epstein Files",
      "url": "https://www.nytimes.com/2025/11/18/us/politics/house-vote-epstein-files.html",
      "summary": "Ahead of what was likely to be a unanimous House vote that Republican leaders had toiled to avoid, G.O.P. lawmakers embraced the Epstein transparency bill."
    },
    {
      "title": "House Democrats Press for Vote to Bar Military Action in Venezuela",
      "url": "https://www.nytimes.com/2025/11/18/us/politics/house-democrats-press-for-vote-to-bar-military-action-in-venezuela.html",
      "summary": "The effort would invoke the War Powers Act, which expedites action on measures limiting the president’s war-making authority. It faces long odds in the G.O.P.-led House."
    },
    {
      "title": "Trump Will Host Saudi Crown Prince in Washington",
      "url": "https://www.nytimes.com/2025/11/18/us/politics/trump-saudi-crown-prince.html",
      "summary": "The president is offering the crown prince fighter jets, a nuclear agreement and other deals as part of his efforts to collect investment and push forward on Middle East peace."
    },
    {
      "title": "What to Know About How the Times/KFF Survey of Immigrants Was Conducted",
      "url": "https://www.nytimes.com/2025/11/18/us/immigrants-poll-how-conducted.html",
      "summary": "The survey provides a rare look at the lives and opinions of immigrants of varying backgrounds and legal statuses"
    },
    {
      "title": "Under Trump, Immigrants Are More Fearful but Determined to Stay, Poll Finds",
      "url": "https://www.nytimes.com/2025/11/18/us/immigrants-survey-trump.html",
      "summary": "A national survey found that half of all immigrants in the United States say they feel less safe since President Trump took office. Still, many say their future remains bright."
    },
    {
      "title": "With Trump in Office, a Transgender Trailblazer and American Diplomat Seeks Refuge Abroad",
      "url": "https://www.nytimes.com/2025/11/18/us/robyn-mccutcheon-diplomat-transgender-refuge-trump.html",
      "summary": "Robyn McCutcheon, the first American diplomat to come out as transgender, helped to shape personnel and foreign policy at the State Department. The country she served doesn’t feel like home anymore."
    },
    {
      "title": "First Thing: ‘They have total impunity’ – West Bank settler violence rises after Gaza ceasefire",
      "url": "https://www.theguardian.com/us-news/2025/nov/18/first-thing-west-bank-settler-violence-gaza-ceasefire-israel",
      "summary": "&lt;p&gt;UN logs 260 attacks in October alone, its highest monthly tally. Plus, protests in North Carolina’s Charlotte after aggressive immigration arrests&lt;/p&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;Violence has &lt;a href=\"https://www.theguardian.com/world/2025/nov/18/west-bank-surge-settler-violence-israel-palestine\"&gt;increased across the occupied West Bank&lt;/a&gt; as Palestinian farmers try to harvest their olive trees before the end of the season, in the face of a campaign of harassment by groups of armed and aggressive Israeli settlers.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;How many attacks were there last month?&lt;/strong&gt; The UN logged more than 260 attacks resulting in Palestinian casualties or damage to property in the West Bank in October alone – the highest monthly count since they began monitoring in 2006.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What’s the latest on the Gaza peace plan?&lt;/strong&gt; Yesterday, the UN security council &lt;a href=\"https://www.theguardian.com/world/2025/nov/18/un-security-council-votes-to-endorse-donald-trumps-gaza-plan\"&gt;endorsed proposals&lt;/a&gt; put forward by Donald Trump for a lasting peace in Gaza, including the deployment of an international stabilization force and a possible path to a sovereign Palestinian state. China and Russia abstained.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/18/first-thing-west-bank-settler-violence-gaza-ceasefire-israel\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "House of Representatives to vote on release of Epstein files after Trump U-turn – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/18/house-vote-jeffrey-epstein-files-donald-trump-republicans-democrats-us-politics-live-news",
      "summary": "&lt;p&gt;Move comes after Donald Trump dropped his opposition to a vote on releasing files on the late convicted sex offender Jeffrey Epstein&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/18/house-vote-epstein-documents\"&gt;Full report: House set to vote on release of Epstein documents&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/18/epstein-files-release-vote\"&gt;Explainer: what to know about the US House vote&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/jul/24/what-are-jeffrey-epstein-documents-trump\"&gt;Explainer: What are the Epstein files?&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The other big event for Trump today is the official visit of Saudi Arabia’s de facto leader Crown Prince Mohammed bin Salman, who has been welcomed back at the White House for the first time since the 2018 killing of Washington Post journalist Jamal Khashoggi by Saudi agents.&lt;/p&gt;&lt;p&gt;US-Saudi relations deteriorated after Khashoggi’s brutal killing. He had been a fierce critic of the kingdom; US intelligence concluded that bin Salman had most likely ordered state agents to kill him.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/18/house-vote-jeffrey-epstein-files-donald-trump-republicans-democrats-us-politics-live-news\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}