{
  "updatedAt": "2025-10-27T12:56:48.097Z",
  "items": [
    {
      "title": "ICE Detains British Media Commentator Sami Hamdi",
      "url": "https://www.nytimes.com/2025/10/27/us/sami-hamdi-detained-ice.html",
      "summary": "Sami Hamdi, who often speaks against Israel, was in the United States on a speaking tour. The Department of Homeland Security said his visa had been revoked."
    },
    {
      "title": "As Trump Tours Asia, Democracy’s Ideals Aren’t on the Agenda",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/trump-asia-democracy.html",
      "summary": "Several of the leaders President Trump will encounter are either autocrats or presiding over fragile democracies. And some admire his willingness to break the rules."
    },
    {
      "title": "Will Trump’s Tariffs Survive Supreme Court’s ‘Major Questions’ Test?",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/trump-tariffs-supreme-courts-major-questions-doctrine.html",
      "summary": "The justices used the doctrine, a judicially created method of reading statutes, to thwart several major Biden programs."
    },
    {
      "title": "Why Attacks on Spanberger Don’t Seem to Stick in Va. Governor’s Race",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/virginia-governors-race.html",
      "summary": "Abigail Spanberger, the Democratic nominee, has a commanding lead in polls. Her Republican rival, Winsome Earle-Sears, has focused on a texting scandal involving the Democrat running for attorney general."
    },
    {
      "title": "How the Firebombing of His Home Changed Josh Shapiro",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/josh-shapiro-political-violence.html",
      "summary": "In an interview, the Pennsylvania governor offered his most detailed accounting yet of the April attack — and how he’s grappling with its aftermath."
    },
    {
      "title": "How Politics Is Changing the Way History Is Taught",
      "url": "https://www.nytimes.com/2025/10/27/us/history-lessons-ethnic-studies-retreat.html",
      "summary": "History lessons are being wiped from the internet, and California is retreating from ethnic studies, as education swings away from curriculums that are seen as too progressive."
    },
    {
      "title": "Trump ‘would love’ unconstitutional third term but rules out running for VP",
      "url": "https://www.theguardian.com/us-news/2025/oct/27/donald-trump-third-term-vice-president",
      "summary": "&lt;p&gt;Presidents are constitutionally limited to two elected terms but some had suggested unorthodox gambit to stay in office&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/27/donald-trump-japan-sanae-takaichi-asia-canada-trade-news-updates-us-politics-live\"&gt;US politics – live updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; said on Monday morning that he would rule out running for the vice-presidency in the 2028 US election, an unorthodox approach that some of his supporters have floated to allow the Republican US president to serve a third term in the White House.&lt;/p&gt;&lt;p&gt;“I’d be allowed to do that,” Trump said, in an exchange with reporters aboard Air Force One while traveling from Kuala Lumpur, Malaysia, to Tokyo, Japan, on Monday, the latest leg of a five-day trip to Asia which he hopes to cap with an agreement on a &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/27/us-china-framework-trade-deal-xi-trump-meeting\"&gt;trade war truce&lt;/a&gt; with the Chinese president, &lt;a href=\"https://www.theguardian.com/world/xi-jinping\"&gt;Xi Jinping&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/27/donald-trump-third-term-vice-president\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump cuts likely hindered warning process for Alaska storm that displaced hundreds, experts say",
      "url": "https://www.theguardian.com/us-news/2025/oct/27/alaska-storm-emergency-response-trump-cuts",
      "summary": "&lt;p&gt;Reductions in weather balloon launches could have degraded forecasts that residents depend on to prepare&lt;/p&gt;&lt;p&gt;A faltering federal response to one of the worst storms in &lt;a href=\"https://www.theguardian.com/us-news/alaska\"&gt;Alaska&lt;/a&gt;’s history, which caused hundreds of people to become homeless, is drawing further scrutiny over the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt;’s efforts to dismantle federal weather and climate protections.&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/15/alaska-typhoon-halong-aftermath\"&gt;The powerful remnants of Typhoon Halong hit remote communities&lt;/a&gt; in the Yukon-Kuskokwim delta of south-west Alaska on 12 October, inundating a vast low-lying area of tundra that is home to some of the most remote and inaccessible communities in the country.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/27/alaska-storm-emergency-response-trump-cuts\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}