{
  "updatedAt": "2025-11-01T18:32:57.661Z",
  "items": [
    {
      "title": "Trump’s Team Offers to Keep Some Ballroom Donors Incognito",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/trumps-team-offers-to-keep-some-ballroom-donors-incognito.html",
      "summary": "Many corporate interests that have donated to the president’s pet project have business before his administration."
    },
    {
      "title": "Fed Governor Defends Call for Big Rate Cuts",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/steven-miran-interview-transcript.html",
      "summary": "In a wide-ranging interview, Stephen I. Miran discussed why he thinks concerns about inflation are overblown and his worries about the economy if the Federal Reserve does not rapidly lower interest rates. Here is a full transcript."
    },
    {
      "title": "Shutdowns, Obamacare and the Risks of Bargaining for Policy Wins in a Crisis",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/shutdowns-obamacare-republicans-democrats.html",
      "summary": "A 2013 attempt to leverage minority power in a health care fight blew up on Republicans. Can today be different for Democrats?"
    },
    {
      "title": "Miami Has a Mayoral Election. Bring On the Drama.",
      "url": "https://www.nytimes.com/2025/11/01/us/miami-mayor-election.html",
      "summary": "In a city of often-zany elections, this year’s mayoral race is especially rich in personal stories and longstanding feuds."
    },
    {
      "title": "Under Trump, Becoming a U.S. Citizen Gets Harder",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/trump-citizenship.html",
      "summary": "Federal officials say overhauling the process is necessary to ensure that only fully qualified immigrants become citizens."
    },
    {
      "title": "California Promised Insurance Relief, But Delivered Loopholes",
      "url": "https://www.nytimes.com/2025/11/01/us/los-angeles-california-fire-insurance-regulations.html",
      "summary": "New regulations were supposed to ensure that homeowners in fire zones would have coverage available. But companies can still avoid serving many high-risk areas, a Times investigation found."
    },
    {
      "title": "JD Vance repeats comments he wants wife Usha to convert to Christianity",
      "url": "https://www.theguardian.com/us-news/2025/nov/01/jd-vance-usha-christianity",
      "summary": "&lt;p&gt;US vice-president announces to 10,000 attenders of Turning Point USA that he prefers wife, who is Hindu, to be Christian&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/jd-vance\"&gt;JD Vance&lt;/a&gt; is doubling down on comments he made about wanting his wife, Usha Vance, to convert to Christianity – remarks that drew political backlash from some quarters.&lt;/p&gt;&lt;p&gt;At an event with Turning Point USA at the University of Mississippi to honor the conservative group’s slain founder &lt;a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"&gt;Charlie Kirk&lt;/a&gt;, an audience member questioned the US vice-president about how he sees the links between American patriotism and Christianity.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/01/jd-vance-usha-christianity\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump policies loom large over New Jersey’s unpredictable governor’s race",
      "url": "https://www.theguardian.com/us-news/2025/nov/01/new-jersey-governors-race",
      "summary": "&lt;p&gt;Race between Democrat Mikie Sherrill and Republican Jack Ciattarelli is drawing attention as preview of 2026 midterms&lt;/p&gt;&lt;p&gt;After last year’s election, when Republicans made significant inroads in the state, New Jersey voters will cast ballots in an off-year, unpredictable gubernatorial race that voters and experts say feels different from any in recent memory.&lt;/p&gt;&lt;p&gt;Democrat &lt;a href=\"https://www.theguardian.com/us-news/2025/jun/10/mikie-sherrill-new-jersey-governor-democratic-primary\"&gt;Mikie Sherrill&lt;/a&gt;, a former navy pilot and federal prosecutor who represents New Jersey’s 11th congressional District, is facing Republican Jack Ciattarelli, a businessman and former state lawmaker, who is making his third bid for governor, this time with Donald Trump’s endorsement.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/01/new-jersey-governors-race\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}