{
  "updatedAt": "2025-10-02T06:36:28.007Z",
  "items": [
    {
      "title": "Trump Administration Asks Colleges to Sign ‘Compact’ to Get Funding Preference",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/trump-college-funding.html",
      "summary": "Demands sent to nine top schools included pledging to freeze tuition for five years and to commit to strict definitions of gender."
    },
    {
      "title": "NTSB Faults Philadelphia Transit Agency Over Train Fires",
      "url": "https://www.nytimes.com/2025/10/01/us/ntsb-philadelphia-septa-train-cars.html",
      "summary": "The National Transportation Safety Board said hundreds of aging rail cars should be taken out of service until they can be replaced or retrofitted."
    },
    {
      "title": "For Workers, Mixed Signals. For the Public, Limited Impact on Shutdown’s First Day.",
      "url": "https://www.nytimes.com/2025/10/01/us/politics/shutdown-federal-workers-agencies.html",
      "summary": "Federal agencies gave shifting and mixed guidance to their work forces about who should come to work and who shouldn’t, but the initial effect on services appeared scattered and limited."
    },
    {
      "title": "‘Dangerous Cities,’ the Military, Trump and the Founding Fathers",
      "url": "https://www.nytimes.com/2025/10/01/us/politics/trump-military-founding-fathers.html",
      "summary": "The U.S. armed services have long sought to preserve the tradition of a nonpartisan military."
    },
    {
      "title": "White House Seeks to Blunt Democrats’ Shutdown Strategy on Health Care",
      "url": "https://www.nytimes.com/2025/10/01/us/politics/trump-democrats-health-care.html",
      "summary": "President Trump has made lowering health care costs a key priority, even as Democrats warn that costs will skyrocket."
    },
    {
      "title": "The Be-Careful-What-You-Wish-For Shutdown",
      "url": "https://www.nytimes.com/2025/10/01/us/politics/politics-shutdown-democrats-trump.html",
      "summary": "Unlike in shutdowns past, President Trump is the wild card."
    },
    {
      "title": "White House plays racist deepfake video of Democratic leaders on loop",
      "url": "https://www.theguardian.com/us-news/2025/oct/01/trump-racist-deepfake-video-jeffries-schumer",
      "summary": "&lt;p&gt;JD Vance, the VP, said he thought the video was ‘funny’ and the ‘sombrero memes’ would cease if government reopened&lt;/p&gt;&lt;p&gt;As the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; insists it is serious about negotiating an end to the government shutdown, a pair of racist deepfake videos mocking Democratic leaders played on a loop in the White House briefing room for hours on Wednesday.&lt;/p&gt;&lt;p&gt;The videos, posted by Trump on his social media platform on Monday, use &lt;a href=\"https://truthsocial.com/@realDonaldTrump/posts/115290424560405640\"&gt;fabricated audio&lt;/a&gt; to make it seem as if the Senate minority leader, Chuck Schumer, called Democrats “woke pieces of shit”, and showed the House minority leader, Hakeem Jeffries, with a fake mustache and sombrero.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/01/trump-racist-deepfake-video-jeffries-schumer\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Perky Maxwell House viral ad takes on housing crisis as ‘Maxwell Apartment’",
      "url": "https://www.theguardian.com/us-news/2025/oct/01/maxwell-house-ad-campaign-apartment",
      "summary": "&lt;p&gt;Historic US company also offering ‘12-month lease’ – an annual supply – of pre-ground coffee for under $40&lt;/p&gt;&lt;p&gt;Housing in the US has become so unaffordable that a coffee company has based a viral marketing campaign on the idea that almost nobody can afford to buy a house.&lt;/p&gt;&lt;p&gt;Maxwell House coffee, a 133-year-old brand, recently launched a marketing campaign rebranding themselves as “Maxwell Apartment Coffee”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/01/maxwell-house-ad-campaign-apartment\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}