{
  "updatedAt": "2025-10-04T18:32:16.949Z",
  "items": [
    {
      "title": "2 Children Are Dead and 2 Are in Critical Condition in Texas Shooting",
      "url": "https://www.nytimes.com/2025/10/04/us/texas-shooting-children.html",
      "summary": "A 13-year-old and 4-year-old were killed, officials said. A 9-year-old and 8-year-old were airlifted for medical care and were in critical condition."
    },
    {
      "title": "Who Still Has Temporary Protected Status?",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/temporary-protected-status-scotus.html",
      "summary": "Conflicting court rulings have plunged hundreds of thousands of people with temporary protection from deportation into uncertainty."
    },
    {
      "title": "Trump’s Approach on Gaza: Deal First, Details Later",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/trump-gaza-diplomacy.html",
      "summary": "“We’ll see how it all turns out,” President Trump said after Hamas agreed to portions of his cease-fire plan, with conditions."
    },
    {
      "title": "Trump Seizes On Government Shutdown to Punish Political Foes",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/trump-shutdown-punish-foes.html",
      "summary": "The White House has cut or paused billions in funding to Democratic-run cities and states since the federal government came to a halt."
    },
    {
      "title": "Partisan Messaging During Government Shutdown Could Hurt Civil Service, Experts Warn",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/partisan-messages-shutdown-trump.html",
      "summary": "Messages on official government channels blaming Democrats for the shutdown are one of the most significant hits yet to the longstanding wall between federal workers and politics, historians said."
    },
    {
      "title": "The Tech Jester Who Pranks San Francisco",
      "url": "https://www.nytimes.com/2025/10/04/us/riley-walz-san-francisco-parking-tickets-app.html",
      "summary": "Riley Walz, 23, has gained fame for his online antics. His latest stunt has upset city officials."
    },
    {
      "title": "US treasury considers special $1 Trump coin reading ‘fight, fight, fight’",
      "url": "https://www.theguardian.com/us-news/2025/oct/03/trump-coin-treasury",
      "summary": "&lt;p&gt;US treasurer says officials looking at drafts for country’s 250th anniversary featuring president with raised fist&lt;/p&gt;&lt;p&gt;To commemorate the 250th anniversary of the US’s independence, the treasury department is mulling production of a $1 coin displaying &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; with a clenched first under an American flag and the words “fight, fight, fight”.&lt;/p&gt;&lt;p&gt;The words overtly reference what Trump said immediately after narrowly surviving an assassination attempt four months before he won a second presidency.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/03/trump-coin-treasury\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "How Democrats are trying to bust Republican lies about healthcare for undocumented immigrants",
      "url": "https://www.theguardian.com/us-news/2025/oct/04/government-shutdown-republican-lies-healthcare-immigrants",
      "summary": "&lt;p&gt;At the centre of the government shutdown is the issue of healthcare for Americans being stripped by Trump’s ‘big, beautiful bill’&lt;/p&gt;&lt;p&gt;Leading up to the government shutdown on Wednesday, congressional Republicans and Donald Trump have repeated misleading claims that Democrats were trying to pass a resolution that would provide “free healthcare for illegals”. It’s become a well-rehearsed refrain fueling GOP lawmakers as government funding lapsed this week.&lt;/p&gt;&lt;p&gt;At the White House on Wednesday, the vice-president JD Vance said the Democrats’ spending plan “would have undone” the work of the One Big Beautiful Bill Act (OBBBA) – which &lt;a href=\"https://www.nilc.org/resources/new-law-limits-health-care-food-aid-for-immigrants/\"&gt;ended the eligibility&lt;/a&gt; of many types of lawfully present immigrants to access federally funded health coverage, like Medicaid, Medicare and Affordable Care Act (ACA) subsidies for private health insurance.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/04/government-shutdown-republican-lies-healthcare-immigrants\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}