{
  "updatedAt": "2025-10-28T06:39:57.856Z",
  "items": [
    {
      "title": "Trump Win Praise, But No Movements on Trade in Japan",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/trump-takaichi-japan-meeting.html",
      "summary": "President Trump and Sanae Takaichi, the Japanese prime minister, traded compliments during a stop in Tokyo, but signaled no major breakthrough in ongoing trade negotiations."
    },
    {
      "title": "Government Shutdown Imperils SNAP and Other Antipoverty Programs",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/trump-shutdown-snap-food-stamps-aid.html",
      "summary": "Within days, tens of millions of low-income Americans may lose assistance for food, child care and utilities if the federal government remains shut down."
    },
    {
      "title": "White House Withdraws Nominee for Top State Department Job",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/trump-middle-east-state-department-nominee-rayburn.html",
      "summary": "Joel Rayburn had been questioned over ties to a former Trump administration official who admitted to defying the president’s push to withdraw troops from Syria during his first term."
    },
    {
      "title": "Jack Smith Asks Justice Dept. for Guidance on Testifying to Congress",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/jack-smith-guidance-congressional-testimony.html",
      "summary": "Republicans have accused some people who worked for Mr. Smith, the former special counsel who investigated President Trump, of hiding behind grand jury secrecy rules."
    },
    {
      "title": "AFGE, Top Federal Workers’ Union, Sides With Republicans on Shutdown",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/afge-federal-workers-union-government-shutdown.html",
      "summary": "The American Federation of Government Employees, in a shift, called on Congress to immediately reopen the government without the health care measures sought by Democratic lawmakers."
    },
    {
      "title": "Trump Keeps Musing About a 3rd Term Despite Constitutional Limits",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/trump-third-term-politics.html",
      "summary": "A president who has chafed at the limits on his power sees political benefit in talking about remaining in office."
    },
    {
      "title": "Trump and Xi talks: what will be on the agenda when US president meets China’s leader?",
      "url": "https://www.theguardian.com/us-news/2025/oct/28/trump-and-xi-talks-what-will-be-on-the-agenda-when-us-president-meets-chinas-leader",
      "summary": "&lt;p&gt;Talks on Thursday will centre on tariffs as Trump seeks to end a bruising trade war with Beijing, while Taiwan and Russia are also likely to be discussed&lt;/p&gt;&lt;p&gt;Donald Trump is scheduled to meet China’s Xi Jinping in South Korea this week for high stakes talks amid a bruising trade war and tense geopolitical backdrop.&lt;/p&gt;&lt;p&gt;Trump is expected to meet Xi on the sidelines of the Asia Pacific Economic Cooperation (Apec) summit on Thursday &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-asia-tour-key-questions-xi-jinping-china-japan-south-korea-malaysia\"&gt;on the final day of his Asia visit&lt;/a&gt;, which includes stops in Malaysia and &lt;a href=\"https://www.theguardian.com/world/2025/oct/27/japans-new-pm-will-hope-the-abe-effect-endears-trump-to-her-at-crucial-talks\"&gt;Japan&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/28/trump-and-xi-talks-what-will-be-on-the-agenda-when-us-president-meets-chinas-leader\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: president floats a third term as Democrats vow ‘no way in hell’",
      "url": "https://www.theguardian.com/us-news/2025/oct/27/trump-news-at-a-glance-president-floats-a-third-term-as-democrats-vow-no-way-in-hell",
      "summary": "&lt;p&gt;President has not definitively ruled out seeking to extend time in office. Key US politics stories from Monday 27 October at a glance&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/27/can-trump-run-for-a-third-us-presidential-term-in-2028\"&gt;A third term for Trump would be unconstitutional. Here’s why&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Donald Trump has declined to definitively say he will not seek &lt;a href=\"https://www.theguardian.com/us-news/2025/apr/06/trump-third-term-extremist-ideas-mainstream\"&gt;an unconstitutional third term&lt;/a&gt; as US president. “I would love to do it: I have my best numbers ever,” the 79-year-old &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/27/donald-trump-third-term-vice-president\"&gt;told reporters on Air Force One&lt;/a&gt; during a trip to Asia. Pressed on whether he was not ruling out a third term, he said, “Am I not ruling it out?"
    }
  ]
}