{
  "updatedAt": "2025-10-12T12:47:56.758Z",
  "items": [
    {
      "title": "Rethinking Bruce Springsteen’s Difficult Years",
      "url": "https://www.nytimes.com/2025/10/12/us/bruce-springsteen-film-hostage-tennessee-keaton.html",
      "summary": "A film argues that an American icon may have made his best music in some of his lowest moments."
    },
    {
      "title": "The Destructive Legacy of California’s Zombie Fires",
      "url": "https://www.nytimes.com/2025/10/12/us/palisades-zombie-fires.html",
      "summary": "Blazes that firefighters thought had died but then later came roaring back to life have become increasingly common, heightening scrutiny of how first-responders put out wildfires."
    },
    {
      "title": "Air Traffic Controllers Reject Credit for Ending the Last Shutdown",
      "url": "https://www.nytimes.com/2025/10/12/us/politics/air-traffic-controllers-shutdown.html",
      "summary": "Controllers missing work was widely cited as the reason the last shutdown came to an end. But that assumption might have been overblown, according to controllers, aviation safety experts and congressional aides."
    },
    {
      "title": "Who Are the Louisiana Voters Behind a Major Supreme Court Challenge?",
      "url": "https://www.nytimes.com/2025/10/12/us/politics/supreme-court-voting-rights.html",
      "summary": "There is little information in court filings about the dozen plaintiffs who challenged the state’s voting map as an illegal racial gerrymander."
    },
    {
      "title": "She Despised Charlie Kirk. He Resolved to Make People Like Her Pay.",
      "url": "https://www.nytimes.com/2025/10/12/us/charlie-kirk-civil-war.html",
      "summary": "In rural Texas, just 40 miles apart, a paramedic and a former small-town mayor got caught up on two sides of a digital “civil war.”"
    },
    {
      "title": "At Least 1 Dead and 3 Injured After Shootings at Mississippi Universities",
      "url": "https://www.nytimes.com/2025/10/11/us/mississippi-shooting-jackson-alcorn.html",
      "summary": "The shootings at historically Black institutions occurred within about 24 hours of three other shootings across rural Mississippi that left at least eight people dead."
    },
    {
      "title": "Doge-ish comes to Florida: a DeSantis loyalist is going after ‘waste’ in Democratic cities",
      "url": "https://www.theguardian.com/us-news/2025/oct/12/blaise-ingoglia-doge-florida-ron-desantis",
      "summary": "&lt;p&gt;Blaise Ingoglia was handpicked by the Republican Florida governor to lead an assault on municipal spending&lt;/p&gt;&lt;p&gt;The words of Blaise Ingoglia, the &lt;a href=\"https://www.theguardian.com/us-news/ron-desantis\"&gt;Ron DeSantis&lt;/a&gt; loyalist handpicked to lead the Republican Florida governor’s &lt;a href=\"https://www.theguardian.com/us-news/2025/mar/07/desantis-republican-florida-doge\"&gt;Doge-style assault&lt;/a&gt; on local government spending, could not have been more prophetic.&lt;/p&gt;&lt;p&gt;“Expect a knock on the door from us,” Ingoglia &lt;a href=\"https://x.com/FLVoiceNews/status/1973453266718732340\"&gt;warned on 1 October&lt;/a&gt; as he announced upcoming audits for Democratic-run cities and counties whose “excessively wasteful” pecuniary habits displeased the DeSantis administration.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/12/blaise-ingoglia-doge-florida-ron-desantis\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Maga figures back Bukele’s call for Trump to crack down on US judges",
      "url": "https://www.theguardian.com/us-news/2025/oct/12/trump-bukele-judges",
      "summary": "&lt;p&gt;Experts say El Salvador president’s intervention comes as Trump is employing tactics used by autocrats abroad&lt;/p&gt;&lt;p&gt;Donald Trump is not known for taking advice, especially from foreign leaders who often seek to flatter and compliment the US president.&lt;/p&gt;&lt;p&gt;But El Salvador’s authoritarian leader Nayib Bukele has followed a different tack by calling on the Trump administration to follow his example in impeaching “corrupt judges”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/12/trump-bukele-judges\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}