{
  "updatedAt": "2025-09-16T13:36:29.211Z",
  "items": [
    {
      "title": "California’s Environmental Past Confronts Economic Worries of the Present",
      "url": "https://www.nytimes.com/2025/09/16/us/california-environment-democrats-newsom.html",
      "summary": "Gov. Gavin Newsom and Democratic state lawmakers have focused on pocketbook concerns this year, seeing their party’s national losses as a reckoning."
    },
    {
      "title": "Former Republican Lt. Governor of Georgia Enters Governor’s Race as a Democrat",
      "url": "https://www.nytimes.com/2025/09/16/us/geoff-duncan-georgia-governors-race.html",
      "summary": "Geoff Duncan could prove to be a wild card in an election next year that will be a crucial test for Georgia’s relatively new status as a swing state."
    },
    {
      "title": "F.B.I. Agents Fired by Patel Speak Out on ‘Broken’ Trust",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/kash-patel-fired-fbi-agents.html",
      "summary": "The two agents’ accounts offer an inside view of a bureau buffeted by politics and upheaval, adding to the scrutiny of the F.B.I. director as he prepares to testify to Congress."
    },
    {
      "title": "Why a Pennsylvania Court Election This November Could Matter in 2028",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/pennsylvania-supreme-court-election.html",
      "summary": "Voters will decide whether three Democratic State Supreme Court justices will keep their seats in a swing state that will be crucial to the next presidential election."
    },
    {
      "title": "Which Living Democrat Does Cuomo Admire? He Can’t Name One.",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/cuomo-nyc-mayor-democrats.html",
      "summary": "In an interview with The New York Times, former Gov. Andrew M. Cuomo, a lifelong Democrat, said the party “is not meeting the moment.”"
    },
    {
      "title": "Federal Judge Declines to Intervene for Migrants Deported to Ghana",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/judge-migrants-deported-ghana.html",
      "summary": "Judge Tanya S. Chutkan said her hands were “tied” with regard to the migrants, even though they held protective orders, in another victory for President Trump’s deportation campaign."
    },
    {
      "title": "Kash Patel faces Senate questions amid scrutiny over Charlie Kirk shooting investigation – live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live",
      "summary": "&lt;p&gt;FBI director expected to be grilled by Senate judiciary committee as he faces criticism for his actions and social media posts throughout the Kirk shooting investigation&lt;/p&gt;&lt;p&gt;Under-fire FBI director Kash Patel will confront Senate Democrats at a congressional hearing &lt;strong&gt;at 9am ET&lt;/strong&gt;, likely to be dominated by questions about the investigation into the killing of Charlie Kirk, as well as the agency’s role in reviewing the files related to the Epstein case, and recent firings of senior officials who have accused Patel of illegal political retribution.&lt;/p&gt;&lt;p&gt;His appearance before the Senate judiciary committee represents the first oversight hearing of Patel’s young but tumultuous tenure. Most recently &lt;strong&gt;he has faced &lt;a href=\"https://www.nbcnews.com/politics/justice-department/kash-patel-criticized-actions-posts-charlie-kirk-shooting-investigatio-rcna231043\"&gt;criticism&lt;/a&gt; for his actions and social media posts during the Kirk shooting investigation&lt;/strong&gt;, which have raised questions about his experience and judgement, including being seen as “grandstanding” with regards to his own role, and prematurely (and wrongly) announcing on X that the suspect had been caught.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "California nurses decry Ice presence at hospitals: ‘Interfering with patient care’",
      "url": "https://www.theguardian.com/us-news/2025/sep/16/california-ice-hospitals-patient-care",
      "summary": "&lt;p&gt;Caregiving staff say agents are bringing in patients, often denying them visitors and speaking on their behalf to staff&lt;/p&gt;&lt;p&gt;Dianne Sposito, a 69-year-old nurse, is laser-focused on providing care to anyone who enters the UCLA emergency room in southern California, where she works.&lt;/p&gt;&lt;p&gt;That task was made difficult though one week in June, she said, when a federal immigration agent blocked her from treating an immigrant who was screaming just a few feet in front of her in the hospital.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/16/california-ice-hospitals-patient-care\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}