{
  "updatedAt": "2025-10-06T18:36:36.292Z",
  "items": [
    {
      "title": "Trump Says Portland Is ‘Burning.’ Here’s What Crime Is Really Like.",
      "url": "https://www.nytimes.com/live/2025/10/06/us/national-guard-trump-oregon-chicago/trump-portland-crime-reality",
      "summary": ""
    },
    {
      "title": "Wesley Hunt Enters Texas G.O.P. Senate Race, Complicating Path for Cornyn",
      "url": "https://www.nytimes.com/2025/10/06/us/politics/wesley-hunt-senate-texas-cornyn-paxton.html",
      "summary": "Mr. Hunt, a U.S. House member, and Senator John Cornyn will be competing for voters who dislike the state’s attorney general, Ken Paxton, who has led in many polls."
    },
    {
      "title": "Who is Judge Immergut? Trump Appointee in Oregon Blocks Troop Deployment.",
      "url": "https://www.nytimes.com/2025/10/06/us/politics/trump-judge-oregon-immergut.html",
      "summary": "Judge Karin Immergut worked on Ken Starr’s investigation of Bill Clinton. Now she’s ruled against Trump’s attempt to send troops to Portland."
    },
    {
      "title": "Elected but Not Seated, Grijalva Waits to Sign Epstein Petition",
      "url": "https://www.nytimes.com/2025/10/06/us/politics/adelita-grijalva-house-epstein.html",
      "summary": "The Democratic representative-elect won her Arizona seat overwhelmingly. But so far, the Republican speaker will not swear her in."
    },
    {
      "title": "A judge’s order blocked Trump from sending troops to Portland. It doesn’t apply to Chicago.",
      "url": "https://www.nytimes.com/live/2025/10/06/us/national-guard-trump-oregon-chicago/a-judges-order-blocked-trump-from-sending-troops-in-portland-it-doesnt-apply-to-chicago",
      "summary": ""
    },
    {
      "title": "What Is the National Guard, and Who Controls It?",
      "url": "https://www.nytimes.com/2025/10/06/us/what-is-national-guard.html",
      "summary": "The state-based military force is made up mainly of part-time soldiers and organized by state. It can be activated by the state governor or by the president."
    },
    {
      "title": "White House calls court ruling blocking Portland national guard deployment ‘untethered from reality’ – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Karoline Leavitt criticizes Trump-appointed judge’s decision; Trump deploying military to Chicago on ‘flimsy pretext’, Illinois lawsuit alleges &lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/06/trump-administration-illinois-national-guard\"&gt;Illinois sues Trump seeking to block deployment of national guard&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The supreme court has &lt;strong&gt;rejected Ghislaine Maxwell’s challenge of her criminal conviction for recruiting and grooming minors&lt;/strong&gt;, who were sexually abused by her former boyfriend and companion Jeffrey Epstein – the disgraced financier who died in a New York prison in 2019.&lt;/p&gt;&lt;p&gt;Maxwell is currently serving a 20-year-sentence for her crimes. She was recently moved to a minimum-security prison in Texas.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US says subsidies for rural airline service to expire as soon as Sunday",
      "url": "https://www.theguardian.com/us-news/2025/oct/06/us-subsidies-rural-airline-service",
      "summary": "&lt;p&gt;Essential Air Service program, popular with Republican lawmakers, faces funding cut because of US shutdown&lt;/p&gt;&lt;p&gt;The Trump administration has said that funds from a US government program that subsidizes commercial air service to rural airports are set to expire as soon as Sunday because of &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/05/democrats-healthcare-government-shutdown\"&gt;the government shutdown&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;The US transportation department said the subsidies in the Essential Air Service program are expected to expire as soon as Sunday after the department transferred unrelated funding from the Federal Aviation Administration as an advance.&lt;/p&gt;&lt;p&gt;“Every state across the country will be impacted,” the transportation secretary, Sean Duffy, said at a press conference, noting the service had bipartisan support. “We don’t have the money for that program moving forward.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/06/us-subsidies-rural-airline-service\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}