{
  "updatedAt": "2025-10-04T12:46:46.773Z",
  "items": [
    {
      "title": "Trump Seizes on Shutdown to Punish Political Foes",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/trump-shutdown-punish-foes.html",
      "summary": "The White House has cut or paused billions in funding to Democratic-run cities and states since the federal government came to a halt."
    },
    {
      "title": "Partisan Shutdown Messages Could Hurt Civil Service, Experts Warn",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/partisan-messages-shutdown-trump.html",
      "summary": "Messages on official government channels blaming Democrats for the shutdown are one of the most significant hits yet to the longstanding wall between federal workers and politics, historians said."
    },
    {
      "title": "The Tech Jester Who Pranks San Francisco",
      "url": "https://www.nytimes.com/2025/10/04/us/the-tech-jester-who-pranks-san-francisco.html",
      "summary": "Riley Walz, 23, has gained fame for his online antics. His latest stunt has upset city officials."
    },
    {
      "title": "After Trump’s Medicaid Cuts, Patients at Rural Maine Clinics Feel the Fallout",
      "url": "https://www.nytimes.com/2025/10/04/us/medicaid-cuts-trump-maine-clinics.html",
      "summary": "The Trump administration has cut off funding for certain providers around the country whose offerings include abortion. Patients in Maine are among those who will feel the fallout."
    },
    {
      "title": "This Program Rescued Army Recruiting",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/army-recruiting-trump.html",
      "summary": "The defense secretary cites a ‘Trump bump.’ But the Army’s recruiting surge wouldn’t have been possible without the program started three years ago at Fort Jackson."
    },
    {
      "title": "What Happens When Socialists Are in Charge? Portland Offers a Glimpse.",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/portland-socialists-mamdani.html",
      "summary": "A West Coast version of Zohran Mamdani’s campaign is playing out in Portland. But the socialist city councilors, who say the city has been “run by the rich” for too long, are facing significant opposition."
    },
    {
      "title": "A ‘hostile takeover’: ousted CDC official raises alarm over RFK Jr approach to infectious disease",
      "url": "https://www.theguardian.com/us-news/2025/oct/04/cdc-rfk-jr-infectious-disease-testimony",
      "summary": "&lt;p&gt;Debra Houry speaks after testifying on eight months under Kennedy, who critics say shuns science and spreads falsehoods&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/robert-f-kennedy-jr\"&gt;Robert F Kennedy Jr&lt;/a&gt;, the secretary of the US Department of Health and Human Services (HHS), has avoided meetings with top health officials, even as deadly outbreaks unfolded, and pushed to make unprecedented changes to the childhood immunization schedule, according to a recently ousted leader of the US Centers for Disease Control and Prevention (CDC).&lt;/p&gt;&lt;p&gt;Debra Houry, the CDC’s former chief medical officer, spoke with the Guardian after &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/17/rfk-jr-senate-hearing-cdc-susan-monarez\"&gt;testifying&lt;/a&gt; before a Senate committee about her eight months serving under Kennedy, offering insight into a health secretary who has been criticized as shunning expertise in favor of spreading misinformation, denigrating science, and dismantling institutions crucial for Americans’ health.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/04/cdc-rfk-jr-infectious-disease-testimony\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "‘He wasn’t this national hero’: US college students voice concern over Charlie Kirk’s idolization",
      "url": "https://www.theguardian.com/us-news/2025/oct/04/charlie-kirk-killing-colleges",
      "summary": "&lt;p&gt;Black, brown and LGBTQ+ students across the US are puzzled by all the praise the far-right commentator has received after his killing&lt;/p&gt;&lt;p&gt;Alana*, a student at Utah Valley University, was taken aback by the deification of &lt;a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"&gt;Charlie Kirk&lt;/a&gt; in the wake of his assassination on 10 September. As an Afro-Latina genderqueer senior at DC’s Howard University, she found it off-putting when she saw an image on Instagram of Kirk hugging Jesus. “He wasn’t this national hero or politician,” Alana, who is using an alias, said. He was “just a white man with a loud opinion.”&lt;/p&gt;&lt;p&gt;The sentiment on the historically Black university’s campus, she said, is that Kirk’s rhetoric about marginalized communities &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-quotes-beliefs\"&gt;was hateful&lt;/a&gt; and that they are being unfairly blamed for his death.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/04/charlie-kirk-killing-colleges\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}