{
  "updatedAt": "2025-12-02T13:00:01.074Z",
  "items": [
    {
      "title": "Mandela Barnes Enters Wisconsin Governor Race, Joining Crowded Field of Democrats",
      "url": "https://www.nytimes.com/2025/12/02/us/politics/wisconsin-governor-mandela-barnes.html",
      "summary": "The former lieutenant governor is the best-known candidate in a crowded field, but some state Democrats have cooled on him since he lost a Senate bid in 2022."
    },
    {
      "title": "Tennessee House Special Election 2025: What to Watch",
      "url": "https://www.nytimes.com/2025/12/02/us/politics/tennessee-house-behn-van-epps.html",
      "summary": "A special election for a House seat in Tennessee was supposed to be an easy Republican victory. But national spending and Democratic enthusiasm have made it an unusually high-profile race."
    },
    {
      "title": "Supreme Court to Hear Dispute Over Anti-Abortion Center Donor Records",
      "url": "https://www.nytimes.com/2025/12/02/us/supreme-court-pregnancy-centers-abortion.html",
      "summary": "The legal fight involves an attempt by New Jersey’s Attorney General to subpoena crisis pregnancy center records."
    },
    {
      "title": "How Democrats Have Performed in 2025 Special Elections",
      "url": "https://www.nytimes.com/2025/12/02/us/elections/special-elections-democrats-tn7.html",
      "summary": "Tennessee’s Seventh District was created to be safely Republican, but in recent special elections across the country Democrats have done significantly better than they did in 2024."
    },
    {
      "title": "Joe Kahn, New York Times Executive Editor, Answers Reader Questions",
      "url": "https://www.nytimes.com/2025/12/02/us/joe-kahn-executive-editor-questions.html",
      "summary": "We asked readers for their questions for The Times’s executive editor about how we cover the news and make judgment calls in our reporting and editing."
    },
    {
      "title": "Winter Storm Creating Dangerous Conditions as It Approaches Northeast",
      "url": "https://www.nytimes.com/2025/12/02/us/snow-winter-storm-northeast-ny-nj.html",
      "summary": "A mix of snow and ice was beginning to fall across the Midwest and Northeast Tuesday, where tens of millions of people face severe weather."
    },
    {
      "title": "White House distances Hegseth from second strike on alleged drug boat – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/02/donald-trump-pete-hegseth-boat-venezuela-maduro-tennessee-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Defence secretary gave order for strikes but did not say to ‘kill everybody’, according to White House spokesperson&lt;/p&gt;&lt;p&gt;&lt;em&gt;Joseph Gedeon is a politics breaking news reporter based in Washington&lt;/em&gt;&lt;/p&gt;&lt;p&gt;The &lt;a href=\"https://www.theguardian.com/us-news/fbi\"&gt;FBI&lt;/a&gt; director, &lt;strong&gt;Kash Patel&lt;/strong&gt;, is “in over his head” and leading a “chronically under-performing” agency paralyzed by fear and plummeting morale, according to a scathing 115-page report compiled by a national alliance of retired and active-duty FBI special agents and analysts.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/02/donald-trump-pete-hegseth-boat-venezuela-maduro-tennessee-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "EU foreign policy chief warns US-Russia talks may pressure Kyiv to make concessions | First Thing",
      "url": "https://www.theguardian.com/us-news/2025/dec/02/first-thing-eu-foreign-policy-chief-warns-us-russia-talks-may-pressure-kyiv-to-make-concessions",
      "summary": "&lt;p&gt;Steve Witkoff is due to meet Vladimir Putin in Moscow. Plus, a new book highlights the forgotten builders of the Empire State Building&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"&gt;&lt;strong&gt;Don’t already get First Thing in your inbox? Sign up here&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;The EU’s foreign policy chief, Kaja Kallas, has said she fears talks between the Russian president, Vladimir Putin, and Donald Trump’s special envoy, Steve Witkoff, will &lt;a href=\"https://www.theguardian.com/world/2025/dec/01/diplomacy-talks-negotiations-end-ukraine-war-russia-eu-kaja-kallas\"&gt;pile pressure on Ukraine to make concessions&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What did Kallas say?&lt;/strong&gt; “I am afraid that all the pressure will be put on the victim,” she said. “In order to have peace, we shouldn’t lose focus that it’s actually Russia who has started this war [and is] targeting civilians”.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What’s happening today?&lt;/strong&gt; Witkoff is meeting Putin in Moscow. Meanwhile, Ukraine’s president, Volodymyr Zelenskyy, continues his diplomatic push to rally support from European allies, visiting Ireland today after France on Monday.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;This is a developing story.&lt;/strong&gt; Follow our &lt;a href=\"https://www.theguardian.com/world/live/2025/dec/02/ukraine-war-live-trump-peace-deal-witkoff-to-meet-putin\"&gt;live blog here&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What did Maduro say?&lt;/strong&gt; He reportedly refused to step down immediately and allegedly made a series of counter-demands, including worldwide immunity from prosecution and being allowed to cede political control but keep control of the armed forces.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What is the context?&lt;/strong&gt; The US has undertaken &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/24/visual-guide-us-military-presence-caribbean\"&gt;three months of deadly airstrikes&lt;/a&gt; on alleged drug-smuggling boats that have killed at least 83 people – attacks the UN and other humanitarian organisations have described as extrajudicial executions."
    }
  ]
}