{
  "updatedAt": "2025-11-06T12:55:59.341Z",
  "items": [
    {
      "title": "A Skeptical Supreme Court Puts Trump’s Tariffs and Economic Agenda in Question",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/supreme-court-trump-tariffs.html",
      "summary": "President Trump has used his sweeping global tariffs as an economic tool and a political cudgel. A decision invalidating them could hamper his power."
    },
    {
      "title": "Nick Fuentes’s Rise Puts MAGA Movement in a ‘Time of Choosing’",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/nick-fuentes-trump.html",
      "summary": "After Mr. Fuentes’s interview with Tucker Carlson, Republicans are considering just how far his views are from the nationalism embraced by President Trump’s followers."
    },
    {
      "title": "AR-15 Ammunition at a Crime Scene? Good Odds This Army Plant Made It.",
      "url": "https://www.nytimes.com/2025/11/06/us/military-ammunition-crime-lake-city.html",
      "summary": "Popular AR-15 ammunition made at an Army-owned facility was far more likely than any other to turn up in a government database tracking evidence from gun crimes, new data shows."
    },
    {
      "title": "Lawmakers Seek Investigation of Judges Who Criticized Supreme Court",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/supreme-court-grassley-jordan-investigation.html",
      "summary": "The Republican leaders of the Senate and House Judiciary Committees told Chief Justice John G. Roberts Jr. that anonymous judges who responded to a Times questionnaire may have violated ethics rules."
    },
    {
      "title": "Florida Man Threatened James Comey and Letitia James, Complaint Says",
      "url": "https://www.nytimes.com/2025/11/05/us/man-arrested-threats-james-comey-letitia-james.html",
      "summary": "Gregory Formicone, of Bradenton, Fla., used online comments to call for several of President Trump’s most prominent adversaries to be targeted, the authorities said."
    },
    {
      "title": "Democrats Raise Concerns After Trump Officials Give Boat Strikes Briefing",
      "url": "https://www.nytimes.com/2025/11/05/us/politics/trump-drug-boat-strikes-democrats.html",
      "summary": "The classified meeting did not relieve mounting unease among lawmakers over President Trump’s expanding campaign of lethal strikes against drug cartels."
    },
    {
      "title": "Senate to vote on legislation to stop unauthorized war against Venezuela – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Bipartisan proposal follows reports Trump administration is considering land strikes within the country&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The US is ending temporary deportation protection for South Sudanese nationals, which for more than a decade allowed people from the east African country to stay in the US after escaping conflict.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;In a &lt;a href=\"https://www.federalregister.gov/documents/2025/11/06/2025-19800/termination-of-the-designation-of-south-sudan-for-temporary-protected-status\"&gt;notice&lt;/a&gt; published on Wednesday, the US Citizenship and Immigration Services (USCIS) said conditions in South Sudan no longer met the statutory requirements for temporary protected status. The agency said South Sudanese nationals with status through the programme had 60 days to leave the US or face deportation.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "What Tuesday’s elections mean for the future of abortion rights",
      "url": "https://www.theguardian.com/us-news/2025/nov/06/tuesday-elections-future-abortion-rights",
      "summary": "&lt;p&gt;Democrats’ commanding victories have breathed new life for supporters of the reproductive health fight&lt;/p&gt;&lt;p&gt;Supporters of abortion rights have spent much of the last year trying to fight Donald Trump’s attempts to undermine access to the procedure. Now, Democrats’ commanding victories in the 2025 elections have breathed new life into the fight.&lt;/p&gt;&lt;p&gt;Democrats Abigail Spanberger and Mikie Sherrill’s respective gubernatorial victories in Virginia and New Jersey will shield abortion rights in two states that have become havens for people fleeing abortion bans. In Pennsylvania, voters decided to retain three liberal supreme court justices, maintaining Democratic control of a &lt;a href=\"https://www.theguardian.com/us-news/2024/nov/02/state-supreme-court-abortion-ballot\"&gt;bench that could decide the future of abortion rights&lt;/a&gt; in the deeply purple state.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/06/tuesday-elections-future-abortion-rights\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}