{
  "updatedAt": "2025-09-05T13:18:25.351Z",
  "items": [
    {
      "title": "South Koreans Are Among Hundreds Detained in Immigration Raid at Hyundai E.V. Plant",
      "url": "https://www.nytimes.com/2025/09/05/us/georgia-battery-plant-hyundai-lg-ice-raid.html",
      "summary": "Executives of a South Korean battery maker were apprehended at a construction site in Georgia, the company said. The episode prompted diplomatic concern in Seoul."
    },
    {
      "title": "The Luckiest Gas Station in America",
      "url": "https://www.nytimes.com/2025/09/05/us/lottery-tickets-california-gas-station.html",
      "summary": "A Syrian immigrant in Southern California beat the odds — twice — and now some Powerball players see an ineffable magic at work in his store."
    },
    {
      "title": "ICE Agents Are Wearing Masks. Is That Un-American?",
      "url": "https://www.nytimes.com/2025/09/05/us/ice-agents-wearing-masks.html",
      "summary": "The long, strange story of masking and law enforcement."
    },
    {
      "title": "‘Something Is Wrong With My Brain’: A Police Officer’s Descent",
      "url": "https://www.nytimes.com/2025/09/05/us/cte-police.html",
      "summary": "Brent Simpson is the first police officer known to have C.T.E. He showed signs of the disease in the last few years of his life."
    },
    {
      "title": "How a Top Secret SEAL Team 6 Mission Into North Korea Fell Apart",
      "url": "https://www.nytimes.com/2025/09/05/us/navy-seal-north-korea-trump-2019.html",
      "summary": "The 2019 operation, greenlit by President Trump, sought a strategic edge. It left unarmed North Koreans dead."
    },
    {
      "title": "The Secret Mission to Spy on North Korea’s Leader",
      "url": "https://www.nytimes.com/video/us/100000010310279/the-secret-mission-to-spy-on-north-koreas-leader.html",
      "summary": "In 2019, a group of Navy SEALs crept out of the ocean onto the shore of North Korea for a dangerous and secret mission that has never been publicly disclosed until now."
    },
    {
      "title": "Trump faces criticism over to order to rebrand Pentagon as ‘Department of War’ – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Move could cost tens of millions of dollars, with letterheads and signs needing to be changed, and one Democrat says money should instead go towards preventing conflicts&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/04/trump-defense-war-department\"&gt;Trump expected to order rebrand of Pentagon as ‘Department of War’&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Tensions between Michelle Wu, the mayor of Boston, and the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; have been escalating in recent months over the administration’s aggressive immigration policies, with reports now signaling the possibility of a federal immigration enforcement surge in the city.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The friction came to a head last week when the Trump administration reportedly began preparing an “immigration enforcement blitz” for Boston in the coming weeks, according to &lt;a href=\"https://www.politico.com/news/2025/08/29/trump-admin-plans-immigration-enforcement-surge-in-boston-00536276\"&gt;Politico&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "First Thing: RFK Jr accused of ‘reckless disregard for science and the truth’ in Senate hearing",
      "url": "https://www.theguardian.com/us-news/2025/sep/05/first-thing-rfk-jr-accused-of-reckless-disregard-for-science-and-the-truth-in-senate-hearing",
      "summary": "&lt;p&gt;Health secretary defends his leadership as Democrats attack his vaccine policy and demand his resignation. Plus, how Giorgio Armani became the mastermind of contemporary style&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"&gt;Don’t already get First Thing in your inbox? Sign up here&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;The US health secretary, Robert F Kennedy Jr, faced the Senate finance committee in &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/04/rfk-jr-hearing-calls-resign-democrats\"&gt;a tense and combative hearing&lt;/a&gt; on Thursday, during which lawmakers questioned his remarks expressing vaccine skepticism, claims that the scientific community is deeply politicized, and the ongoing turmoil plaguing the Centers for Disease Control and Prevention (CDC).&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What did the Democrats say during the hearing?&lt;/strong&gt; Senators began by calling for Kennedy’s resignation. “Robert Kennedy’s primary interest is taking vaccines away from Americans,” the ranking member Ron Wyden said, while Raphael Warnock called Kennedy a “hazard to the health of the American people” and repeated his calls for him to step down or for Donald Trump to fire him.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What did Trump say about the need for congressional approval?&lt;/strong&gt; That the administration considered it a mere formality. “We’re just going to do it."
    }
  ]
}