{
  "updatedAt": "2025-11-23T06:37:41.347Z",
  "items": [
    {
      "title": "Georgia Voters Stand by Marjorie Taylor Greene After She Stood Up to Trump",
      "url": "https://www.nytimes.com/2025/11/22/us/georgia-marjorie-taylor-greene-voters.html",
      "summary": "Ms. Greene’s resignation blindsided her conservative Georgia district, which had stuck by her through ups and downs, including her split with the president."
    },
    {
      "title": "Tatiana Schlossberg, John F. Kennedy’s Granddaughter, Reveals Terminal Cancer Diagnosis",
      "url": "https://www.nytimes.com/2025/11/22/us/tatiana-schlossberg-kennedy-cancer.html",
      "summary": "Tatiana Schlossberg, a daughter of Caroline Kennedy, revealed a terminal cancer diagnosis in an essay published on the anniversary of her grandfather’s assassination."
    },
    {
      "title": "Texas Men Plotted Coup of Haitian Island to Enslave Women and Children, U.S. Says",
      "url": "https://www.nytimes.com/2025/11/22/us/texas-men-haiti-island-takeover-plot.html",
      "summary": "The men, who planned to recruit homeless people for the invasion, took Haitian Creole classes and one enrolled in the U.S. Air Force to prepare for an attack by sailboat, prosecutors said."
    },
    {
      "title": "For Marjorie Taylor Greene, a Rough Education in MAGA Politics",
      "url": "https://www.nytimes.com/2025/11/22/us/politics/marjorie-taylor-greene.html",
      "summary": "The Georgia congresswoman strove to be both the ultimate Trump warrior and to be taken seriously. She wound up in political exile."
    },
    {
      "title": "Marjorie Taylor Greene’s Exit Deals a Blow to Republicans’ Majority in Congress",
      "url": "https://www.nytimes.com/2025/11/22/us/politics/marjorie-taylor-greene-republicans.html",
      "summary": "Representative Marjorie Taylor Greene’s sudden resignation underscored the fragility of the G.O.P. majority, and exposed deep discontent on the right going into the midterm elections."
    },
    {
      "title": "A.I. Toy Bear Speaks of Sex, Knives and Pills, Consumer Group Warns",
      "url": "https://www.nytimes.com/2025/11/22/us/folotoy-ai-bear-suspended-explicit-advice.html",
      "summary": "The chatter left startled adults unsure whether they heard correctly. Testers warned that interactive toys like this one could allow children to stray into inappropriate exchanges."
    },
    {
      "title": "Trump news at a glance: Marjorie Taylor Greene is gone, but Trump wonders for how long",
      "url": "https://www.theguardian.com/us-news/2025/nov/23/trump-administration-news-updates-latest",
      "summary": "&lt;p&gt;The ultra-loyal Maga star announced her departure in typical shocking fashion, but president says he would love to see her back in politics – key US politics stories from 22 November 2025&lt;/p&gt;&lt;p&gt;The surprise resignation of Marjorie Taylor Greene reverberated through Saturday, as figures from across the political spectrum gave &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/22/marjorie-taylor-greene-political-reactions\"&gt;responses ranging from criticism to acclaim&lt;/a&gt;, including Donald Trump, who hinted at a future political career for her.&lt;/p&gt;&lt;p&gt;Alexandria Ocasio-Cortez, the Democratic congresswoman and Greene’s frequent sparring partner, criticized her voting record on healthcare and claimed “She’s carefully timing her departure just 1-2 days after her pension kicks in”, adding: “… her actions have not backed up the rhetoric. For all her talk, she’s still voting with them to gut healthcare … ”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/23/trump-administration-news-updates-latest\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "First rebuilt home in wake of LA fires celebrated in Pacific Palisades",
      "url": "https://www.theguardian.com/us-news/2025/nov/22/first-rebuilt-home-los-angeles-fires",
      "summary": "&lt;p&gt;Fire-resistant upgrades are included in replacement structure less than a year after fires destroyed 13,000 homes&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/19/pacific-palisades-wildfires-los-angeles\"&gt;Did you lose your home in the Los Angeles wildfires? We’d like to hear how you’re spending the holidays&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Less than a year after the Palisades fire destroyed nearly 7,000 structures in Los Angeles, the first completed rebuilt home is being celebrated in Pacific Palisades.&lt;/p&gt;&lt;p&gt;In a &lt;a href=\"https://mayor.lacity.gov/news/mayor-bass-announces-first-certificate-occupancy-issued-home-being-rebuilt-pacific-palisades\"&gt;statement&lt;/a&gt;, mayor Karen Bass confirmed that the Los Angeles department of building and safety had issued the certificate on Friday, certifying that the home had passed inspection and was ready for occupancy.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/22/first-rebuilt-home-los-angeles-fires\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}