{
  "updatedAt": "2025-11-24T06:40:46.617Z",
  "items": [
    {
      "title": "Jamil Abdullah Al-Amin, Black Power Activist Known as H. Rap Brown, Dies at 82",
      "url": "https://www.nytimes.com/2025/11/23/us/h-rap-brown-dead.html",
      "summary": "A charismatic orator in the 1960s, he called for armed resistance to white oppression. As a Muslim cleric, he was convicted of murder in 2000 and died in detention."
    },
    {
      "title": "Morgan Geyser, Convicted in ‘Slender Man’ Stabbing, Is Captured After Fleeing",
      "url": "https://www.nytimes.com/2025/11/23/us/morgan-geyser-missing-slenderman-stabbing.html",
      "summary": "The woman, Morgan Geyser, was taken into custody a day after she left a group home in Wisconsin. The police said she cut off a monitoring bracelet."
    },
    {
      "title": "Former News Anchor Sentenced to 10 Years in Prison for Pandemic Fraud",
      "url": "https://www.nytimes.com/2025/11/23/us/phoenix-news-anchor-covid-fraud.html",
      "summary": "The former anchor, Stephanie Hockridge, who once worked for a Phoenix station, participated in an elaborate scheme that illegally obtained more than $63 million, prosecutors said."
    },
    {
      "title": "Top U.S. Military Officer to Visit Caribbean as Trump Pressures Venezuela",
      "url": "https://www.nytimes.com/2025/11/23/us/politics/caribbean-trump-venezuela-military.html",
      "summary": "Gen. Dan Caine is making the trip as President Trump is said to have approved plans for covert action in Venezuela."
    },
    {
      "title": "U.S. Introduces New Female Crash-Test Dummy Standards",
      "url": "https://www.nytimes.com/2025/11/23/us/female-crash-test-dummy.html",
      "summary": "A female crash-test dummy to replace an outdated model largely based on male proportions would improve safety for women, who face higher fatality and injury risks on the road, officials said."
    },
    {
      "title": "Trump to End Temporary Protected Status for Somalis",
      "url": "https://www.nytimes.com/2025/11/23/us/trump-somali-tps-protected-minnesota.html",
      "summary": "About 700 Somali immigrants are currently allowed to live and work in the United States under a program for people fleeing countries in turmoil."
    },
    {
      "title": "‘Is the price of doing this worth it?’: North Carolina Republicans worry about Trump immigration raids",
      "url": "https://www.politico.com/news/2025/11/23/north-carolina-immigration-raids-trump-00665164",
      "summary": "The concerns surrounding Trump’s immigration clampdown in the Tar Heel state speak to a tension at the center of the president’s immigration agenda."
    },
    {
      "title": "What Trump’s Mamdani praise — and MTG’s ouster — says about MAGA’s future",
      "url": "https://www.politico.com/news/2025/11/22/trump-mtg-mamdani-maga-future-00666113",
      "summary": "A whirlwind Friday is the freshest reminder that the MAGA movement has always been defined more by id than ideology."
    }
  ]
}