{
  "updatedAt": "2025-11-04T06:39:50.726Z",
  "items": [
    {
      "title": "The First Big Elections of the New Trump Era Are Today. Here’s What to Look For.",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/elections-new-york-new-jersey-virginia.html",
      "summary": "The mayor’s race in New York will gauge voters’ desire for a left-wing shift, and Democrats running for governor in New Jersey and Virginia again made fighting the president central to their bids."
    },
    {
      "title": "George Banks, Convicted Mass Murderer, Dies at 83",
      "url": "https://www.nytimes.com/2025/11/03/us/george-banks-dead.html",
      "summary": "He fatally shot 13 people in Pennsylvania in September 1982 in what was then one of the nation’s worst mass shootings. Five of the victims were his own children."
    },
    {
      "title": "Trump Advisers Were Paid Over $1.6 Million by the Albanian Opposition",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/trump-advisers-were-paid-over-1-6-million-by-the-albanian-opposition.html",
      "summary": "The payments underscore how lucrative foreign political consulting can be for operatives with ties to the president."
    },
    {
      "title": "Prosecutors Urge Judge to Rebuff Comey’s Bid to Dismiss Case",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/james-comey-prosecution-trump.html",
      "summary": "The filing appeared to be an effort to construct a narrative that James B. Comey had leaked information to the news media without actually tying such assertions to the claims made in the indictment against him."
    },
    {
      "title": "G.O.P. Figures Seek Distance From Tucker Carlson, Denouncing Antisemitism",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/gop-tucker-carlson-nick-fuentes-antisemitism.html",
      "summary": "Prominent Republicans rejected the views of Nick Fuentes, a white supremacist, though some refrained from directly criticizing Tucker Carlson for interviewing him."
    },
    {
      "title": "Trump Doubles Down on Nuclear Tests. His Energy Secretary Differs.",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/trump-nuclear-tests-energy-secretary.html",
      "summary": "President Trump and one of his top cabinet officials are sending mixed messages on how the U.S. government is handling the most destructive weapons in the world."
    },
    {
      "title": "‘They take the money and go’: why not everyone is mourning the end of USAID",
      "url": "https://www.theguardian.com/us-news/2025/nov/04/they-take-the-money-and-go-why-not-everyone-is-mourning-the-end-of-usaid",
      "summary": "&lt;p&gt;When Donald Trump set about dismantling USAID, many around the world were shocked. But on the ground in Sierra Leone, the latest betrayal was not unexpected&lt;/p&gt;&lt;p&gt;Earlier this year, Donald Trump appointed a 28-year-old Doge alumnus, Jeremy Lewin, to oversee his administration’s approach to global aid. Lewin’s primary task has been to gut the US’s aid funding. In an interview with &lt;a href=\"https://www.nytimes.com/2025/07/31/opinion/doge-foreign-aid-jeremy-lewin.html\"&gt;the New York Times&lt;/a&gt;, Lewin argued that the traditional approach, which he termed the “global humanitarian complex”, didn’t help poor countries “progress beyond aid”, instead keeping them dependent. The system, he continued, has “demonstrably failed”.&lt;/p&gt;&lt;p&gt;This isn’t just the Trump administration’s view."
    },
    {
      "title": "Senate Republicans strike down Democratic proposal to fully fund Snap",
      "url": "https://www.theguardian.com/us-news/2025/nov/03/senate-republicans-snap-funds-resolution",
      "summary": "&lt;p&gt;Democratic leaders decry ‘unbelievably cruel’ move, saying ‘Trump is using food as a weapon’ during shutdown&lt;/p&gt;&lt;p&gt;Senate Republicans shot down a Democratic-led attempt to fully fund Supplemental Nutrition Assistance Program (Snap) benefits on Monday during the government shutdown – a move that heightens uncertainty for the 42 million Americans participating in the country’s biggest anti-hunger program.&lt;/p&gt;&lt;p&gt;Jeff Merkley, a Democratic senator, and Chuck Schumer, the Senate Democratic leader, attempted to pass a &lt;a href=\"https://www.merkley.senate.gov/wp-content/uploads/Merkley-Schumer-SNAP-Resolution.pdf\"&gt;resolution&lt;/a&gt; via unanimous consent that would have forced the Department of Agriculture to fund Snap benefits for the month of November.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/03/senate-republicans-snap-funds-resolution\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}