{
  "updatedAt": "2025-11-30T18:36:42.930Z",
  "items": [
    {
      "title": "Lawmakers Suggest Follow-Up Boat Strike Could Be a War Crime",
      "url": "https://www.nytimes.com/2025/11/30/us/politics/trump-boat-strikes-war-crime.html",
      "summary": "Top Republicans have joined Democrats in demanding answers about the escalating military campaign the Trump administration says is aimed at targeting drug traffickers."
    },
    {
      "title": "Ukraine’s top negotiator resigns, but peace talks carry on.",
      "url": "https://www.nytimes.com/live/2025/11/30/us/trump-news/ukraines-top-negotiator-resigns-but-peace-talks-carry-on",
      "summary": ""
    },
    {
      "title": "The Political Price Shock of Data Centers and Electric Bills",
      "url": "https://www.nytimes.com/2025/11/30/us/politics/data-centers-electric-bills-georgia.html",
      "summary": "Democrats zeroed in on utilities and affordability to win Republican support in upset elections in Georgia and Virginia. Can the same playbook work in 2026?"
    },
    {
      "title": "Remembering WW2 Camps, Japanese Americans Fight Trump’s Immigration Crackdown",
      "url": "https://www.nytimes.com/2025/11/30/us/japanese-internment-camp-trump-immigration.html",
      "summary": "Japanese Americans are seeing parallels between the government’s incarceration of their families during World War II and the current detention of Latinos."
    },
    {
      "title": "4 Dead After Shooting at Banquet Hall in California",
      "url": "https://www.nytimes.com/2025/11/29/us/shooting-stockton-california.html",
      "summary": "The shooting in Stockton, a city in California’s Central Valley, left 11 others wounded. The authorities said they were looking for a suspect."
    },
    {
      "title": "Trump Frees Fraudster Just Days Into Seven-Year Prison Sentence",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/trump-david-gentile-commutation.html",
      "summary": "David Gentile had been found guilty for his role in what prosecutors described as a $1.6 billion scheme that defrauded thousands of investors."
    },
    {
      "title": "Four killed and 11 wounded in shooting at child’s party in California, officials say",
      "url": "https://www.theguardian.com/us-news/2025/nov/30/stockton-banquet-hall-shooting-california",
      "summary": "&lt;p&gt;Victims who died range from ‘juveniles to adults’ in attack on banquet hall in Stockton, county sheriff’s office says&lt;/p&gt;&lt;p&gt;Four people have died and eleven were wounded after a shooting at a family gathering in northern &lt;a href=\"https://www.theguardian.com/us-news/california\"&gt;California&lt;/a&gt; on Saturday night, police said.&lt;/p&gt;&lt;p&gt;The victims who died, who range in age from eight to 21 , were taken to local hospitals, Heather Brent, a spokesperson for the San Joaquin County sheriff’s office, said. “What we have confirmed at this time is that there was a banquet hall where a family was celebrating.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/30/stockton-banquet-hall-shooting-california\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Winter storm brings foot of snow to midwest over busiest US travel weekend",
      "url": "https://www.theguardian.com/us-news/2025/nov/30/midwest-winter-storm-thanksgiving-travel",
      "summary": "&lt;p&gt;Plane skidded off runway and 45 cars were piled up as 53 million were under winter weather alerts over Thanksgiving&lt;/p&gt;&lt;p&gt;A &lt;a href=\"https://www.theguardian.com/lifeandstyle/thanksgiving\"&gt;Thanksgiving&lt;/a&gt; weekend storm system brought over a foot of snow and strong winds across the US midwest and thunderstorms across the south, as &lt;a href=\"https://www.nbcnews.com/weather/winter-weather/winter-weather-threatening-holiday-travel-us-weekend-rcna246428\"&gt;53 million&lt;/a&gt; people from South Dakota to New York were under &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/27/thanksgiving-storm-travel-weather\"&gt;winter weather alerts&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;Over the weekend, ahead of one of the busiest travel days of the year on Sunday, a 45-car pile-up occurred on interstate 78 in Indiana and a Delta Air Lines plane skidded off the runway in Des Moines, Iowa, during landing.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/30/midwest-winter-storm-thanksgiving-travel\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}