{
  "updatedAt": "2025-09-06T18:41:16.334Z",
  "items": [
    {
      "title": "ICE Is Said to Have Begun Operation in the Boston Area",
      "url": "https://www.nytimes.com/2025/09/06/us/politics/ice-operation-boston.html",
      "summary": "The immigration crackdown is expected to last several weeks, sources with knowledge of the operation said."
    },
    {
      "title": "Grand Juries in D.C. Reject Wave of Charges Under Trump’s Crackdown",
      "url": "https://www.nytimes.com/2025/09/06/us/trump-dc-national-guard-grand-juries-crime.html",
      "summary": "The persistent rejections suggest that the grand jurors may have had enough of prosecutors seeking harsh charges in a highly politicized environment."
    },
    {
      "title": "Settlement Talks Stall Between Harvard and the Trump Administration",
      "url": "https://www.nytimes.com/2025/09/06/us/politics/harvard-trump-negotiations-stall.html",
      "summary": "One major reason is said to be an emerging divide within the administration over whether the current framework is too favorable to Harvard."
    },
    {
      "title": "Many Cities Say Yes to Federal Police Help, but No to ‘Occupation’",
      "url": "https://www.nytimes.com/2025/09/06/us/federal-law-enforcement-national-guard-policing.html",
      "summary": "Some mayors and police chiefs said they would welcome more traditional law enforcement cooperation with federal agents, but see the National Guard as a step too far."
    },
    {
      "title": "George Mason’s President, Gregory Washington, Will Not Apologize to the Trump Administration",
      "url": "https://www.nytimes.com/2025/09/06/us/george-mason-university-gregory-washington-trump-attack.html",
      "summary": "Gregory Washington, George Mason’s first Black president, runs a university that prizes diversity. That has made him a target of the Trump administration."
    },
    {
      "title": "Trump Says U.S. Military Has ‘Never Fought to Win’ Since World War II",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/trump-military-wars.html",
      "summary": "As he signed an order recognizing the Defense Department as the “Department of War,” President Trump said that the country “could have won every war, but we really chose to be very politically correct.”"
    },
    {
      "title": "Trump’s former surgeon general urges president to fire RFK Jr",
      "url": "https://www.theguardian.com/us-news/2025/sep/06/jerome-adams-trump-surgeon-blasts-rfk-jr",
      "summary": "&lt;p&gt;Jerome Adams cites vaccine policy and chaos at CDC and joins other officials in saying Kennedy is risking US health&lt;/p&gt;&lt;p&gt;The surgeon general from the first &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; on Saturday said that the US president should “absolutely” fire health secretary &lt;a href=\"https://www.theguardian.com/us-news/robert-f-kennedy-jr\"&gt;Robert F Kennedy Jr&lt;/a&gt; over his “dangerous” &lt;a href=\"https://www.theguardian.com/commentisfree/2025/aug/11/rfk-jr-trump-vaccine-research-avian-flu\"&gt;policies on vaccines&lt;/a&gt; and the Centers for Disease Control and Prevention (CDC).&lt;/p&gt;&lt;p&gt;Jerome Adams, who has become a pointed critic of the controversial public health decisions being swiftly rolled out in the second Trump administration, made his most fierce attack yet on what has been unfolding.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/06/jerome-adams-trump-surgeon-blasts-rfk-jr\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Legal capture of endangered manta ray sparks bipartisan outrage in Florida",
      "url": "https://www.theguardian.com/us-news/2025/sep/06/manta-ray-capture-florida-wildlife-permits",
      "summary": "&lt;p&gt;Haul for Abu Dhabi aquarium leads state officials to agree to review the issuing of ‘marine special activity licenses’&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/florida\"&gt;Florida&lt;/a&gt; authorities have agreed to review the issuing of special permits allowing companies to capture &lt;a href=\"https://www.theguardian.com/environment/endangeredspecies\"&gt;endangered creatures&lt;/a&gt; to sell, after an outcry over the netting of a huge manta ray for an aquarium in Abu Dhabi.&lt;/p&gt;&lt;p&gt;The review comes after a viral &lt;a href=\"https://www.facebook.com/reel/1116904387040385\"&gt;video&lt;/a&gt; released on 12 July showed a boat crew capturing a giant manta ray off a Panama City beach in Florida and pulling it onto their boat, sparking outrage among the community. A dolphin tour operator who witnessed and filmed the scene confronted the crew and asked whether they would release the manta ray, but they explained they had a legal permit.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/06/manta-ray-capture-florida-wildlife-permits\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}