{
  "updatedAt": "2025-10-07T12:54:30.421Z",
  "items": [
    {
      "title": "Here’s the latest.",
      "url": "https://www.nytimes.com/live/2025/10/07/us/trump-national-guard-illinois-texas/heres-the-latest",
      "summary": ""
    },
    {
      "title": "Supreme Court Hears Free Speech Challenge to Ban on Conversion Therapy",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/supreme-court-colorado-conversion-therapy.html",
      "summary": "The court’s ruling in the Colorado case will have implications for more than 20 other states with similar laws."
    },
    {
      "title": "Trump to Unveil Farmer Aid as China Shuns U.S. Crops",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/trump-farmers-aid-china-trade-war.html",
      "summary": "As it did in 2018, the White House plans to dole out relief funds to struggling U.S. farmers who have lost their biggest customer."
    },
    {
      "title": "In 2020, Trump Intervened in Portland’s Protests. They Got Even Worse",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/portland-trump.html",
      "summary": "Here are five lessons for cities in the president’s sights, like Chicago and Memphis, drawn from the one city targeted by Mr. Trump in his first term, Portland, Ore."
    },
    {
      "title": "As Blue Jays Advance, America’s Pastime Is in Canada’s Cross Hairs",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/trump-canada-blue-jays-yankees.html",
      "summary": "Political tensions remain high between the United States and Canada, making this a striking moment for the Toronto Blue Jays to be dominating the New York Yankees in October."
    },
    {
      "title": "In Tennessee Special Election, a Crowded Field for an Open Congressional Seat",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/in-tennessee-special-election-a-crowded-field-for-an-open-congressional-seat.html",
      "summary": "More than a dozen candidates are vying to represent the state’s Seventh Congressional District, which includes part of Nashville but was redrawn to favor Republicans."
    },
    {
      "title": "Trump threatens to invoke Insurrection Act as Bondi faces Senate – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Legal wrangles over troop deployments continue with attorney general also likely to face questions over Epstein files&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/07/pam-bondi-testimony-senate-trump-troop-deployments\"&gt;Pam Bondi to testify before Senate amid Trump’s troop deployments&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Also today, the supreme court will hear arguments in a precedent-setting case, where a Colorado-based therapist is arguing that the state’s ban on conversion practices – which attempt to change a patient’s sexual orientation or gender identity – violates her free speech.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Kaley Chiles&lt;/strong&gt;, a licensed counselor who is Christian, &lt;a href=\"https://www.supremecourt.gov/DocketPDF/24/24-539/331462/20241108125757340_USSC%20Petition%20for%20Writ%20of%20Certiorari.pdf\"&gt;contends&lt;/a&gt; the 2019 ban violates her first amendment rights to discuss her faith with patients. Chiles is represented by the conservative legal group Alliance Defending Freedom (ADF), who have brought several anti-abortion and anti-LGBTQ+ cases to the court in recent years.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Motorists help lift helicopter to rescue woman after crash on California highway",
      "url": "https://www.theguardian.com/us-news/2025/oct/07/motorists-lift-helicopter-rescue-crash-california-highway",
      "summary": "&lt;p&gt;Medical helicopter crashed on a Highway 50 in Sacramento, critically injuring three people aboard&lt;/p&gt;&lt;p&gt;A medical helicopter crashed on a highway in Sacramento, critically injuring three people aboard – including a woman who was pinned underneath and was rescued with the help of motorists who lifted part of the aircraft, according to officials.&lt;/p&gt;&lt;p&gt;The helicopter had taken a patient to a hospital and was on the way back to the place it had been dispatched from when it experienced an “in-air emergency” just after 7pm local time on Monday, said Justin Sylvia, a spokesperson for the Sacramento fire department. He said it looked like the helicopter crashed upside-down and left a large debris field.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/07/motorists-lift-helicopter-rescue-crash-california-highway\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}