{
  "updatedAt": "2025-09-08T13:38:58.819Z",
  "items": [
    {
      "title": "Raid on Georgia E.V. Battery Plant Raises New Risks for a Shaken Industry",
      "url": "https://www.nytimes.com/2025/09/08/us/georgia-immigration-raid-ev-battery-plant-hyundai-lg.html",
      "summary": "Foreign manufacturers were already dealing with tariffs and the end of E.V. tax credits. Now, they face greater scrutiny of their workers’ immigration status."
    },
    {
      "title": "Trial to Begin for Ryan Routh, Man Charged in Trump Assassination Attempt in Florida",
      "url": "https://www.nytimes.com/2025/09/08/us/ryan-routh-trial-trump-assassination-attempt.html",
      "summary": "Ryan Routh has pleaded not guilty and plans to defend himself in court. The most serious charge against him carries a sentence of up to life in prison."
    },
    {
      "title": "How Local Jails Are Helping ICE Detentions",
      "url": "https://www.nytimes.com/video/us/100000010374121/how-local-jails-are-helping-ice-detentions.html",
      "summary": "As ICE detains more immigrants and detention centers exceed capacity, the agency is turning to local jails. Allison McCann, a reporter and graphics editor for The New York Times, visited one jail holding detainees in Ohio."
    },
    {
      "title": "Miami Has a Padel ‘Obsession’",
      "url": "https://www.nytimes.com/2025/09/08/us/miami-has-a-padel-obsession.html",
      "summary": "Residents who love fitness and socializing — and can afford to play — cannot get enough of padel, the racket sport with international cachet."
    },
    {
      "title": "West Point Alumni Group Cancels Award Honoring Tom Hanks",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/tom-hanks-west-point-award.html",
      "summary": "The group was to bestow the Sylvanus Thayer Award on the actor, but it said it was canceling the event to focus on preparing academy cadets for the future."
    },
    {
      "title": "John Burton, 92, Dies; California Political Boss Who Staged a Comeback",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/john-burton-dead.html",
      "summary": "He left the House of Representatives while struggling with a crack addiction, his political career seemingly over. Actually, it had just begun."
    },
    {
      "title": "Trump tells foreign firms to ‘respect’ immigration laws after Hyundai raid – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
      "summary": "&lt;p&gt;President says he welcomes investments by overseas companies but adds they should ‘hire and train American workers’&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul\"&gt;300 South Koreans detained at Hyundai plant in US ‘to be released’&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Intent on vindication after spending four months in prison last year, &lt;strong&gt;Peter Navarro&lt;/strong&gt; asked a federal appeals court on Sunday night to force &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump’s&lt;/a&gt; justice department to explain why it would not defend his 2022 conviction for defying a &lt;a href=\"https://www.theguardian.com/us-news/us-capitol-breach\"&gt;January 6&lt;/a&gt; committee subpoena.&lt;/p&gt;&lt;p&gt;The request to the US court of appeals for the DC circuit is fraught for the department as it would have to confront the appearance that it &lt;a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cadc.40540/gov.uscourts.cadc.40540.2132720.0.pdf\"&gt;quietly dropped the case&lt;/a&gt; in order to shield Navarro after he was tapped as a senior adviser to the president.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Critics say BlackRock’s Minnesota utility bid will increase rates – and clean energy goals will suffer",
      "url": "https://www.theguardian.com/us-news/2025/sep/08/blackrock-minnesota-power-sale-allete",
      "summary": "&lt;p&gt;Sale opponents say private equity’s profit-seeking is at odds with reasonable rates and state’s goal to decarbonize&lt;/p&gt;&lt;p&gt;A bid by financial giant BlackRock to acquire a Minnesota electric utility could push up &lt;a href=\"https://www.theguardian.com/us-news/2025/aug/19/electricity-bills-increase-trump\"&gt;already-soaring&lt;/a&gt; utility bills, opponents warn.&lt;/p&gt;&lt;p&gt;The private equity firm Global Infrastructure Partners, a division of BlackRock, &lt;a href=\"https://www.duluthnewstribune.com/news/local/duluth-based-allete-agrees-to-6-8-billion-investment-partnership\"&gt;announced a $6.2bn deal last year&lt;/a&gt; to take over the parent company of a Duluth-based electric utility which serves more than 150,000 customers, if the state’s public utilities commission gives the green light.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/08/blackrock-minnesota-power-sale-allete\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}