{
  "updatedAt": "2025-11-01T06:35:08.972Z",
  "items": [
    {
      "title": "Judge Permanently Bars Trump From Requiring Proof of Citizenship for Voter Registration",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/trump-proof-citizenship-voter-registration.html",
      "summary": "The ruling on Friday found that Trump had usurped the power vested in Congress and the states to administer and oversee elections protocols."
    },
    {
      "title": "What Is Happening With SNAP Benefits During the Shutdown?",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/snap-benefits-shutdown.html",
      "summary": "President Trump said that he would heed court rulings ordering his administration to fund food stamps during the government shutdown, but there are complications."
    },
    {
      "title": "White House Limits Reporters’ Access to Press Secretary’s Office",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/trump-white-house-press.html",
      "summary": "The move broke from generations of precedent and added to the Trump administration’s growing list of restraints on the news media."
    },
    {
      "title": "Uncertainty Persists for Americans Waiting for Food Benefits After SNAP Ruling",
      "url": "https://www.nytimes.com/2025/10/31/us/snap-food-stamps-aid.html",
      "summary": "Judges on Friday ordered the federal government to continue providing food assistance during the shutdown. But benefits will still most likely be interrupted."
    },
    {
      "title": "Fact-Checking Trump’s Claim About SNAP and Partisanship",
      "url": "https://www.nytimes.com/2025/10/31/us/fact-check-trump-snap-food-stamps.html",
      "summary": "The president said a lapse in SNAP funding would “largely” hurt Democrats. But interruptions to the program will also affect Republicans."
    },
    {
      "title": "As the Shutdown Pain Grows, Trump Attends to Other Matters",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/trump-shutdown.html",
      "summary": "The president attended a Halloween party Friday and called attention to the marble renovation of a White House bathroom."
    },
    {
      "title": "Trump news at a glance: Friday rulings hamper administration on food stamps, voting access",
      "url": "https://www.theguardian.com/us-news/2025/oct/31/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;President Trump received a trio of legal setbacks – key US politics stories from 31 October at a glance&lt;/p&gt;&lt;p&gt;President Trump received a trio of legal setbacks Friday related to the government shutdown and his attempts to tweak voting access in US elections.&lt;/p&gt;&lt;p&gt;First, two federal judges issued back-to-back rulings in separate cases ordering the administration to use contingency funds to continue paying for food stamps under the Snap program.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/31/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump administration blocked from suspending Snap benefits for millions of Americans",
      "url": "https://www.theguardian.com/us-news/2025/oct/31/judge-blocks-trump-snap-suspension",
      "summary": "&lt;p&gt;One judge issued temporary restraining order while another judge ruled the government must continue to fund program that helps low-income households&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates\"&gt;US politics live – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Two federal judges issued back-to-back rulings on Friday in separate cases ordering the Trump administration to use contingency funds to continue paying for food stamps during the government shutdown.&lt;/p&gt;&lt;p&gt;A federal judge in &lt;a href=\"https://www.theguardian.com/us-news/rhode-island\"&gt;Rhode Island&lt;/a&gt; on Friday afternoon blocked the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; from suspending all food aid for millions of Americans, in a case brought by a group of US cities, non-profit organizations and a trade union.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/31/judge-blocks-trump-snap-suspension\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}