{
  "updatedAt": "2025-10-15T06:38:09.720Z",
  "items": [
    {
      "title": "Katie Porter Says She ‘Fell Short’ in Viral Video Moments",
      "url": "https://www.nytimes.com/2025/10/15/us/katie-porter-videos-response.html",
      "summary": "Videos surfaced last week showing the former congresswoman belittling a television reporter and berating an aide. Porter, who is running for California governor, pledged to do better."
    },
    {
      "title": "Woman Is Granted a Protective Order Against Representative Cory Mills",
      "url": "https://www.nytimes.com/2025/10/14/us/cory-mills-lindsey-langston-florida-rep.html",
      "summary": "Representative Cory Mills’s former girlfriend, Lindsey Langston, the reigning Miss United States, told a judge that he had threatened to release sexually explicit videos of her."
    },
    {
      "title": "Judge Temporarily Blocks Transfer of Miami Property for Trump Library",
      "url": "https://www.nytimes.com/2025/10/14/us/miami-trump-library.html",
      "summary": "A judge said that a state college had failed to provide reasonable public notice before taking steps to convey the land it owned."
    },
    {
      "title": "ICE Is Cracking Down on Chicago. Some Chicagoans Are Fighting Back.",
      "url": "https://www.nytimes.com/2025/10/14/us/chicago-ice-trump.html",
      "summary": "Residents have begun forming volunteer groups to monitor their neighborhoods for federal immigration agents. Others honk their horns or blow whistles when they see agents nearby."
    },
    {
      "title": "Trump Awards Charlie Kirk the Presidential Medal of Freedom",
      "url": "https://www.nytimes.com/2025/10/14/us/politics/trump-charlie-kirk-medal.html",
      "summary": "President Trump presented the medal to Charlie Kirk’s widow, Erika, on what would have been his 32nd birthday."
    },
    {
      "title": "Share Your Videos of ICE Interactions",
      "url": "https://www.nytimes.com/2025/10/14/us/videos-ice-interactions.html",
      "summary": "The Times is looking for examples of interactions between federal immigration agents and residents across the country."
    },
    {
      "title": "Overdose in America – a Guardian Series",
      "url": "https://www.theguardian.com/us-news/2025/oct/15/overdose-in-america-a-guardian-series",
      "summary": "&lt;p&gt;A series that examines the toll – state by state, county by county – of the US overdose crisis&lt;/p&gt;&lt;p&gt;This series is supported through philanthropic funding to &lt;a href=\"https://theguardian.org/\"&gt;theguardian.org&lt;/a&gt;, a US-based foundation that partners with the Guardian on independent editorial projects.&lt;/p&gt;&lt;p&gt;All of the journalism is editorially independent, commissioned and produced by our Guardian journalists. You can read more about content funding on the Guardian &lt;a href=\"https://www.theguardian.com/info/2016/jan/25/content-funding\"&gt;here&lt;/a&gt;. A full list of philanthropically supported editorial projects can be found &lt;a href=\"https://www.theguardian.com/info/2018/oct/02/philanthropic-partnerships-at-the-guardian\"&gt;here&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/15/overdose-in-america-a-guardian-series\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "‘The worst of all time’: Trump rails against ‘super bad’ Time magazine cover",
      "url": "https://www.theguardian.com/us-news/2025/oct/15/history-behind-donald-trump-time-magazine-fury-cover-picture",
      "summary": "&lt;p&gt;Despite the glowing story, the cover earned the ire of the US president with criticism of his appearance&lt;/p&gt;&lt;p&gt;It is a glowing story in a publication Donald Trump has long exalted – but for one catch. The cover picture, the president decreed, “may be the Worst of All Time”.&lt;/p&gt;&lt;p&gt;Time magazine’s paean to Trump’s role in brokering a &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/09/gaza-ceasefire-deal-trump-biggest-diplomatic-achievement-what-detail\"&gt;Gaza ceasefire&lt;/a&gt;, leading its 10 November issue, was &lt;a href=\"https://x.com/TIME/status/1977784098929385818\"&gt;accompanied by a photo&lt;/a&gt; of the president taken from below and with the sun behind his head.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/15/history-behind-donald-trump-time-magazine-fury-cover-picture\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}