{
  "updatedAt": "2025-09-07T18:41:34.418Z",
  "items": [
    {
      "title": "Trump Downplays Post Threatening Chicago, Saying He Wants to ‘Clean Up’ City",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/trump-chicago-war-us-open.html",
      "summary": "The president had said on social media that Chicago was “about to find out why it’s called the Department of WAR,” drawing a fierce rebuke from Democrats."
    },
    {
      "title": "Kennedy, Rejecting Data, Fuels Distrust of His Own Agencies",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/kennedy-health-vaccines-cdc.html",
      "summary": "By promoting suspicions about the institutions he oversees, critics say Robert F. Kennedy Jr. is jeopardizing public health. He says he is pursuing transparency."
    },
    {
      "title": "Marilyn Monroe’s Los Angeles Home Is Saved From Demolition",
      "url": "https://www.nytimes.com/2025/09/07/us/marilyn-monroe-house-los-angeles.html",
      "summary": "A judge denied a neighbor’s petition to raze the Spanish-style hacienda, which the City Council had declared a cultural landmark."
    },
    {
      "title": "Ruth Paine, Who Gave Lodging to Marina Oswald, Dies at 92",
      "url": "https://www.nytimes.com/2025/09/07/us/ruth-paine-dead.html",
      "summary": "Her knowledge of Lee Harvey Oswald and his wife made her a noteworthy witness during the Warren Commission’s investigation into the assassination of President John F. Kennedy."
    },
    {
      "title": "What We Know About the Hyundai-LG Plant Immigration Raid in Georgia",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/hyundai-plant-immigration-raid-georgia.html",
      "summary": "Several hundred workers, most of them South Korean nationals, were detained at the construction site of a sprawling electric vehicle battery plant on Thursday."
    },
    {
      "title": "Trump Tried to Kill the Infrastructure Law. Now He’s Getting Credit for Its Projects.",
      "url": "https://www.nytimes.com/2025/09/07/us/trump-infrastructure-signs.html",
      "summary": "Signs bearing President Trump’s name have gone up at major construction projects financed by the 2021 law, which he strenuously opposed ahead of its passage."
    },
    {
      "title": "300 South Koreans detained at Hyundai plant in US to be released, says Seoul",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul",
      "summary": "&lt;p&gt;Footage of raid by US immigration officials showed detained workers in handcuffs and with chains around their ankles&lt;/p&gt;&lt;p&gt;South Korea announced on Sunday that the roughly 300 of its nationals detained during an immigration raid in Georgia would be released and flown home, as the sudden detention of workers appeared to strain the longstanding diplomatic and economic relationship between the two nations.&lt;/p&gt;&lt;p&gt;Nearly 500 workers, among them at least 300 South Koreans and at least 23 Mexicans, were arrested at the Hyundai-LG battery plant in the city of Ellabell on Thursday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Republican condemns Vance for ‘despicable’ comments on Venezuelan boat strike",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/jd-vance-venezuelan-boat-strike-rand-paul",
      "summary": "&lt;p&gt;Rand Paul decries ‘thoughtless’ comment after vice-president defends strike against alleged drug traffickers&lt;/p&gt;&lt;p&gt;The Republican senator who heads the homeland security committee has criticized JD Vance for “despicable” comments apparently in support of extrajudicial military killings.&lt;/p&gt;&lt;p&gt;“Killing cartel members who poison our fellow citizens is the highest and best use of our military,” the vice-president said in an X post on Saturday, in defense of Tuesday’s US military &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/02/trump-venezuela-boat-lethal-strike\"&gt;strike&lt;/a&gt; against a Venezuelan boat in the Caribbean Sea, which killed 11 people the administration alleged were drug traffickers.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/07/jd-vance-venezuelan-boat-strike-rand-paul\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}