{
  "updatedAt": "2025-09-14T06:45:08.547Z",
  "items": [
    {
      "title": "Federal Judge Questions Deportations to Ghana",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/federal-judge-migrants-ghana.html",
      "summary": "A hearing in the case of five migrants deported to Ghana last week showed how earlier Supreme Court rulings have paved the way for President Trump’s mass deportation campaign."
    },
    {
      "title": "After Charlie Kirk Killing, Suspect Joked That His ‘Doppelganger’ Did It",
      "url": "https://www.nytimes.com/2025/09/13/us/kirk-killing-suspect-online-chat.html",
      "summary": "Before he was arrested on suspicion of carrying out the assassination, 22-year-old Tyler Robinson sent friends messages showing that he was closely following news about the killing."
    },
    {
      "title": "Mass Firing of Probationary Federal Employees Was Illegal, Judge Rules",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/probationary-employees-firing-illegal.html",
      "summary": "Months have passed since the lawsuit was filed, and many of the fired employees have moved on, the judge noted."
    },
    {
      "title": "Van Hollen Criticizes Democratic Leaders for Delay in Endorsing Mamdani",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/van-hollen-zohran-mamdani.html",
      "summary": "At an annual fund-raiser in Iowa, the Maryland Democrat said he supported Zohran Mamdani for mayor of New York City and said people were sick of “spineless politics.”"
    },
    {
      "title": "Wrestling Over Charlie Kirk’s Legacy and the Divide in America",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/charlie-kirk-legacy-trump.html",
      "summary": "Historians say the lessons of this particular time will depend on Americans themselves, and what kind of a nation they want it to be."
    },
    {
      "title": "Trump Escalates Attacks on Political Opponents After Charlie Kirk’s Killing",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/trump-kirk-political-opponents.html",
      "summary": "President Trump has promised to bring the killer to justice while using the moment to blame the left — and only the left — more broadly."
    },
    {
      "title": "Trump news at a glance: Kirk critics lose jobs amid rancour after killing",
      "url": "https://www.theguardian.com/us-news/2025/sep/14/trump-administration-charlie-kirk-news-updates-latest",
      "summary": "&lt;p&gt;Numerous firings reported as authorities search out commentary deemed offensive on conservative free speech advocate’s killing – key stories from 13 September 2025 at a glance&lt;/p&gt;&lt;p&gt;The killing of Charlie Kirk has prompted a crackdown by authorities on critical commentary, with numerous people losing their jobs over their reaction to the fatal shooting of the conservative activist and free speech advocate.&lt;/p&gt;&lt;p&gt;Those fired, suspended or censured in recent days include teachers, firefighters, journalists, politicians, a &lt;a href=\"https://www.foxnews.com/politics/secret-service-employee-who-celebrated-charlie-kirks-assassination-put-immediate-leave\"&gt;Secret Service employee&lt;/a&gt;, a &lt;a href=\"https://www.yahoo.com/news/articles/nasdaq-terminates-employee-over-social-180948755.html?guccounter=1\"&gt;junior strategist at Nasdaq&lt;/a&gt; and a &lt;a href=\"https://www.wral.com/news/local/panthers-employee-fired-controversial-comments-charlie-kirk-death-raleigh/\"&gt;worker for a prominent NFL team&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/14/trump-administration-charlie-kirk-news-updates-latest\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Questions linger about alleged shooter’s motivation for killing Charlie Kirk",
      "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-killing-alleged-shooter-motivation",
      "summary": "&lt;p&gt;Suspect’s background and politics are being pored over in aftermath of killing of far-right influencer&lt;/p&gt;&lt;p&gt;Though the suspect in the &lt;a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"&gt;killing of conservative activist Charlie Kirk&lt;/a&gt; was revealed by authorities on Friday, questions surrounding his identity and motivations have exacerbated intense US political debates in the aftermath of the shooting.&lt;/p&gt;&lt;p&gt;Authorities revealed Kirk’s suspected killer to be Tyler Robinson, a 22-year-old man who grew up in Washington, &lt;a href=\"https://www.theguardian.com/us-news/utah\"&gt;Utah&lt;/a&gt;, along the state’s south-western border.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-killing-alleged-shooter-motivation\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}