{
  "updatedAt": "2025-10-10T06:37:52.716Z",
  "items": [
    {
      "title": "Senate Passes Bipartisan $925 Billion Defense Policy Bill",
      "url": "https://www.nytimes.com/2025/10/09/us/senate-passes-bipartisan-925-billion-defense-policy-bill.html",
      "summary": "The legislation would provide a 3.8 percent pay raise for American troops, while funding weapons and overhauling military procurement."
    },
    {
      "title": "Judge Rejects ‘Unprecedented’ Indictment Amid Trump’s D.C. Clampdown",
      "url": "https://www.nytimes.com/2025/10/09/us/politics/judge-rejects-indictment-dc.html",
      "summary": "The federal magistrate judge, Zia M. Faruqui, accused prosecutors of relying on a “facially invalid” indictment to charge a man with felony gun possession."
    },
    {
      "title": "Federal Judge Temporarily Blocks Trump’s National Guard Deployment in Chicago Area",
      "url": "https://www.nytimes.com/2025/10/09/us/judge-national-guard-chicago-illinois.html",
      "summary": "Judge April M. Perry said the Trump administration had not established that sending in troops over the governor’s objection was legally justified. An appeal is likely."
    },
    {
      "title": "Letitia James Has Marshaled States to Sue Trump",
      "url": "https://www.nytimes.com/2025/10/09/us/politics/letitia-james-lawsuits-trump.html",
      "summary": "New York’s attorney general has joined colleagues nearly 40 times to confront the administration over myriad issues as the president pressures Democratic states."
    },
    {
      "title": "L.A. County Considers Emergency Declaration Over Immigration Raids",
      "url": "https://www.nytimes.com/2025/10/09/us/los-angeles-county-ice-raids-emergency.html",
      "summary": "The declaration would allow the Los Angeles County Board of Supervisors to enact an eviction moratorium and other protections for immigrants."
    },
    {
      "title": "What a National Guard Deployment Means",
      "url": "https://www.nytimes.com/video/us/100000010446054/how-trump-is-using-the-national-guard.html",
      "summary": "John Ismay, who reports on the Pentagon for The New York Times, describes what National Guard troops and civilian law enforcement are doing in cities where President Trump has mobilized them."
    },
    {
      "title": "US anti-fascism expert blocked from flying to Spain at airport",
      "url": "https://www.theguardian.com/us-news/2025/oct/09/anti-fascism-mark-bray-rutgers-university",
      "summary": "&lt;p&gt;Rutgers University professor who published book on antifa was informed at boarding gate that his trip was cancelled&lt;/p&gt;&lt;p&gt;A Rutgers University professor who taught a course on &lt;a href=\"https://www.theguardian.com/commentisfree/series/rise-against-fascism\"&gt;anti-fascism&lt;/a&gt; and was blocked from leaving the US for Spain on Wednesday night, &lt;a href=\"https://www.nytimes.com/2025/10/08/nyregion/rutgers-professor-threats-antifa.html?smid=nytcore-ios-share&amp;amp;referringSource=articleShare\"&gt;according to media reports&lt;/a&gt;, hours after Donald Trump hosted a White House roundtable highlighting the impact of antifa – or “anti-fascist” – far-left activists is now departing.&lt;/p&gt;&lt;p&gt;Mark Bray, an historian who published the 2017 book Antifa: the Anti-Fascist Handbook and has taught courses on anti-fascism at the New Jersey university, &lt;a href=\"https://bsky.app/profile/mark-bray.bsky.social/post/3m2sgs7rmek2z\"&gt;posted&lt;/a&gt; on the social media platform Bluesky that “Our plane to Spain is in the air!”. Bray was attempting to board a plane at Newark airport when he was informed at the boarding gate that the reservations for him and his family had been cancelled.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/09/anti-fascism-mark-bray-rutgers-university\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "New York attorney general calls bank fraud indictment ‘desperate weaponization of our justice system’ – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live",
      "summary": "&lt;p&gt;This blog has now closed. Read our &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/09/criminal-charges-letitia-james-new-york-attorney-general\"&gt;latest story here&lt;/a&gt;&lt;/p&gt;&lt;p&gt;The president has spent much of Thursday morning &lt;strong&gt;thanking his allies on Truth social for praising his diplomatic efforts in Gaza. &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;“I would like to thank Republican Congressman Brian Mast, of Florida, for his brilliant words and analysis on the return of the Hostages, and Peace in the Middle East, this morning on Fox &amp;amp; Friends. Thank you Brian!!!,” Trump &lt;a href=\"https://truthsocial.com/@realDonaldTrump/115344000556414178\"&gt;wrote in a post&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}