{
  "updatedAt": "2025-10-07T18:37:08.223Z",
  "items": [
    {
      "title": "Pressed on Justice Dept. Politicization, Bondi Goes on Attack",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/pam-bondi-hearing.html",
      "summary": "At a Senate committee hearing, the attorney general avoided answering pointed queries by repeatedly laying into her questioners and casting her responses as a defense of the Trump administration."
    },
    {
      "title": "Republican Senators Denounce Jack Smith Over Jan. 6 Scrutiny of Phone Records",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/republican-senators-jack-smith-phone-records.html",
      "summary": "At a hearing with Attorney General Pam Bondi, Republican senators seized on the collection of their phone records by the F.B.I. as proof of politicization by the Biden administration."
    },
    {
      "title": "Deputy Sheriff Is Killed by Suspect at Louisiana Courthouse",
      "url": "https://www.nytimes.com/2025/10/07/us/louisiana-courthouse-shooting-sheriff-deputy.html",
      "summary": "Another deputy was wounded, and the suspect was dead, the authorities said."
    },
    {
      "title": "What is the Alliance Defending Freedom?",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/alliance-defending-freedom.html",
      "summary": "The conservative Christian law firm and advocacy group has been involved in a number of recent cases, including challenges to abortion access and gay and transgender rights."
    },
    {
      "title": "More Than 20 States Have Banned Conversion Therapy for L.G.B.T.Q. Minors",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/conversion-therapy-state-bans.html",
      "summary": "The Supreme Court’s decision in a case challenging Colorado’s ban on conversion therapy for minors would have implications for many states with similar laws."
    },
    {
      "title": "White House May Try to Deny Back Pay to Furloughed Federal Workers",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/trump-back-pay-furloughed-workers-shutdown.html",
      "summary": "Union leaders and Democratic lawmakers say the move would run afoul of a law adopted under President Trump’s first term."
    },
    {
      "title": "Furloughed government workers may not be entitled to back pay, reports say, as Trump claims some jobs ‘will never come back’ – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
      "summary": "&lt;p&gt;White House memo reported by several US media outlets reveals plan to not guarantee back pay for federal workers who are working through the shutdown&lt;/p&gt;&lt;p&gt;Before we turn our attention to Capitol Hill, we’re also keeping an eye on Illinois today. On Monday, a federal judge did not immediately block the president’s move to deploy national guard troops, including hundreds from Texas, to Chicago.&lt;/p&gt;&lt;p&gt;Instead, the judge set a hearing for Thursday, leaving room for the military to make their way to the windy city as soon as today.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump says there is ‘natural conflict’ with Canada during Carney visit",
      "url": "https://www.theguardian.com/us-news/2025/oct/07/trump-says-there-is-natural-conflict-with-canada-during-carney-visit",
      "summary": "&lt;p&gt;US president offers few concessions on tariffs after durable alliance fractured by trade war and annexation threats&lt;/p&gt;&lt;p&gt;Donald Trump said there is “mutual love” but “natural conflict” between the US and Canada as he hailed progress towards a trade deal but offered few concrete concessions on &lt;a href=\"https://www.theguardian.com/us-news/2025/jul/31/trump-canada-tariffs-order\"&gt;steep US tariffs&lt;/a&gt; during a visit by the Canadian prime minister, &lt;a href=\"https://www.theguardian.com/world/mark-carney\"&gt;Mark Carney&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;Carney’s second visit to the US comes as one of the world’s most durable and amicable alliances has been fractured by Trump’s trade war and annexation threats. Among the topics up for discussion are trade and the United States-Mexico-Canada Agreement (USMCA), which is critical to Canada’s economy and is up for review next year.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/07/trump-says-there-is-natural-conflict-with-canada-during-carney-visit\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}