{
  "updatedAt": "2025-10-28T12:55:24.086Z",
  "items": [
    {
      "title": "Will Trump Meet Kim Jong-un Again? He’s Very Open to the Idea.",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/trump-kim-jong-un-north-korea.html",
      "summary": "President Trump has said he hopes the North Korean leader will reach out so they can meet again. But there has been no public response from Mr. Kim."
    },
    {
      "title": "Amid a Record Party Investment, Two Candidates for Governor Join Forces",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/amid-a-record-party-investment-two-candidates-for-governor-join-forces.html",
      "summary": "Representative Mikie Sherrill of New Jersey and former Representative Abigail Spanberger of Virginia will appear together on Wednesday, hoping to energize Democratic campaign volunteers, and voters."
    },
    {
      "title": "What to Know About Tear Gas, the Chemicals Federal Agents Are Using During Immigration Raids",
      "url": "https://www.nytimes.com/2025/10/28/us/tear-gas-chicago-immigration-enforcement.html",
      "summary": "The repeated use of tear gas by federal immigration officers in Chicago has renewed a debate about how chemical irritants should be used by law enforcement personnel."
    },
    {
      "title": "Judge Expected to Quiz Gregory Bovino Over Immigration Crackdown Tactics",
      "url": "https://www.nytimes.com/2025/10/28/us/chicago-bovino-tear-gas.html",
      "summary": "Gregory Bovino, a border patrol official who has become a public face of President Trump’s crackdown, was ordered to appear in a Chicago courtroom."
    },
    {
      "title": "A City Council Race in Arizona Turns Toxic Over Charlie Kirk’s Legacy",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/charlie-kirk-mesa-arizona.html",
      "summary": "By nationalizing a local election, Turning Point Action is trying to show it can carry on without its founder and recall a local Republican who endorsed Kamala Harris."
    },
    {
      "title": "A Twist in the Candy Cane Park Murder Investigation in Oregon",
      "url": "https://www.nytimes.com/2025/10/28/us/trump-cuts-candy-cane-park-killing-oregon.html",
      "summary": "An unlikely twist in the investigation of a killing in 1983 that still haunts a small town in Oregon."
    },
    {
      "title": "Trump and new Japanese prime minister share praise and vow to strengthen ‘remarkable’ relationship – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/28/donald-trump-sanae-takaichi-japan-trade-national-guard-us-politics-live",
      "summary": "&lt;p&gt;The president also suggested he could deploy the National Guard in more US cities at an address aboard the US naval base&lt;/p&gt;&lt;p&gt;In a &lt;a href=\"https://democrats-judiciary.house.gov/sites/evo-subsites/democrats-judiciary.house.gov/files/evo-media-document/2025-10-27-raskin-et-al-to-bondi-blanche-woodward-doj-re-trump-230m-payout_0.pdf\"&gt;new letter&lt;/a&gt;, House Democrats are warning three top Justice Department officials—including two who previously defended Donald Trump in criminal proceedings—that they could face prosecution if they approve Donald Trump’s suggestion of a $230 million payment from American taxpayers.&lt;/p&gt;&lt;p&gt;They are calling it “perhaps the most brazen violation” of constitutional anti-corruption provisions in US history.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/28/donald-trump-sanae-takaichi-japan-trade-national-guard-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Haitians helped boost Springfield’s economy – now they’re fleeing in fear of Trump",
      "url": "https://www.theguardian.com/us-news/2025/oct/28/springfield-ohio-economy-haitians-trump-immigration",
      "summary": "&lt;p&gt;Ohio city’s economic fortunes spiral and local businesses suffer as Haitians leave due to administration’s anti-immigrant rhetoric and policies&lt;/p&gt;&lt;p&gt;Every morning, Alicia Mercado makes the 50-minute drive from her home in Columbus to Springfield, where she runs the Adasa Latin Market store. She opened the business next to a Haitian restaurant in 2023, having spotted a gap in the market for Caribbean and Latin foods – the neighborhood’s Haitian population was booming at the time.&lt;/p&gt;&lt;p&gt;But over the past year, she says her business, which includes an international money transfer kiosk, has taken a major hit.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/28/springfield-ohio-economy-haitians-trump-immigration\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}