{
  "updatedAt": "2025-09-07T06:44:34.890Z",
  "items": [
    {
      "title": "Trump Tramples Congress’s Power, With Little Challenge From G.O.P.",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/trump-congresss-power.html",
      "summary": "On national security, spending and oversight, the president continues to undercut the legislative branch, and Republicans in charge have done little to stop him."
    },
    {
      "title": "L.A.P.D. Stops Security Services for Kamala Harris",
      "url": "https://www.nytimes.com/2025/09/06/us/lapd-kamala-harris-security.html",
      "summary": "The department had assigned officers to protect the former vice president after her Secret Service detail was terminated. Some criticized the use of the officers."
    },
    {
      "title": "Immigration Raid Exposes Tensions From Seoul to Washington to Rural Georgia",
      "url": "https://www.nytimes.com/2025/09/06/us/immigration-raid-georgia.html",
      "summary": "The raid at a Georgia plant being built with heavy investment from South Korea reveals strain as a rush to expand manufacturing in the United States clashes with an immigration crackdown."
    },
    {
      "title": "Tensions Mount as Trump Administration Threatens Federal Crackdown in Chicago",
      "url": "https://www.nytimes.com/2025/09/06/us/trump-chicago-ice-raids-immigration.html",
      "summary": "In a social media post, President Trump said Chicago was “about to find out why it’s called the Department of WAR.” Illinois officials condemned the message."
    },
    {
      "title": "Man Who Vanished Is Identified 52 Years Later, Bringing ‘Rest’ to His Sisters",
      "url": "https://www.nytimes.com/2025/09/06/us/algonquin-park-ontario-body.html",
      "summary": "Eric Singer left his Ohio home on his bicycle, never to be seen again. With the help of advances in DNA research, he was finally found."
    },
    {
      "title": "Justice Breyer Defends Judge Accused of Defying Supreme Court Order",
      "url": "https://www.nytimes.com/2025/09/06/us/politics/justice-breyer-boston-judge.html",
      "summary": "The justice’s comments reflected tensions within the judiciary, as trial judges struggle to interpret the Supreme Court’s often cryptic emergency orders."
    },
    {
      "title": "‘We have the people’: Bernie Sanders campaigns with Zohran Mamdani as New York mayoral race enters final stretch",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/we-have-the-people-bernie-sanders-campaigns-with-zohran-mamdani-as-new-york-mayoral-race-enters-final-stretch",
      "summary": "&lt;p&gt;Pair met with thunderous applause at town hall in Brooklyn as part of senator’s Fighting Oligarchy tour&lt;/p&gt;&lt;p&gt;Zohran Mamdani, the New York City mayoral frontrunner and Democratic nominee, joined the Vermont senator Bernie Sanders in a rousing town hall in Brooklyn on Saturday evening where the two addressed the growing threat of oligarchic control across the US and how to fight it.&lt;/p&gt;&lt;p&gt;The event, held at Sanders’ alma mater Brooklyn College, drew an audience of about 1,700 people. Mamdani and Sanders co-hosted the town hall as part of &lt;a href=\"https://www.theguardian.com/us-news/2025/mar/25/bernie-sanders-democrats-fight-oligarchy\"&gt;Sanders’ Fighting Oligarchy tour&lt;/a&gt;, which has included rallies in 20 states. Throughout the tour, the senator has been actively supporting and recruiting progressive candidates to run for office.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/07/we-have-the-people-bernie-sanders-campaigns-with-zohran-mamdani-as-new-york-mayoral-race-enters-final-stretch\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Mexican festivals in Chicago canceled amid Trump plans to deploy troops",
      "url": "https://www.theguardian.com/us-news/2025/sep/06/chicago-mexican-independence-day-trump",
      "summary": "&lt;p&gt;City and suburbs pull local events tied to Mexican Independence Day on 16 September&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt;’s plan to deploy national guard troops and federal immigration agents to Chicago is already having an impact on the city’s Mexican community.&lt;/p&gt;&lt;p&gt;Organizers have canceled several local events tied to Mexican Independence Day, which occurs on 16 September.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/06/chicago-mexican-independence-day-trump\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}