{
  "updatedAt": "2025-11-16T06:37:19.026Z",
  "items": [
    {
      "title": "How to Make Sense of Law Enforcement in the Streets",
      "url": "https://www.nytimes.com/video/us/politics/100000010484295/how-to-make-sense-of-law-enforcement-in-the-streets.html",
      "summary": "The variety of federal forces deployed to support President Trump’s mass deportation campaign and anticrime efforts continues to expand. Often, it can be difficult for the public to tell them apart, or to understand what powers each agency has."
    },
    {
      "title": "4 Dead After Suspected Migrant Boat Overturns Near a San Diego Area Beach",
      "url": "https://www.nytimes.com/2025/11/15/us/panga-boat-capsizes-imperial-beach.html",
      "summary": "The boat capsized off the coast, officials said. Four people were taken to a hospital and one person was taken into custody."
    },
    {
      "title": "U.S. Border Patrol Launches Operation in Charlotte, N.C.",
      "url": "https://www.nytimes.com/2025/11/15/us/us-border-patrol-charlotte-nc-immigration.html",
      "summary": "It is unclear how long the operation will last in North Carolina’s largest city, which has a growing immigrant population."
    },
    {
      "title": "Fetterman Is Released From the Hospital After a Fall",
      "url": "https://www.nytimes.com/2025/11/15/us/john-fetterman-fall-hospital-released.html",
      "summary": "The Pennsylvania senator was hospitalized on Thursday after he fell during a morning walk near his home in Braddock, Pa. He required 20 stitches."
    },
    {
      "title": "Man Who Stuffed Parakeets in His Pants Faces Smuggling Charge",
      "url": "https://www.nytimes.com/2025/11/15/us/parakeets-smuggling-in-pants.html",
      "summary": "The man was found with the heavily sedated birds in his underwear as he crossed the border from Mexico in late October, federal prosecutors said."
    },
    {
      "title": "Trump Pardons Two for Crimes Related to Jan. 6",
      "url": "https://www.nytimes.com/2025/11/15/us/politics/trump-pardons-jan-6.html",
      "summary": "Daniel Edwin Wilson and Suzanne Kaye had been convicted of crimes indirectly connected to the 2021 attack on the Capitol."
    },
    {
      "title": "Trump news at a glance: Marjorie Taylor Greene raises fears for her safety as row with Donald Trump escalates",
      "url": "https://www.theguardian.com/us-news/2025/nov/16/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;President’s one-time ally says she has been contacted by private security firms after denunciation by president. Key US politics stories from Saturday 15 November at a glance&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/marjorie-taylor-greene\"&gt;Marjorie Taylor Greene&lt;/a&gt;, a longtime Republican ally who previously fiercely defended &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; and his Maga movement, said on Saturday she had been contacted by private security firms “with warnings for my safety” after Trump announced on Friday he was withdrawing his support for and endorsement of the Georgia representative.&lt;/p&gt;&lt;p&gt;In a post on X, Greene said that “a hot bed of threats against me are being fueled and egged on by the most powerful man in the world”, without referring to Trump by name, adding it was “the man I supported and helped get elected”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/16/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Alice Wong, ‘luminary’ writer and disability rights activist, dies aged 51",
      "url": "https://www.theguardian.com/us-news/2025/nov/15/alice-wong-disability-rights-activist-dies-aged-51",
      "summary": "&lt;p&gt;Daughter of immigrants advocated for people with disabilities to have full autonomy over their lives&lt;/p&gt;&lt;p&gt;Alice Wong, a writer and disability rights activist who was born with muscular dystrophy and whose independence and writing inspired others, has died. She was 51.&lt;/p&gt;&lt;p&gt;Wong died Friday at a hospital in San Francisco due to an infection, said Sandy Ho, a close friend who has been in touch with Wong’s family.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/15/alice-wong-disability-rights-activist-dies-aged-51\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}