{
  "updatedAt": "2025-09-30T06:38:34.089Z",
  "items": [
    {
      "title": "Judge Reinstates Over 500 Voice of America Journalists and Staff",
      "url": "https://www.nytimes.com/2025/09/29/us/politics/voa-voice-of-america-layoffs.html",
      "summary": "The reversal of firings is the latest defeat that the Trump administration has incurred in its effort to close down the federal news organization."
    },
    {
      "title": "Iowa Superintendent Arrested by ICE Loses State License and Is Placed on Unpaid Leave",
      "url": "https://www.nytimes.com/2025/09/29/us/des-moines-superintendent-ice-roberts.html",
      "summary": "Immigration officials arrested Ian Roberts, the Des Moines Public Schools superintendent, on Friday and said he was in the country illegally."
    },
    {
      "title": "Government Shutdown Appears Imminent After Trump Meets With Democrats",
      "url": "https://www.nytimes.com/2025/09/29/us/politics/government-shutdown-trump-vance-congress.html",
      "summary": "President Trump met with Republican and Democratic leaders at the White House, but they emerged without a deal, as Democrats seek more health care funding."
    },
    {
      "title": "Lally Weymouth, Globe-Trotting Reporter and Scion of Graham Family, Dies at 82",
      "url": "https://www.nytimes.com/2025/09/29/us/politics/lally-weymouth-dead.html",
      "summary": "The daughter of Washington Post publisher Katharine Graham, she secured hard-to-land interviews with foreign leaders but found few opportunities for a leadership role."
    },
    {
      "title": "Trump Administration Will Deploy 100 National Guard Troops to Illinois",
      "url": "https://www.nytimes.com/2025/09/29/us/trump-national-guard-chicago.html",
      "summary": "The Department of Homeland Security requested the deployment over the objections of state officials, including Gov. JB Pritzker, a Democrat."
    },
    {
      "title": "Health Department Moves to Block Harvard From Future Research Grants",
      "url": "https://www.nytimes.com/2025/09/29/us/politics/trump-administration-harvard-research-grants.html",
      "summary": "The White House and Harvard University have struggled to negotiate an end to their monthslong dispute over the administration’s campaign to expunge “woke” ideology from campuses."
    },
    {
      "title": "‘I think we’re headed to a shutdown,’ says JD Vance as Mike Johnson calls for more time for negotiations – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
      "summary": "&lt;p&gt;This live blog is now closed. For the latest on US politics, read more of our coverage &lt;a href=\"https://www.theguardian.com/us-news/us-politics\"&gt;here&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Trump officials to announce plan to boost coal output&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The US is set to announce on Monday policies &lt;strong&gt;to try to boost the output of coal&lt;/strong&gt;, the interior department said, as the Trump administration seeks to reverse the decline of the fossil fuel’s use.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US justice department sues Minnesota over sanctuary city policies",
      "url": "https://www.theguardian.com/us-news/2025/sep/29/justice-department-sues-minnesota-sanctuary-city",
      "summary": "&lt;p&gt;State is latest to face legal threats in the course of Trump administration’s brutal deportation campaign&lt;/p&gt;&lt;p&gt;The justice department has sued the state of Minnesota over its sanctuary city immigration policies, making it the latest locality to face legal threats as the Trump administration attempts to carry out the president’s campaign promise of mass deportations.&lt;/p&gt;&lt;p&gt;“Minnesota officials are jeopardizing the safety of their own citizens by allowing illegal aliens to circumvent the legal process,” Pamela Bondi, the attorney general, said in &lt;a href=\"https://www.justice.gov/opa/pr/justice-department-sues-minnesota-over-sanctuary-policies\"&gt;a statement&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/29/justice-department-sues-minnesota-sanctuary-city\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}