{
  "updatedAt": "2025-11-10T06:41:39.872Z",
  "items": [
    {
      "title": "Six Takeaways From the Senate Deal to End the Shutdown",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/takeaways-senate-democrats-shutdown.html",
      "summary": "For 40 days, Senator Chuck Schumer kept his caucus unified. But an end approached without Democrats achieving an extension of expiring health insurance subsidies."
    },
    {
      "title": "In Alaska and Hawaii, Higher Food Prices Intensified SNAP Anxiety",
      "url": "https://www.nytimes.com/2025/11/09/us/alaska-hawaii-high-food-prices-snap.html",
      "summary": "Some residents are receiving benefits, but the uncertainty over the past weeks has burdened many in the two states, where the cost of food is the highest in the nation."
    },
    {
      "title": "Sean Duffy Juggles Shutdown Roles on Flight Safety and Trump Support",
      "url": "https://www.nytimes.com/2025/11/09/us/politics/duffy-faa-air-travel-shutdown.html",
      "summary": "With near-daily TV appearances, the transportation secretary has emerged as the face of the Trump administration amid the shutdown."
    },
    {
      "title": "Senate Moves Toward Ending Shutdown After Democratic Defectors Relent",
      "url": "https://www.nytimes.com/2025/11/09/us/politics/government-shutdown-senate-vote.html",
      "summary": "A small but critical group of Democrats backed legislation to fund the government, providing the votes to move forward with a spending package that would end the shutdown in coming days."
    },
    {
      "title": "Federal Judge, Warning of ‘Existential Threat’ to Democracy, Resigns",
      "url": "https://www.nytimes.com/2025/11/09/us/politics/mark-wolf-federal-judge-resigns.html",
      "summary": "Judge Mark L. Wolf, writing in The Atlantic, said he was stepping down to speak out against the “assault on the rule of law” by President Trump, whom he accused of “targeting his adversaries.”"
    },
    {
      "title": "Michelle Obama Criticizes Trump’s East Wing Demolition",
      "url": "https://www.nytimes.com/2025/11/09/us/politics/michelle-obama-east-wing.html",
      "summary": "The president’s ballroom project will transform one of the most recognizable buildings in the world and could nearly double its size."
    },
    {
      "title": "Trump news at a glance: eight Democrats join Republicans to advance funding bill",
      "url": "https://www.theguardian.com/us-news/2025/nov/10/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;Bill, a first step to ending the shutdown, will still need to be deliberated and passed by the Senate, and win approval in the house. Key US politics stories from 9 November at a glance&lt;/p&gt;&lt;p&gt;The first step toward ending the US government shutdown has been made after a handful of Democrats and dozens of Republicans voted to advance legislation in the Senate.&lt;/p&gt;&lt;p&gt;The funding bill will still need to be deliberated and passed by the Senate and approved by the House to end what has been the longest government shutdown in US history.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/10/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Senate advances funding bill to end longest US government shutdown in history",
      "url": "https://www.theguardian.com/us-news/2025/nov/10/us-government-shutdown-update-senate-funding-bill",
      "summary": "&lt;p&gt;The amended package will still have to be passed by the House and sent to Trump for his signature, a process that could take days&lt;/p&gt;&lt;p&gt;The Senate on Sunday made significant progress towards ending the&lt;a href=\"https://www.theguardian.com/us-news/us-federal-government-shutdown-2025\"&gt; longest US government shutdown in history&lt;/a&gt;, narrowly advancing a compromise bill to reauthorize funding and undo the layoffs of some employees.&lt;/p&gt;&lt;p&gt;But the measure, which resulted from days of talks between a handful of Democratic and Republican senators, leaves out the healthcare subsidies that Democrats had demanded for weeks. Most Democratic senators rejected it, as did many of the party’s lawmakers in the House of Representatives, which will have to vote to approve it before the government can reopen.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/10/us-government-shutdown-update-senate-funding-bill\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}