{
  "updatedAt": "2025-11-24T18:39:56.623Z",
  "items": [
    {
      "title": "Venezuelan Diaspora Divided on Trump’s Military Strategy",
      "url": "https://www.nytimes.com/2025/11/24/us/venezuelan-diaspora-critics-us-military-intervention.html",
      "summary": "Differences of opinion, complicated by unease over President Trump’s immigration policies, are creating tense divisions among Venezuelans in South Florida."
    },
    {
      "title": "A Stand Against Coal Could Push Oakland Toward Bankruptcy",
      "url": "https://www.nytimes.com/2025/11/24/us/oakland-coal-port-budget-bankruptcy.html",
      "summary": "After Oakland, Calif., reneged on a contract allowing coal shipments, a Kentucky company went under. Courts say the city must now pay hundreds of millions of dollars."
    },
    {
      "title": "Why a Man With U.S. Ties Fought for Russia in Ukraine",
      "url": "https://www.nytimes.com/2025/11/24/us/politics/russian-soldier-war.html",
      "summary": "Col. Andrei Demurenko’s war story began at Fort Leavenworth, Kan., at a moment of hope and peace. It ended with a mortar blast in Ukraine."
    },
    {
      "title": "The Best Baseball Team Behind Bars",
      "url": "https://www.nytimes.com/2025/11/24/us/san-quentin-prison-baseball-team.html",
      "summary": "The San Quentin Giants’ opponents are impressed. But what about the parole board that decides the players’ fate?"
    },
    {
      "title": "Billionaires Have a Bigger Role in Higher Education Under President Trump",
      "url": "https://www.nytimes.com/2025/11/24/us/billionaires-influence-universities-trump.html",
      "summary": "A new set of billionaires with an interest in higher education has helped oust college presidents and even assisted the Trump administration in its effort to overhaul the industry."
    },
    {
      "title": "X Displays Users’ Locations, Fueling Scrutiny Over Political Accounts",
      "url": "https://www.nytimes.com/2025/11/24/us/politics/x-twitter-location-maga-controversy.html",
      "summary": "Online sleuths quickly found that some accounts posting about U.S. politics, including those in support of the MAGA movement, appeared not to be based in the United States."
    },
    {
      "title": "Pentagon says it is investigating senator Mark Kelly after he joined lawmakers telling military to refuse illegal orders – live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates",
      "summary": "&lt;p&gt;Pentagon, which usually tries to appear apolitical, threatens Democratic senator from Arizona with investigation over video calling for troops to refuse unlawful orders&lt;/p&gt;&lt;p&gt;The president was online early today, and fired off a Truth Social post at 5:38am touting the economic impact that his sweeping tariffs will soon have on the country. He also noted that countries’ efforts to stockpile US goods ahead of the levies kicking in was “wearing thin”.&lt;/p&gt;&lt;p&gt;“These payments will be RECORD SETTING, and put our Nation on a new and unprecedented course,” he wrote. “This Tariff POWER will bring America National Security and Wealth the likes of which has never been seen before.”&lt;/p&gt;&lt;p&gt;Those opposing us are serving hostile foreign interests that are not aligned with the success, safety and prosperity of the USA. They couldn’t care less about us. I look so much forward to the United States Supreme Court’s decision on this urgent and time sensitive matter,” he added.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump administration cancels temporary asylum for Myanmar nationals living in US",
      "url": "https://www.theguardian.com/us-news/2025/nov/24/trump-cancels-asylum-myanmar",
      "summary": "&lt;p&gt;Homeland security claims country being ruled by military dictatorship ‘no longer continues to meet conditions’ for Temporary Protected Status&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates\"&gt;US politics live – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; announced it will cancel temporary asylum for around 10,000 Myanmar nationals living in the US, despite the country being ruled by a military dictatorship that has a record of executing dissidents.&lt;/p&gt;&lt;p&gt;On Monday the Department of Homeland Security said it was terminating the designation of Burma (Myanmar) for Temporary Protected Status relief. It claimed that after reviewing conditions in Myanmar and consulting with appropriate US government agencies, “the secretary (Kristi Noem) determined that Burma no longer continues to meet the conditions” for TPS designation.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/24/trump-cancels-asylum-myanmar\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}