{
  "updatedAt": "2025-11-19T18:39:27.945Z",
  "items": [
    {
      "title": "Saudi Arabia’s Return to Washington",
      "url": "https://www.nytimes.com/video/us/politics/100000010531003/saudi-arabias-return-to-washington.html",
      "summary": "David Sanger, a White House and national security correspondent, describes how the crown prince of Saudi Arabia, a pariah after the killing of Jamal Khashoggi, has become a dealmaker in Washington."
    },
    {
      "title": "Trump Says He Will Approve the Epstein Files Release, but Some May Be Withheld",
      "url": "https://www.nytimes.com/2025/11/19/us/politics/trump-epstein-files-loopholes.html",
      "summary": "The bill has not yet been presented to the president, and it wasn’t clear when it might reach his desk."
    },
    {
      "title": "F.B.I. Trainee Sues After Being Abruptly Fired Over Display of Gay Pride Flag",
      "url": "https://www.nytimes.com/2025/11/19/us/politics/fbi-gay-pride-flag-lawsuit.html",
      "summary": "He described his dismissal as the latest move by senior F.B.I. officials to play politics, damaging morale and hindering the bureau’s ability to carry out its public safety mission."
    },
    {
      "title": "White House Nominates Consumer Bureau Director Amid Efforts to Shut Agency",
      "url": "https://www.nytimes.com/2025/11/19/us/politics/consumer-bureau-director-nominee-stuart-levenbach.html",
      "summary": "The nomination was a tactical move that will extend Russell T. Vought’s time as acting director of the Consumer Financial Protection Bureau."
    },
    {
      "title": "Tom Steyer Will Run for California Governor in 2026 Race",
      "url": "https://www.nytimes.com/2025/11/19/us/tom-steyer-california-governor-2026.html",
      "summary": "Tom Steyer, who ran for president in 2020 and funded an effort to impeach President Trump, will join the crowded field trying to succeed Gov. Gavin Newsom."
    },
    {
      "title": "Trump’s Tariffs Sent Trade Plummeting in August",
      "url": "https://www.nytimes.com/2025/11/19/us/politics/trumps-tariffs-trade-data.html",
      "summary": "The steep tariffs President Trump issued in August led to a contraction in imports and the trade deficit, newly released data shows."
    },
    {
      "title": "Justice department will release Epstein files within 30 days, says US attorney general – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/19/us-congress-epstein-files-donald-trump-saudi-arabia-redistricting-latest-news-updates",
      "summary": "&lt;p&gt;Pam Bondi speaks after US Senate passes bill to release files – but agency may hold back material that could affect a Trump-ordered investigation&lt;/p&gt;&lt;p&gt;One quick note, &lt;strong&gt;there haven’t been any changes to Donald Trump’s schedule today, per the press pool&lt;/strong&gt;. Which means, as of now, the president doesn’t have any time allotted to sign the bill forcing the justice department to release the full batch of Jeffrey Epstein files.&lt;/p&gt;&lt;p&gt;We’ll keep you updated if things change throughout the day.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/19/us-congress-epstein-files-donald-trump-saudi-arabia-redistricting-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Were you affected by the Palisades fire in Los Angeles? We would like to hear from you",
      "url": "https://www.theguardian.com/us-news/2025/nov/19/pacific-palisades-wildfires-los-angeles",
      "summary": "&lt;p&gt;We would like to speak to people who lost their homes in the wildfire and learn how they’re preparing for the holidays&lt;/p&gt;&lt;p&gt;The Pacific Palisades fire – the&lt;a href=\"https://www.wildfirela.org/history/\"&gt; most destructive&lt;/a&gt; in Los Angeles history – killed 12 people and destroyed more than 6,800 structures earlier this year, turning swaths of &lt;a href=\"https://www.theguardian.com/us-news/2025/jan/09/california-wildfires-pacific-palisades-los-angeles\"&gt;western Los Angeles into a wasteland&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;We would like to speak to people who lost their homes in the wildfire and learn how they are approaching the upcoming holiday season.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/19/pacific-palisades-wildfires-los-angeles\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}