{
  "updatedAt": "2025-11-30T06:39:22.636Z",
  "items": [
    {
      "title": "4 Dead After Shooting at Banquet Hall in California",
      "url": "https://www.nytimes.com/2025/11/29/us/shooting-stockton-california.html",
      "summary": "The shooting in Stockton, a city in California’s Central Valley, left 11 others wounded. The authorities said they were looking for a suspect."
    },
    {
      "title": "Trump Frees Fraudster Just Days Into Seven-Year Prison Sentence",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/trump-david-gentile-commutation.html",
      "summary": "David Gentile had been found guilty for his role in what prosecutors described as a $1.6 billion scheme that defrauded thousands of investors."
    },
    {
      "title": "Webster Springs, W.Va. United In Grief Over Death of National Guard Specialist Sarah Beckstrom",
      "url": "https://www.nytimes.com/2025/11/29/us/national-guard-shooting-beckstrom-webster-springs.html",
      "summary": "In Webster Springs, everyone knows one another. When National Guard Specialist Sarah Beckstrom was killed, that connection was even further strengthened."
    },
    {
      "title": "Top Trump Aides to Meet With Ukrainians in Florida on Sunday",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/trump-aides-ukraine-florida-meeting.html",
      "summary": "Secretary of State Marco Rubio, Steve Witkoff and Jared Kushner plan to discuss peace terms again after an uproar over a 28-point proposal drafted with Russian input."
    },
    {
      "title": "Afghans Who Assisted U.S. During the War Underwent Rigorous Vetting",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/afghans-cia-vetting.html",
      "summary": "Former officials said the C.I.A. diligently assessed those who partnered with its forces, like the man accused of shooting two National Guard members in Washington."
    },
    {
      "title": "Utah Hiker Rescued With His Children Faces Abuse and Torture Charges",
      "url": "https://www.nytimes.com/2025/11/29/us/utah-dad-child-abuse-hike.html",
      "summary": "The man was initially hailed for his efforts to protect his daughter, 8, and two sons, 4 and 2, but the authorities concluded that he put them at risk by taking them on perilous terrain."
    },
    {
      "title": "All the president’s millions: how the Trumps are turning the presidency into riches",
      "url": "https://www.theguardian.com/us-news/ng-interactive/2025/nov/30/all-the-presidents-millions-how-the-trumps-are-turning-the-presidency-into-riches",
      "summary": "&lt;p&gt;From Vietnam to the Balkans, Donald Trump’s family has launched a global dealmaking blitz since his re-election&lt;/p&gt;&lt;p&gt;A crusading prosecutor in the Balkans comes under pressure to drop a big case. Vietnamese villagers learn they are to be evicted. A convicted crypto kingpin in the Gulf receives a pardon.&lt;/p&gt;&lt;p&gt;All have one thing in common: they appear to be connected to the Trump family’s campaign to amass riches around the world. Since Donald Trump’s re-election a year ago, warnings that his use of presidential power to advance personal interests is corroding American democracy have grown ever louder. What is less understood – and perhaps even more dangerous – is the damage this is doing everywhere else.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/nov/30/all-the-presidents-millions-how-the-trumps-are-turning-the-presidency-into-riches\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "At least four killed in shooting at child’s birthday party in northern California",
      "url": "https://www.theguardian.com/us-news/2025/nov/30/stockton-banquet-hall-shooting-california",
      "summary": "&lt;p&gt;San Joaquin County sheriff’s office says children were among the victims in possible ‘targeted’ attack on a banquet hall in Stockton&lt;/p&gt;&lt;p&gt;Four people have died after 14 people were shot at a family gathering in northern &lt;a href=\"https://www.theguardian.com/us-news/california\"&gt;California&lt;/a&gt; on Saturday night, police said.&lt;/p&gt;&lt;p&gt;Heather Brent, a spokesperson for the San Joaquin County sheriff’s office, said children and adults were among the victims of the shooting at Stockton.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/30/stockton-banquet-hall-shooting-california\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}