{
  "updatedAt": "2025-10-18T06:34:35.615Z",
  "items": [
    {
      "title": "Military Plans to Fire Artillery Over California Freeway on Saturday",
      "url": "https://www.nytimes.com/2025/10/18/us/artillery-interstate-5-marines.html",
      "summary": "Rounds were fired on Friday across Interstate 5 as part of a test run for Saturday’s event at Camp Pendleton in Southern California."
    },
    {
      "title": "10 Injured in Balcony Collapse in Cincinnati",
      "url": "https://www.nytimes.com/2025/10/18/us/cincinnati-balcony-collapse.html",
      "summary": "People gathered at a house near the University of Cincinnati tumbled to the ground from a third-floor balcony, the fire department said. One person was in critical condition."
    },
    {
      "title": "U.S. Agency That Protects Nuclear Arsenal to Furlough Workers",
      "url": "https://www.nytimes.com/2025/10/17/us/politics/nuclear-weapons-agency-furloughs-shutdown.html",
      "summary": "The National Nuclear Security Administration said 1,400 workers would be affected by Monday."
    },
    {
      "title": "A bid to give Charlie Kirk an honorary degree from the Air Force Academy was withdrawn.",
      "url": "https://www.nytimes.com/live/2025/10/17/us/trump-news-zelensky/a-bid-to-give-charlie-kirk-an-honorary-degree-from-the-air-force-academy-was-withdrawn",
      "summary": ""
    },
    {
      "title": "Trump Backs Off Suggestion to Give Tomahawks to Ukraine, Again Deferring to Putin",
      "url": "https://www.nytimes.com/2025/10/17/us/politics/trump-zelensky-putin-tomahawks.html",
      "summary": "At the White House, President Volodymyr Zelensky of Ukraine made the case for why a weapons sale would help end the war. Mr. Trump at first seemed receptive, then expressed reservations."
    },
    {
      "title": "Prosecutor Who Rejected Trump’s Pressure to Charge James Is Fired",
      "url": "https://www.nytimes.com/2025/10/17/us/politics/trump-prosecutor-fired-letitia-james.html",
      "summary": "The dismissal was the latest fallout from attempts by career Justice Department officials to impede the president’s wide-ranging campaign of retribution. The prosecutor’s deputy was also fired."
    },
    {
      "title": "Trump says he has commuted sentence of George Santos in federal fraud case",
      "url": "https://www.theguardian.com/us-news/2025/oct/17/trump-commuted-sentence-george-santos",
      "summary": "&lt;p&gt;Former Republican US representative walks free after being sentenced in April to more than seven years in prison for deceiving donors and stealing identities of 11 people&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; announced on Friday he had commuted the sentence of George Santos, the disgraced former New York representative and serial fabulist who had been sentenced to more than seven years in prison after a short-lived political career marked by outlandish fabrications and fraudulent scheming.&lt;/p&gt;&lt;p&gt;Santos left the Federal Correctional Institution Fairton in New Jersey just hours later and was “on his way home”, his attorney Joseph Murray told Agence France-Presse by phone late on Friday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/17/trump-commuted-sentence-george-santos\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "At least 15 detained after protesters and police clash outside Chicago Ice center",
      "url": "https://www.theguardian.com/us-news/2025/oct/17/ice-chicago-protesters-arrests-broadview-facility",
      "summary": "&lt;p&gt;Officers reportedly tackled and dragged several people after authorities told demonstrators to stay in ‘protest zones’&lt;/p&gt;&lt;p&gt;At least 15 people were &lt;a href=\"https://wgntv.com/news/operation-midway-blitz/at-least-15-detained-as-protesters-demonstrate-outside-broadview-ice-facility-again/\"&gt;taken&lt;/a&gt; into custody outside the Broadview Ice detention center in the Chicago area after heated confrontations between Illinois state police and protesters on Friday.&lt;/p&gt;&lt;p&gt;Authorities had instructed demonstrators to remain in designated “protest zones”, but tensions escalated when officers moved to clear the roadway.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/17/ice-chicago-protesters-arrests-broadview-facility\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}