{
  "updatedAt": "2025-11-22T12:49:03.536Z",
  "items": [
    {
      "title": "New Orleans, a City of Service Workers, Braces for an Immigration Crackdown",
      "url": "https://www.nytimes.com/2025/11/22/us/new-orleans-a-city-of-service-workers-braces-for-an-immigration-crackdown.html",
      "summary": "Louisiana officials have been eager for a federal intervention, but planned Border Patrol operations have stoked fear in the city’s immigrant work force."
    },
    {
      "title": "Trump Offers a Ukraine Peace Plan the Kremlin Can Love",
      "url": "https://www.nytimes.com/2025/11/22/us/politics/trump-ukraine-russia-peace-plan-kremlin.html",
      "summary": "While President Trump at times suggested he was willing to bolster support for Ukraine, he has repeatedly accommodated Russia’s demands."
    },
    {
      "title": "In North Carolina, the Border Patrol’s Presence Divides a Swing State",
      "url": "https://www.nytimes.com/2025/11/22/us/north-carolina-border-patrol-immigration-politics.html",
      "summary": "Images of federal agents chasing immigrants have rattled many. Others see evidence of an effective crackdown. It remains to be seen whether the operation might sway voters next year."
    },
    {
      "title": "As Democrats Look to a New Generation, John Larson Hangs On",
      "url": "https://www.nytimes.com/2025/11/22/us/politics/john-larson-connecticut-congress-election.html",
      "summary": "The 77-year-old Connecticut Democrat is facing primary challenges from people who say he’s too old and has been around too long. He says his age and experience are his strength."
    },
    {
      "title": "In Charlotte, Border Patrol Arrests Send Families Into Hiding",
      "url": "https://www.nytimes.com/video/us/100000010532310/charlotte-immigration-arrests.html",
      "summary": "After Border Patrol agents showed up to an afterschool care facility for immigrant children in Charlotte, N.C., staff members mobilized to deliver food and essentials to local families in hiding. The New York Times spoke to one mother with three children who said they have not left their home in several days."
    },
    {
      "title": "The Battle Between Pasadena and U.C.L.A Over the Rose Bowl",
      "url": "https://www.nytimes.com/2025/11/22/us/rose-bowl-pasadena-ucla.html",
      "summary": "The storied stadium is at the center of a battle between Pasadena and U.C.L.A. that’s about money, nostalgia, geography and so much more."
    },
    {
      "title": "Marjorie Taylor Greene could have led the anti-Trump resistance but the mob boss got his way",
      "url": "https://www.theguardian.com/us-news/2025/nov/22/marjorie-taylor-greene-anti-trump-republican-analysis",
      "summary": "&lt;p&gt;The Maga star won on the Epstein files and could have founded a Republican resistance movement but is instead the latest dissenter to head for the exit&lt;/p&gt;&lt;p&gt;It has been a head-spinning 48 hours in Washington. Liberal TV host Rachel Maddow showed up at the funeral of conservative vice-president Dick Cheney. Donald &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/21/trump-mamdani-white-house-new-york\"&gt;Trump embraced Zohran Mamdani&lt;/a&gt;, a democratic socialist set to be the first Muslim mayor of New York, like a brother.&lt;/p&gt;&lt;p&gt;And then Marjorie Taylor Greene, a Trump acolyte-turned-nemesis who bested him over the release of the Jeffrey Epstein files, stunned the political establishment again. In what should have been her hour of triumph, the Maga star abruptly &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/21/marjorie-taylor-greene-resigns\"&gt;announced that she was quitting&lt;/a&gt; the House of Representatives.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/22/marjorie-taylor-greene-anti-trump-republican-analysis\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Ignorance is bliss: rightwing media largely keeps quiet on Trump-Epstein saga",
      "url": "https://www.theguardian.com/us-news/2025/nov/22/rightwing-media-trump-epstein-files",
      "summary": "&lt;p&gt;Fox News and other conservative networks have mostly avoided covering the president’s ties to the sex trafficker&lt;/p&gt;&lt;p&gt;When House Democrats released emails which showed Jeffrey Epstein claiming Donald Trump “knew about the girls”, rightwing news channels in the US reacted the same way: with silence.&lt;/p&gt;&lt;p&gt;Viewers of Fox News and other conservative networks would have had no idea that the president &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/12/jeffrey-epstein-new-emails-donald-trump\"&gt;allegedly spent hours&lt;/a&gt; at Epstein’s home with one of his victims. Rightwing media largely kept quiet on all of it, apart from &lt;a href=\"https://www.thedailybeast.com/flustered-hannity-struggles-to-contain-guest-talking-trump-dementia-on-air/\"&gt;a notable slip&lt;/a&gt; when a progressive guest on Sean Hannity’s show repeatedly told his audience: “Trump’s all over the Epstein files.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/22/rightwing-media-trump-epstein-files\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}