{
  "updatedAt": "2025-10-06T06:38:26.305Z",
  "items": [
    {
      "title": "Trump Calls Deadly Strikes on Boats in Caribbean an ‘Act of Kindness’",
      "url": "https://www.nytimes.com/2025/10/05/us/politics/trump-caribbean-strikes-drugs-kindness.html",
      "summary": "The president, speaking aboard an aircraft carrier off Norfolk, Va., repeated his claims that the boats were trafficking drugs bound for the United States."
    },
    {
      "title": "Skydiving Instructor Dies After Being Separated From Student, Officials Say",
      "url": "https://www.nytimes.com/2025/10/05/us/skydiving-instructor-dead-nashville.html",
      "summary": "The student, who had minor injuries, was rescued after being lodged in a tree in Nashville. The instructor was “presumed to have fallen from the sky without a parachute,” the police said."
    },
    {
      "title": "Trump Renews Layoff Threats as Shutdown Accusations Continue to Fly",
      "url": "https://www.nytimes.com/2025/10/05/us/politics/trump-democrats-shutdown.html",
      "summary": "Senator Chuck Schumer and Speaker Mike Johnson each accused the other of not being “serious” about talks to end the shutdown as the government was closed for a fifth day."
    },
    {
      "title": "Deputy Charged With Murder Knelt on Inmate’s Back, Affidavit Says",
      "url": "https://www.nytimes.com/2025/10/05/us/inmate-murder-kansas-adair-fatherley.html",
      "summary": "A recently released affidavit relates new details about the July death in a Kansas jail of a man with medical problems who was handcuffed and face down on a bunk."
    },
    {
      "title": "2 Motorists Charged in Chicago, Including One Shot by Federal Agent",
      "url": "https://www.nytimes.com/2025/10/05/us/politics/chicago-motorists-charged-border-patrol.html",
      "summary": "The account in the federal criminal complaint, which differs significantly from an earlier homeland security statement, says the motorists rammed officers’ vehicle and that an agent shot one when she drove her car at him."
    },
    {
      "title": "Ian Roberts, Des Moines Superintendent, Had a Story Too Good to Be True",
      "url": "https://www.nytimes.com/2025/10/05/us/des-moines-iowa-superintendent-ian-roberts-immigration-ice.html",
      "summary": "Ian Roberts rose through the ranks of American education with talent, charm and a riveting back story. He was also hiding a shocking secret."
    },
    {
      "title": "Trump news at a glance: Democrats say administration refusing shutdown talks as president repeats threat of firings",
      "url": "https://www.theguardian.com/us-news/2025/oct/06/trump-administration-news-updates-today-latest",
      "summary": "&lt;p&gt;Chuck Schumer says administration has ‘refused to talk with us’. Key US politics stories from 5 October at a glance&lt;/p&gt;&lt;p&gt;The Trump administration will start mass layoffs of federal workers if the president decides negotiations to end the government shutdown are “absolutely going nowhere,” a senior White House official has said.&lt;/p&gt;&lt;p&gt;Kevin Hassett told CNN he still saw a chance that Democrats would back down, but added that Trump was “getting ready to act” if he has to.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/06/trump-administration-news-updates-today-latest\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US struck another boat illegally carrying drugs off Venezuela coast, Trump says",
      "url": "https://www.theguardian.com/us-news/2025/oct/05/trump-drug-boat-strike-venezuela",
      "summary": "&lt;p&gt;President said US would turn attention to drug trafficking happening on land during speech at navy ceremony&lt;/p&gt;&lt;p&gt;US forces on Saturday evening struck another vessel illegally carrying drugs off the coast of &lt;a href=\"https://www.theguardian.com/world/venezuela\"&gt;Venezuela&lt;/a&gt;, &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; said on Sunday to thousands of sailors at a ceremony celebrating the US navy’s 250th anniversary. He added that the US would also start looking at drug trafficking happening on land.&lt;/p&gt;&lt;p&gt;Trump made the comment during a speech at Naval Station Norfolk in Virginia, next to the Harry S Truman aircraft carrier. It was not immediately clear if he was referencing a &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/03/hegseth-venezuela-deadly-boat-strike\"&gt;strike announced on Friday&lt;/a&gt; by defense secretary Pete Hegseth.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/05/trump-drug-boat-strike-venezuela\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}