{
  "updatedAt": "2025-10-23T06:38:47.925Z",
  "items": [
    {
      "title": "Newsom Says Benioff Is Still ‘Family’ Despite the National Guard Remarks",
      "url": "https://www.nytimes.com/2025/10/22/us/gavin-newsom-marc-benioff.html",
      "summary": "Gov. Gavin Newsom has a long relationship with Marc Benioff, the chief executive of Salesforce, that dates back to a different era in San Francisco."
    },
    {
      "title": "Pelosi Says Police May Arrest Federal Agents Who Violate California Law",
      "url": "https://www.nytimes.com/2025/10/22/us/politics/nancy-pelosi-ice-agent-arrest.html",
      "summary": "The San Francisco district attorney said in an interview that she came up with the strategy after seeing federal agents repeatedly roughing up people in Los Angeles and Chicago."
    },
    {
      "title": "What to Know About the White House East Wing and Its History",
      "url": "https://www.nytimes.com/2025/10/22/us/politics/east-wing-white-house.html",
      "summary": "The East Wing has been a base for the first lady, an entryway for social functions and an emergency bunker."
    },
    {
      "title": "Trump Imposes Sanctions on Russian Oil Companies as His Frustration With Putin Mounts",
      "url": "https://www.nytimes.com/2025/10/22/us/politics/trump-sanctions-russia-ukraine.html",
      "summary": "The sanctions are among the most significant measures that the United States has taken against the Russian energy sector since the beginning of the war in Ukraine."
    },
    {
      "title": "Senator Merkley Warns of Authoritarianism Under Trump in Nearly 23-Hour Speech",
      "url": "https://www.nytimes.com/2025/10/22/us/politics/senator-merkley-speech-trump.html",
      "summary": "The Oregon Democrat achieved a goal of topping the previous longest speech by a senator from his state."
    },
    {
      "title": "The White House Wrecking Ball",
      "url": "https://www.nytimes.com/2025/10/22/us/politics/trump-white-house-demolition.html",
      "summary": "President Trump’s demolition of the East Wing has struck a nerve in Washington and beyond."
    },
    {
      "title": "Cuomo condemned over racist AI ad depicting ‘criminals for Zohran Mamdani’",
      "url": "https://www.theguardian.com/us-news/2025/oct/23/cuomo-zohran-mamdani-ai-ad",
      "summary": "&lt;p&gt;Official X accounts posts and then deletes AI-generated attack ad that prompts widespread denunciation&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/22/key-takeaways-new-york-final-mayoral-debate\"&gt;Personal attacks rather than policy: key takeaways from New York’s final mayoral debate&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;New York City mayoral hopeful Andrew Cuomo has been widely labeled as racist after his official X account posted – and then deleted – an AI-generated ad depicting “criminals for Zohran Mamdani”.&lt;/p&gt;&lt;p&gt;Not even 20 minutes into the second mayoral debate, Cuomo’s official account, @andrewcuomo, tweeted the video. It was reshared by many before being deleted.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/23/cuomo-zohran-mamdani-ai-ad\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Personal attacks rather than policy: key takeaways from New York’s final mayoral debate",
      "url": "https://www.theguardian.com/us-news/2025/oct/22/key-takeaways-new-york-final-mayoral-debate",
      "summary": "&lt;p&gt;Candidates jockeyed for advantage during debate, but were unlikely to change voters’ minds before election day&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/zohran-mamdani\"&gt;Zohran Mamdani&lt;/a&gt;, the Democratic nominee and current frontrunner for New York City mayor, faced off with &lt;a href=\"https://www.theguardian.com/us-news/andrew-cuomo\"&gt;Andrew Cuomo&lt;/a&gt;, the former New York governor now running as an independent, and Curtis Sliwa, the &lt;a href=\"https://www.theguardian.com/us-news/republicans\"&gt;Republican&lt;/a&gt; candidate, at the second and final New York mayoral election debate on Wednesday night.&lt;/p&gt;&lt;p&gt;Here are some key takeaways from the evening.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/22/key-takeaways-new-york-final-mayoral-debate\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}