{
  "updatedAt": "2025-11-11T12:55:54.995Z",
  "items": [
    {
      "title": "Police Chase Driver Across Southern California Until She Escapes Into Mexico",
      "url": "https://www.nytimes.com/2025/11/11/us/car-chase-police-mexico-la.html",
      "summary": "The woman stole a minivan, police said, beginning a dramatic pursuit that spanned four counties and reached speeds of 90 miles per hour."
    },
    {
      "title": "The NYC Demographic Trends That Shaped Mamdani’s Win",
      "url": "https://www.nytimes.com/2025/11/11/us/mamdani-nyc-voters-election-demographics.html",
      "summary": "Moderate Black voters and young progressives favored Zohran Mamdani for mayor, while Andrew Cuomo won many wealthy New Yorkers and those who voted for Donald Trump."
    },
    {
      "title": "Dismantled by DOGE, a Foreign Policy Center Finds New Life",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/kennan-institute-doge-trump.html",
      "summary": "The Kennan Institute, which researches Russia and the surrounding region, has re-emerged in a form that is smaller but more impervious to government control."
    },
    {
      "title": "For Trump, Nothing Was Off Limits During the Shutdown",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/trump-government-shutdown.html",
      "summary": "President Trump pressured Democrats by taking punishing actions no previous administration ever took during a shutdown."
    },
    {
      "title": "Shutdown Deal Revives Democratic Infighting",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/shutdown-deal-revives-democratic-infighting.html",
      "summary": "The agreement prompted a backlash within the party, not only against the Democratic defectors who supported it, but against Senator Chuck Schumer, the leader who did not."
    },
    {
      "title": "Trump Asks Supreme Court to Overturn Verdict in E. Jean Carroll Case",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/trump-supreme-court-e-jean-carroll.html",
      "summary": "The president said the assertions behind a judgment that he sexually abused and defamed the writer were “implausible” and “unsubstantiated.”"
    },
    {
      "title": "Can Donald Trump sue the BBC for $1bn and which party would win?",
      "url": "https://www.theguardian.com/us-news/2025/nov/11/can-donald-trump-sue-bbc-which-party-would-win",
      "summary": "&lt;p&gt;US president has said he will bring proceedings if the documentary containing an edited speech from 6 January 2021 is not retracted&lt;/p&gt;&lt;p&gt;Donald Trump has grabbed the headlines after threatening to sue the BBC for $1bn (£760m) for what the corporation has accepted was a misleading edit of his speech on 6 January 2021 during the Capitol Hill insurrection. Here the Guardian examines the US president’s potential path to bringing and winning a libel claim.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/11/can-donald-trump-sue-bbc-which-party-would-win\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Senate approves deal to end shutdown with Democrats riven by splits – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/11/donald-trump-us-government-shutdown-senate-democrats-republicans-politics-live-news-updates",
      "summary": "&lt;p&gt;Deal will now head to the House but many in the Democrats are enraged with colleagues who supported the measure, and with minority leader Chuck Schumer&lt;/p&gt;&lt;p&gt;Donald Trump has threatened to sue the BBC for $1bn (£760m) after accusations that the corporation was failing in its duty of impartiality over the editing of the US president’s speech on 6 January 2021 for a Panorama programme.&lt;/p&gt;&lt;p&gt;Lawyers for the US president said that the BBC must retract the Panorama documentary by Friday or face a lawsuit for “no less” than $1bn, according to reports. The BBC has confirmed it had received a letter and said it will respond in due course.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/11/donald-trump-us-government-shutdown-senate-democrats-republicans-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}