{
  "updatedAt": "2025-10-21T18:36:59.635Z",
  "items": [
    {
      "title": "Trump Said to Demand Justice Dept. Pay Him $230 Million for Past Cases",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/trump-justice-department-compensation.html",
      "summary": "Senior department officials who were defense lawyers for the president and those in his orbit are now in jobs that typically must approve any such payout, underscoring potential ethical conflicts."
    },
    {
      "title": "A 200-Year-Old Precedent Holds the Key to Trump’s Troop Deployment",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/supreme-court-national-guard-precedent.html",
      "summary": "The administration says the ruling, stemming from the seizure of an old mare, forbids judges from second-guessing his use of the National Guard."
    },
    {
      "title": "Man Who Wrote ‘So I Raped You’ Is Sentenced to 2 to 4 Years in Prison",
      "url": "https://www.nytimes.com/2025/10/21/us/pennsylvania-student-rape-messages-sentencing.html",
      "summary": "Ian Cleary sent Facebook messages to Shannon Keeler six years after he sexually assaulted her when they were college students in Pennsylvania, prosecutors said."
    },
    {
      "title": "Trump Will Not Meet With Putin Soon, Official Says in a Reversal",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/trump-putin-ukraine-meeting.html",
      "summary": "President Trump said last week he planned to speak with Russia’s leader in “two weeks or so” about Ukraine."
    },
    {
      "title": "Trump Officials Move Toward Deal With University of Virginia After Standoff",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/trump-virginia-university.html",
      "summary": "The Trump administration is closing in on a deal with the University of Virginia, four months after government pressure forced the school’s previous president to resign."
    },
    {
      "title": "Plane Lands After Pilots Fear Someone Is Trying to Enter Cockpit",
      "url": "https://www.nytimes.com/2025/10/21/us/plane-lands-cockpit.html",
      "summary": "A problem with an intercom led to uncertainty. No one was hurt."
    },
    {
      "title": "No plan for Trump-Putin meeting in ‘immediate future’, White House says – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates",
      "summary": "&lt;p&gt;White House announcement walks back US president’s announcement of a meeting in Hungary; official says secretary Rubio and foreign minister Lavrov had ‘productive call’&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/world/2025/oct/21/plans-for-trump-putin-talks-in-budapest-shelved\"&gt;US shelves plans for Trump-Putin talks in Budapest&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;The Central Intelligence Agency is providing the bulk of the intelligence used to carry out the controversial lethal air strikes by the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; against small, fast-going boats in the Caribbean Sea suspected of carrying drugs from Venezuela, according to three sources familiar with the operations.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Experts say the agency’s central role means much of the evidence used to select which alleged smugglers to kill on the open sea will almost certainly remain secret.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump’s nomination of Paul Ingrassia loses Republican support following racist text messages",
      "url": "https://www.theguardian.com/us-news/2025/oct/21/trump-nomination-paul-ingrassia-racist-texts",
      "summary": "&lt;p&gt;Ingrassia, Trump’s pick to lead the office of special counsel, allegedly described himself as having ‘a Nazi streak’&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates\"&gt;US politics live – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump’s&lt;/a&gt; nomination of a conservative attorney and commentator to oversee federal whistleblower protections appeared to be collapsing after his racist text messages surfaced this week and the Republican Senate leader suggested the White House should withdraw the pick.&lt;/p&gt;&lt;p&gt;Paul Ingrassia, currently a White House liaison at the Department of Homeland Security, previously advocated for making 6 January a &lt;a href=\"https://x.com/PaulIngrassia/status/1868739699734360563\"&gt;national holiday&lt;/a&gt; and publicly questioned whether the 7 October 2023 Hamas attack was a “psyop”. But the fans were flamed again on Monday &lt;a href=\"https://www.politico.com/news/2025/10/20/paul-ingrassia-racist-text-messages-nazi-00613608\"&gt;after Politico reported text messages&lt;/a&gt; in which Ingrassia allegedly described himself as having “a Nazi streak” and suggested Martin Luther King Jr Day should be “tossed into the seventh circle of hell”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/21/trump-nomination-paul-ingrassia-racist-texts\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}