{
  "updatedAt": "2025-09-25T06:52:47.342Z",
  "items": [
    {
      "title": "Were You Assigned Full Books to Read in High School English? Tell Us.",
      "url": "https://www.nytimes.com/2025/09/24/us/education-books-callout.html",
      "summary": "We’re asking because the reading scores of American 12th graders are at record lows."
    },
    {
      "title": "Trump Administration Eyes More Mass Layoffs if Government Shuts Down",
      "url": "https://www.nytimes.com/2025/09/24/us/politics/trump-shutdown-layoffs.html",
      "summary": "The president’s top aides told agencies to prepare for potential firings if Congress cannot extend funding before the end of Sept. 30."
    },
    {
      "title": "Taylor Budowich, Longtime Trump Aide and Deputy Chief of Staff, to Depart the White House",
      "url": "https://www.nytimes.com/2025/09/24/us/politics/taylor-budowich-trump-white-house.html",
      "summary": "Taylor Budowich, a longtime Trump aide, played a large role in the president’s political operation after he left office in 2021."
    },
    {
      "title": "Journalist Held by ICE Faces ‘Imminent’ Deportation, His Lawyers Say",
      "url": "https://www.nytimes.com/2025/09/24/us/politics/mario-guevara-journalist-deportation.html",
      "summary": "The journalist, Mario Guevara, has been in Immigration and Customs Enforcement custody since June, when he was arrested while covering a “No Kings” protest outside Atlanta."
    },
    {
      "title": "Immigrant Rights Groups Condemn Violent Rhetoric Against ICE and  Immigrants",
      "url": "https://www.nytimes.com/2025/09/24/us/ice-dallas-shooting-reaction-response.html",
      "summary": "In a tense national debate, inflammatory language is being singled out."
    },
    {
      "title": "With His Pivot on Ukraine, Trump May Be Washing His Hands of the War",
      "url": "https://www.nytimes.com/2025/09/24/us/politics/trump-ukraine.html",
      "summary": "President Trump has shown dwindling interest in mediating a peace accord, joining European “security guarantees” for Ukraine or providing aid and intelligence to the Ukrainians."
    },
    {
      "title": "Trump claims he was victim of ‘triple sabotage at the UN’ and demands investigation – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
      "summary": "&lt;p&gt;This liveblog is now closed. You can find more of our politics coverage &lt;a href=\"https://www.theguardian.com/us-news/us-politics\"&gt;here&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The Kremlin on Wednesday brushed off a comment by US president Donald Trump describing Russia as a “paper tiger”, and said president Vladimir Putin valued his efforts to resolve the Ukraine conflict.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Kremlin spokesperson Dmitry Peskov said that Russia was a bear, not a tiger, and “there is no such thing as a paper bear”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: Obama says the US caught between two visions of the future as he criticises the president",
      "url": "https://www.theguardian.com/us-news/2025/sep/25/president-trump-administration-news-today-latest",
      "summary": "&lt;p&gt;Obama said Donald Trump’s claims linking paracetamol to autism in infants is ‘violence against the truth’. Key US politics stories from 24 September 2025&lt;/p&gt;&lt;p&gt;Barack Obama has said the US is in the middle of a “tug of war” between two visions of the future, criticising progressives for becoming “smug” and “complacent” while populists pushed a conservative vision.&lt;/p&gt;&lt;p&gt;The former US president said on one side was the progressive view in which change comes through democracy, while the other, driven by populists including Trump, see a return to an older, more conservative worldview.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/25/president-trump-administration-news-today-latest\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}