{
  "updatedAt": "2025-11-29T12:52:38.406Z",
  "items": [
    {
      "title": "Political Confusion as Texas Awaits Supreme Court’s Ruling on Redistricting",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/texas-gerrymander.html",
      "summary": "A decision on the state’s new congressional map will affect five House seats and could help determine control of the chamber next year."
    },
    {
      "title": "Ahead of Primary Elections, Time Is Running Out in the Fight Over Congressional Maps",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/congressional-maps-voting-calendar.html",
      "summary": "As partisan battles rage and courts wrangle proposals, the relentless pace of the calendar will force states to act — or land in murky legal ground."
    },
    {
      "title": "Republicans Flipped South Texas. Can a Moderate Tejano Singer Take It Back?",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/bobby-pulido.html",
      "summary": "The star power of Latin Grammy Award-winning Bobby Pulido has Democrats dreaming of taking a U.S. House district in South Texas, even though Republicans have redrawn it in their favor."
    },
    {
      "title": "Inside Trump’s Push to Make the White House Ballroom as Big as Possible",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/trump-white-house-ballroom.html",
      "summary": "President Trump’s ever-growing vision has caused tension with contractors. His architect has taken a step back as the president personally manages the project."
    },
    {
      "title": "How Fraud Swamped Minnesota’s Social Services System on Tim Walz’s Watch",
      "url": "https://www.nytimes.com/2025/11/29/us/fraud-minnesota-somali.html",
      "summary": "Prosecutors say members of the Somali diaspora, a group with growing political power, were largely responsible. President Trump has drawn national attention to the scandal amid his crackdown on immigration."
    },
    {
      "title": "State Department Boosts Resources to Process Business Visas for South Koreans",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/state-dept-south-korea-visas.html",
      "summary": "The Trump administration has been trying to repair the damage from the detention of hundreds of South Koreans in an immigration raid in Georgia."
    },
    {
      "title": "They tried to overturn the 2020 US election. Now, they hold power in Trump’s Washington",
      "url": "https://www.theguardian.com/us-news/2025/nov/29/2020-election-deniers-trump",
      "summary": "&lt;p&gt;Those who tried to overturn the 2020 election now occupy key federal roles, shaping rules and sowing doubt for 2026&lt;/p&gt;&lt;p&gt;The people who tried to overturn the &lt;a href=\"https://www.theguardian.com/us-news/ng-interactive/2020/dec/08/us-election-results-2020-joe-biden-defeats-donald-trump-to-win-presidency\"&gt;2020 election&lt;/a&gt; have more power than ever – and they plan to use it.&lt;/p&gt;&lt;p&gt;Bolstered by the president, they have prominent roles in key parts of the federal government. Harmeet Dhillon, a lawyer who &lt;a href=\"https://coloradonewsline.com/2025/04/04/repub/senate-confirms-election-denier-trump/\"&gt;helped advance&lt;/a&gt; Donald Trump’s claims of a stolen election in 2020, now leads the civil rights division of the justice department. An election denier, Heather Honey, &lt;a href=\"https://www.politico.com/news/2025/08/26/dhs-election-security-2020-election-conspiracy-00527453\"&gt;now serves as&lt;/a&gt; the deputy assistant secretary for election integrity in the department of homeland security. Kurt Olsen, an attorney involved in the “stop the steal” movement, is now a special government employee &lt;a href=\"https://www.wsj.com/politics/elections/white-house-hires-stop-the-steal-lawyer-to-investigate-2020-election-claims-6395d322?gaa_at=eafs&amp;amp;gaa_n=AWEtsqcLbnNAjYyEj_wbTG2vMmLf3ZkWNW0I6w9noNC_obbQrN_bg26e9gaAhnXzvXw%3D&amp;amp;gaa_ts=692714dc&amp;amp;gaa_sig=hO81mb_6Owg0o3RZGjloSV7GuPYhPrVZjcr2e0ARaZnHFevV7AWn4bNmMO4QK694nH2vDFy50ACn6sNbn8wWeQ%3D%3D\"&gt;investigating the 2020 election&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/29/2020-election-deniers-trump\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump’s hate-filled rant ignores facts on immigrant crime and economic benefits",
      "url": "https://www.theguardian.com/us-news/2025/nov/29/trumps-hate-filled-rant-ignores-facts-on-immigrant-and-economic-benefits",
      "summary": "&lt;p&gt;In the wake of the deadly Washington DC shooting, Trump claimed immigrants are ‘destroying everything America stands for’. Here’s what the data shows&lt;/p&gt;&lt;p&gt;Donald Trump’s hateful, falsehood-filled rant on Thursday blaming immigrants for crime, “social dysfunction” and economic hardship is refuted by a wide range of immigration statistics, which show clearly that immigrants dramatically &lt;a href=\"https://www.migrationpolicy.org/content/explainer-immigrants-and-us-economy\"&gt;bolster the US economy&lt;/a&gt; and commit crimes at far &lt;a href=\"https://www.ucdavis.edu/curiosity/blog/do-immigrants-get-incarcerated-more\"&gt;lower rates&lt;/a&gt; than people born in the US.&lt;/p&gt;&lt;p&gt;On Thursday evening, Trump condemned immigrants in &lt;a href=\"https://x.com/RapidResponse47/status/1994262111145365516\"&gt;a broad and vicious invective&lt;/a&gt;, painting them as “illegal and disruptive populations” and attacking “those that hate, steal, murder and destroy everything that America stands for”. He vowed to block all migration from “third world countries” to allow the “US system to fully recover”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/29/trumps-hate-filled-rant-ignores-facts-on-immigrant-and-economic-benefits\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}