{
  "updatedAt": "2025-10-29T06:40:28.616Z",
  "items": [
    {
      "title": "Trump Suggests He Knows He Can’t Run Again: ‘It’s Too Bad’",
      "url": "https://www.nytimes.com/2025/10/29/us/politics/third-term-limit.html",
      "summary": "Despite the Constitution’s two-term limit, Trump had mused for months about a third term."
    },
    {
      "title": "Federal Judge Disqualifies Trump-Backed Prosecutor in Los Angeles",
      "url": "https://www.nytimes.com/2025/10/28/us/us-attorney-bill-essayli-los-angeles-ruling.html",
      "summary": "The court ruled that Bill Essayli had been acting “unlawfully” as U.S. attorney in Los Angeles but that he could stay on as the office’s top deputy for now."
    },
    {
      "title": "Appeals Court to Reconsider Oregon National Guard Deployment Trump Wants",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/trump-national-guard-oregon-court.html",
      "summary": "Judges in the Ninth Circuit voted to have a larger panel reconsider a decision that could have allowed President Trump to use soldiers at the Portland, Ore., immigration building."
    },
    {
      "title": "White House Fires Arts Commission Overseeing Trump’s D.C. Building Projects",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/trump-white-house-commission-fine-arts.html",
      "summary": "The Commission of Fine Arts, an independent federal agency, was established by Congress to advise the president on urban planning and historical preservation."
    },
    {
      "title": "Trump Officials in Charge of Food Stamps Leave Their Posts",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/trump-usda-food-nutrition.html",
      "summary": "The departures of the head of the Agriculture Department’s Food and Nutrition Service and a senior policy adviser spurred worries on Capitol Hill as food aid benefits could halt."
    },
    {
      "title": "Newsom Hires US Attorney Fired by Trump",
      "url": "https://www.nytimes.com/2025/10/28/us/trump-fired-us-attorney-michele-beckwith-new-job.html",
      "summary": "Michele Beckwith was ousted by President Trump less than six hours after instructing a top immigration official to abide by the Constitution in his immigration raids."
    },
    {
      "title": "Trump and Xi talks could end months of global economic chaos",
      "url": "https://www.theguardian.com/us-news/2025/oct/29/trump-xi-talks-rare-earths-tariffs-us-china",
      "summary": "&lt;p&gt;High on agenda for the leaders of the US and China will be rare earths and tariffs, with a chance of a relationship reset&lt;/p&gt;&lt;p&gt;Ahead of Thursday’s long-awaited first &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/28/trump-and-xi-talks-what-will-be-on-the-agenda-when-us-president-meets-chinas-leader\"&gt;meeting&lt;/a&gt; between Donald Trump and Xi Jinping since the US president’s return to office, officials from both sides have been hammering out the contours of what a trade deal between Washington and Beijing might look like, an agreement that could bring an end to months of global economic chaos caused by the US-China trade war.&lt;/p&gt;&lt;p&gt;The two leaders have not met in person since 2019. Since then, the war in Ukraine and increasing concern in Washington about China’s technological advances, as well as longstanding issues about the imbalanced US-China trade relationship, have strained the bonds between the two superpowers.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/29/trump-xi-talks-rare-earths-tariffs-us-china\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "All operational US liquefied natural gas terminals have violated pollution limits, says report",
      "url": "https://www.theguardian.com/us-news/2025/oct/29/liquefied-natural-gas-terminal-pollution-limits",
      "summary": "&lt;p&gt;Analysis of public records comes as Trump administration aims to fast-track approval of new LNG export terminals&lt;/p&gt;&lt;p&gt;Every fully operational liquefied natural gas (LNG) terminal in the US has violated federal pollution limits in recent years, a new report has found.&lt;/p&gt;&lt;p&gt;The analysis of public records comes as the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; is aiming to fast-track the approval of new export terminals in an attempt to sell more domestic LNG to Europe and Asia. &lt;a href=\"https://www.theguardian.com/us-news/joebiden\"&gt;Joe Biden&lt;/a&gt; had previously placed a pause on LNG exports, which &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; lifted on the first day of his return to office.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/29/liquefied-natural-gas-terminal-pollution-limits\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}