{
  "updatedAt": "2025-10-25T18:33:39.126Z",
  "items": [
    {
      "title": "Arthur Waskow, 92, Influential Rabbi and Activist for Social Justice, Dies",
      "url": "https://www.nytimes.com/2025/10/25/us/arthur-waskow-dead.html",
      "summary": "Through more than two dozen books and two organizations he helped start, he had a profound impact on the intellectual and political life of Jewish congregations in the United States."
    },
    {
      "title": "Kamala Harris Suggests She Is Considering Another Presidential Run",
      "url": "https://www.nytimes.com/2025/10/25/us/politics/kamala-harris-presidential-race.html",
      "summary": "Ms. Harris, in an interview with the BBC, gave her strongest indication yet that she was thinking about making another bid for the Oval Office."
    },
    {
      "title": "Timothy Mellon Is Donor Who Gave $130 Million to Pay Troops During Shutdown",
      "url": "https://www.nytimes.com/2025/10/25/us/politics/timothy-mellon-donation-troops.html",
      "summary": "Timothy Mellon is a billionaire and a major financial backer of President Trump."
    },
    {
      "title": "Keeping the House Absent, Johnson Marginalizes Congress and Himself",
      "url": "https://www.nytimes.com/2025/10/25/us/politics/mike-johnson-speaker-congress.html",
      "summary": "The speaker’s decision to hold the House in an indefinite hiatus during the shutdown is his latest move to diminish the role of the legislative branch — and his own post."
    },
    {
      "title": "In Florida, Obamacare Price Hikes Pose an Outsized Threat",
      "url": "https://www.nytimes.com/2025/10/25/us/obamacare-price-spikes-lost-subsidies-threaten-florida.html",
      "summary": "South Florida will feel some of the most intense reverberations if Congress allows the extra insurance subsidies it approved during the pandemic to expire."
    },
    {
      "title": "As Vance Takes on a Forceful New Role, His Positions Are Shifting",
      "url": "https://www.nytimes.com/2025/10/25/us/politics/jd-vance-shifting-positions.html",
      "summary": "Vice President JD Vance has found himself defending or promoting positions that he once opposed, even as recently as the campaign."
    },
    {
      "title": "Trump backer Timothy Mellon identified as donor of $130m for US troop pay during government shutdown",
      "url": "https://www.theguardian.com/us-news/2025/oct/25/timothy-mellon-donor-military-pay-shutdown",
      "summary": "&lt;p&gt;Reclusive Republican billionaire is descendant of gilded age industrialist and former treasury secretary Andrew Mellon&lt;/p&gt;&lt;p&gt;A reclusive billionaire, anti-tax crusader and major financial backer of &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; has been named as the anonymous private donor who gave $130m to the government to help pay US troops during the federal shutdown that is now in its fourth week, according to the &lt;a href=\"https://www.nytimes.com/2025/10/25/us/politics/timothy-mellon-donation-troops.html\"&gt;New York Times&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;Timothy Mellon, heir to the gilded age industrialist and former treasury secretary Andrew Mellon, is the secret donor whom Trump has described as a “friend”, “great American” and “patriot”, but has refused to name, the Times reported on Saturday, citing two anonymous sources familiar with the arrangement.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/25/timothy-mellon-donor-military-pay-shutdown\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "One year after a historic dam removal, teens inspire river restoration worldwide: ‘It turns out you can win’",
      "url": "https://www.theguardian.com/us-news/2025/oct/25/klamath-river-restoration-teenagers",
      "summary": "&lt;p&gt;The Klamath River began rebounding almost immediately. Now, Indigenous youth are leading the next chapter of the recovery, inspiring tribes from Brazil to China&lt;/p&gt;&lt;p&gt;Ruby Williams’s pink kayak pierced the fog shrouding the mouth of the Klamath River, and she paddled harder. She was flanked on both sides by fellow Indigenous youth from across the basin, and their line of brightly colored boats would make history when they reached the Pacific Ocean on the other side of the sandy dunes – they were going to do it together.&lt;/p&gt;&lt;p&gt;The final of four hydroelectric dams were removed last year from the Klamath River, in the &lt;a href=\"https://www.theguardian.com/us-news/2025/jan/03/california-klamath-dam-removal\"&gt;largest project of its kind in US history&lt;/a&gt;. The following July, 28 teenage tribal representatives completed a 30-day journey that spanned roughly 310 miles (500km) from the headwaters in the Cascades to the Pacific. They were the very first to kayak the entirety of the mighty river in more than a century.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/25/klamath-river-restoration-teenagers\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}