{
  "updatedAt": "2025-10-09T18:36:00.657Z",
  "items": [
    {
      "title": "Democratic Alarm Over an Unbound Trump Fuels Shutdown Standoff",
      "url": "https://www.nytimes.com/2025/10/09/us/politics/democrats-shutdown-trump-administration.html",
      "summary": "The threat of rising Obamacare premiums has been Democrats’ main focus in the public debate, but the president’s defiance of laws, norms and congressional constraints has helped hold them together in opposition."
    },
    {
      "title": "Oklahoma’s Republican Governor Criticizes National Guard Deployment in Chicago",
      "url": "https://www.nytimes.com/2025/10/09/us/politics/oklahoma-governor-national-guard.html",
      "summary": "Gov. Kevin Stitt, the current chairman of the National Governors Association, broke with Texas, saying, “Oklahomans would lose their mind” if Illinois sent troops to their red state."
    },
    {
      "title": "Texas High Court Halts Execution in Shaken Baby Case",
      "url": "https://www.nytimes.com/2025/10/09/us/texas-shaken-baby-execution.html",
      "summary": "Lawyers for Robert Roberson questioned evidence about whether he shook his 2-year-old daughter to death. The state’s highest criminal court ordered a new look."
    },
    {
      "title": "Trump Baselessly Claims He ‘Took the Freedom of Speech Away’ From Flag Burners",
      "url": "https://www.nytimes.com/2025/10/09/us/politics/trump-freedom-of-speech-flag-burning.html",
      "summary": "The president said he had made flag burning a crime punishable by a year in prison. But such a claim contradicts both Supreme Court precedent and the text of an executive order he signed."
    },
    {
      "title": "Gunman Barricaded in Miami House Injures 2 Police Officers",
      "url": "https://www.nytimes.com/2025/10/09/us/miami-police-officers-shot.html",
      "summary": "The officers were in stable condition, the Miami police chief said. The gunman was later found dead, the chief said."
    },
    {
      "title": "Number of Children Fleeing Violence in Haiti Soars",
      "url": "https://www.nytimes.com/2025/10/09/us/haiti-violence-children-crime.html",
      "summary": "Haitian children face intensifying problems of crime, hunger and homelessness as the country’s humanitarian crisis shows no signs of easing, a report from a U.N. agency found."
    },
    {
      "title": "Trump says ‘we’re only going to cut Democrat programs’ as Senate again fails to advance stopgap funding bill – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live",
      "summary": "&lt;p&gt;Trump says federal cuts made while government is shut down will ‘only’ target his opponents’s priorities; Democratic measure fails again on ninth day of shutdown&lt;/p&gt;&lt;p&gt;The president has spent much of Thursday morning &lt;strong&gt;thanking his allies on Truth social for praising his diplomatic efforts in Gaza. &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;“I would like to thank Republican Congressman Brian Mast, of Florida, for his brilliant words and analysis on the return of the Hostages, and Peace in the Middle East, this morning on Fox &amp;amp; Friends. Thank you Brian!!!,” Trump &lt;a href=\"https://truthsocial.com/@realDonaldTrump/115344000556414178\"&gt;wrote in a post&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "National guard remains in Chicago area as judge to rule on Trump deployment",
      "url": "https://www.theguardian.com/us-news/2025/oct/09/chicago-national-guard-troops",
      "summary": "&lt;p&gt;President attacks Chicago mayor and Illinois governor as extra troops at army training site south-west of city&lt;/p&gt;&lt;p&gt;Hundreds of national guard troops remained in the &lt;a href=\"https://www.theguardian.com/us-news/chicago\"&gt;Chicago&lt;/a&gt; area as city and Illinois officials awaited a judge’s decision to stop &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt;’s aggressive immigration enforcement operation in the nation’s third-largest city.&lt;/p&gt;&lt;p&gt;It was still unclear where specifically the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; would send the troops who reported to an army training site south-west of Chicago, which was laden with extra fencing and tarps put up to block the public’s view of the facility late on Wednesday evening.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/09/chicago-national-guard-troops\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}