{
  "updatedAt": "2025-10-24T06:37:38.294Z",
  "items": [
    {
      "title": "Trump Says He’s Cutting Off Trade Negotiations With Canada",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/trump-trade-negotiation-canada.html",
      "summary": "The president said he was motivated by an ad, paid for by the province of Ontario, that featured Ronald Reagan criticizing tariffs in a 1987 radio address."
    },
    {
      "title": "Protester Who Played ‘Star Wars’ Song Sues After Arrest in Washington",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/protester-who-played-star-wars-song-sues-after-arrest-in-washington.html",
      "summary": "Sam O’Hara was playing the “Imperial March” theme from the movie while protesting the deployment of National Guard troops in the capital when he was handcuffed by city police officers."
    },
    {
      "title": "Suspect in Palisades Fire Pleads Not Guilty to Setting Blaze",
      "url": "https://www.nytimes.com/2025/10/23/us/los-angeles-palisades-fire-suspect-arraigned-charges.html",
      "summary": "Prosecutors say Jonathan Rinderknecht deliberately set a fire in January that led to one of the most destructive blazes in California history. If convicted, he would face up to 45 years in prison."
    },
    {
      "title": "Tensions Mount as Agents, Including Gregory Bovino, Clash With Chicagoans",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/gregory-bovino-chicago-immigration.html",
      "summary": "Mr. Bovino, a Border Patrol leader, appeared to use tear gas during a confrontation with residents on Thursday. Plaintiffs in a suit over federal tactics say that violated a court order."
    },
    {
      "title": "Trump Official Says U.S. Can House Migrants at All of Its Overseas Bases",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/dhs-ice-guantanamo.html",
      "summary": "A Justice Department lawyer made the claim in response to a challenge to the administration’s use of the base at Guantánamo Bay, Cuba, to hold detainees designated for deportation."
    },
    {
      "title": "U.S. B-1 Bombers Flew Near Venezuelan Air Space",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/us-b1-bombers-venezuela.html",
      "summary": "The long-range B-1 bombers can carry up to 75,000 pounds of guided and unguided munitions, the largest nonnuclear payload of any aircraft in the Air Force arsenal."
    },
    {
      "title": "‘We’re just gonna kill people’: Trump says he does not need declaration of war for Venezuela strikes – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates",
      "summary": "&lt;p&gt;This live blog is now closed.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;More than half of Americans, including about three in 10 Republicans, believe president Donald Trump is using federal law enforcement to go after his enemies, according to a new Reuters/Ipsos poll that also found growing concern about US political divisions nine months into his second term in office.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Some 55% of poll respondents in the six-day poll, which closed on Monday, agreed with a statement that the Republican president is using law enforcement to target his enemies, while 26% disagreed and the rest were unsure or did not respond.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Man charged over deadly Palisades fire pleads not guilty in Los Angeles court",
      "url": "https://www.theguardian.com/us-news/2025/oct/23/palisades-fire-california-suspect",
      "summary": "&lt;p&gt;Jonathan Rinderknecht, 29, accused of starting devastating fire that destroyed more than 6,800 structures&lt;/p&gt;&lt;p&gt;The Florida man &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/08/palisades-fire-florida-arrest\"&gt;charged with starting the Palisades fire&lt;/a&gt; pleaded not guilty in a downtown Los Angeles courtroom on Thursday.&lt;/p&gt;&lt;p&gt;Earlier this year, the Palisades fire killed 12 people and destroyed more than 6,800 structures, turning swaths of &lt;a href=\"https://www.theguardian.com/us-news/2025/jan/09/california-wildfires-pacific-palisades-los-angeles\"&gt;western Los Angeles into a wasteland&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/23/palisades-fire-california-suspect\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}