{
  "updatedAt": "2025-11-12T06:40:05.154Z",
  "items": [
    {
      "title": "3 Bob Ross Paintings Sell for $600,000 to Support Public Broadcasters",
      "url": "https://www.nytimes.com/2025/11/12/us/bob-ross-paintings-auction-public-broadcasters.html",
      "summary": "The landscapes by the television host were sold as part of a campaign to help public television stations weather federal funding cuts."
    },
    {
      "title": "Kansas County Agrees to Pay $3 Million Over Police Raid of Newspaper",
      "url": "https://www.nytimes.com/2025/11/11/us/marion-county-record-raid-settlement.html",
      "summary": "The search of The Marion County Record’s office in 2023 touched off a national conversation about press freedom."
    },
    {
      "title": "Johnson to Seat Grijalva, Seven Weeks After She Was Elected",
      "url": "https://www.nytimes.com/2025/11/11/us/politics/adelita-grijalva-swearing-in-congress.html",
      "summary": "Speaker Mike Johnson had refused to swear in Representative-elect Adelita Grijalva, a Democrat of Arizona, claiming he lacked the power to do so."
    },
    {
      "title": "Supreme Court Extends Order Allowing Limits on Food Stamp Payments",
      "url": "https://www.nytimes.com/2025/11/11/us/politics/snap-food-stamps-supreme-court-trump.html",
      "summary": "The justices allowed the Trump administration to withhold full benefits for two more days while Congress worked to advance a government funding bill."
    },
    {
      "title": "Duffy Won’t Give Timeline to Restore Flights as Shutdown Appears Near End",
      "url": "https://www.nytimes.com/2025/11/11/us/flights-canceled-shutdown.html",
      "summary": "The transportation secretary said data would guide the decision. He also stepped up his warnings of potential chaos, saying some airlines could ground their fleets if the shutdown continued."
    },
    {
      "title": "Trump Administration Plans to Send Border Patrol to Charlotte and New Orleans",
      "url": "https://www.nytimes.com/2025/11/11/us/trump-border-patrol-charlotte-new-orleans.html",
      "summary": "Plans for the operations were still being finalized, according to a federal official with knowledge of them."
    },
    {
      "title": "John F Kennedy’s grandson Jack Schlossberg announces run for US House seat",
      "url": "https://www.theguardian.com/us-news/2025/nov/12/jack-schlossberg-jfk-john-f-kennedy-grandson-congress",
      "summary": "&lt;p&gt;Schlossberg has drummed up a large following on social media with frequent posts weighing in on national issues&lt;/p&gt;&lt;p&gt;John F Kennedy’s grandson Jack Schlossberg has said he will run for the US House next year, announcing Tuesday that he was seeking a key New York seat set to be vacated by longtime Democrat Jerry Nadler.&lt;/p&gt;&lt;p&gt;“This district should have a representative who can harness the creativity, energy and drive of this district and translate that into political power in Washington,” Schlossberg said in a campaign video posted on social media late Tuesday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/12/jack-schlossberg-jfk-john-f-kennedy-grandson-congress\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US supreme court extends pause on Trump administration paying full November Snap benefits – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/11/donald-trump-us-government-shutdown-senate-democrats-republicans-politics-live-news-updates",
      "summary": "&lt;p&gt;This live blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/11/trump-administration-news-updates-today\"&gt;Trump news at a glance: Top House Democrats vow to oppose shutdown bill after splinter group disappoints&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;As the supreme court deliberates on the fate of Donald Trump’s sweeping tariffs – which he maintains are a matter of “national security” as justices appeared skeptical during oral arguments on the case last week –&amp;nbsp;the president said that the US would be forced to hand “in excess of three trillion dollars” if the levies are scrapped, in a late night post on Truth Social.&lt;/p&gt;&lt;p&gt;He added:&lt;/p&gt;&lt;p&gt;It would not be possible to ever make up for that kind of a ‘drubbing.’ That would truly become an insurmountable National Security Event, and devastating to the future of our Country – Possibly non-sustainable!&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/11/donald-trump-us-government-shutdown-senate-democrats-republicans-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}