{
  "updatedAt": "2025-09-29T18:36:44.597Z",
  "items": [
    {
      "title": "Two HUD civil rights lawyers were dismissed after raising concerns about Fair Housing Act enforcement.",
      "url": "https://www.nytimes.com/live/2025/09/29/us/trump-news-shutdown/hud-lawyers-whistleblowers",
      "summary": ""
    },
    {
      "title": "Investigators Seek Motive for Michigan Church Attack That Killed 4",
      "url": "https://www.nytimes.com/2025/09/29/us/michigan-church-attack.html",
      "summary": "The F.B.I. described the shooting and fire that destroyed a Church of Latter Day Saints meeting house as a “targeted act of violence.”"
    },
    {
      "title": "Death of Trey Reed, a Black Man, in Mississippi Strikes Nerves in the U.S.",
      "url": "https://www.nytimes.com/2025/09/29/us/politics/trey-reed-hanging-mississippi.html",
      "summary": "The authorities say Trey Reed took his own life on his college campus, but in a nation ready to jump to judgment and in a state with its history of racial violence, that conclusion has not ended the story."
    },
    {
      "title": "After Charlie Kirk’s Death, a Bumper Crop of Conspiracy Theories",
      "url": "https://www.nytimes.com/2025/09/29/us/charlie-kirk-assassination-conspiracy-theories.html",
      "summary": "Much of the speculation around the death of the right-wing activist is being promulgated by conspiracy-minded personalities he helped elevate."
    },
    {
      "title": "How Congressional Leaders Are Positioning Themselves in the Shutdown Fight",
      "url": "https://www.nytimes.com/2025/09/29/us/politics/schumer-thune-jeffries-johnson-shutdown.html",
      "summary": "The top four leaders on Capitol Hill are each facing high stakes and competing political incentives as they barrel toward a shutdown."
    },
    {
      "title": "Michigan Church Shooting and Fire: What We Know",
      "url": "https://www.nytimes.com/2025/09/29/us/michigan-mormon-church-shooting-fire.html",
      "summary": "At least four people were killed after an attacker opened fire at a Church of Jesus Christ of Latter-day Saint building and intentionally set fire to the structure."
    },
    {
      "title": "White House says Netanyahu ‘expressed deep regret’ that Israeli strike on Doha killed Qatari serviceman – live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
      "summary": "&lt;p&gt;Trump hosted phone call between US, Israel and Qatar before holding press conference alongside Benjamin Netanyahu at the White House&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Trump officials to announce plan to boost coal output&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The US is set to announce on Monday policies &lt;strong&gt;to try to boost the output of coal&lt;/strong&gt;, the interior department said, as the Trump administration seeks to reverse the decline of the fossil fuel’s use.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump administration spending $625m to revive dying coal industry",
      "url": "https://www.theguardian.com/us-news/2025/sep/29/trump-spending-coal-industry",
      "summary": "&lt;p&gt;White House allocating 13.1m acres of public land to coal mining, which has been on rapid decline over past 30 years&lt;/p&gt;&lt;p&gt;The White House will open 13.1m acres (5.3m hectares) of public land to coal mining while providing $625m for coal-fired power plants, the Trump administration has announced.&lt;/p&gt;&lt;p&gt;The efforts came as part of a suite of initiatives from the Department of the Interior, Department of Energy, and Environmental Protection Agency, aimed at reviving the flagging coal sector. Coal, the most polluting and costly fossil fuel, has been on a rapid decline over the past 30 years, with the US halving its production between 2008 and 2023, &lt;a href=\"https://www.eia.gov/todayinenergy/detail.php?id=64924\"&gt;according&lt;/a&gt; to the Energy Information Administration (EIA).&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/29/trump-spending-coal-industry\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}