{
  "updatedAt": "2025-10-18T18:32:28.733Z",
  "items": [
    {
      "title": "Case Against Bolton Raises Questions Over Justice Dept.’s Use of Espionage Act",
      "url": "https://www.nytimes.com/2025/10/18/us/bolton-indictment-justice-dept-espionage-act.html",
      "summary": "The allegations in his case are a pointed example of when classified information tumbles into nonsecure places, either by accident or from recklessness by someone trusted to keep it safe."
    },
    {
      "title": "U.S. to Repatriate Survivors of Its Strike on Suspected Drug Vessel",
      "url": "https://www.nytimes.com/2025/10/18/us/politics/boat-strike-survivors.html",
      "summary": "The U.S. military rescued the two men in the Caribbean Sea after Special Operations forces fired on a semi-submersible that was assessed to be smuggling drugs."
    },
    {
      "title": "‘No Kings’ Protests Against Trump: Photos and Video",
      "url": "https://www.nytimes.com/2025/10/18/us/politics/no-kings-protests-trump.html",
      "summary": "With signs and chants, protesters take part in ‘No Kings’ rallies focused on what they see as overreach by the Trump administration."
    },
    {
      "title": "Coast Guard Buys Two Private Jets for Noem, Costing $172 Million",
      "url": "https://www.nytimes.com/2025/10/18/us/politics/kristi-noem-dhs-gulfstream.html",
      "summary": "Public documents show the Department of Homeland Security has contracted to purchase a pair of top-of-the-line Gulfstream jets for the secretary and other top officials."
    },
    {
      "title": "Demonstrators Gather Across the U.S. for ‘No Kings’ Protests Against Trump",
      "url": "https://www.nytimes.com/2025/10/18/us/protests-trump-no-kings.html",
      "summary": "Demonstrators were expected to rally in more than 2,600 cities and towns for ‘No Kings’ events."
    },
    {
      "title": "Police Break Up Lego Theft Ring, Recovering Hundreds of Beheaded Figurines",
      "url": "https://www.nytimes.com/2025/10/18/us/lego-theft-california-arrest.html",
      "summary": "Officials said they had discovered tens of thousands of Lego pieces at a California home and arrested a man who trafficked in the stolen collectibles."
    },
    {
      "title": "No Kings protest live updates: thousands march against Trump in nationwide day of protest",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/18/anti-trump-no-kings-protests-updates",
      "summary": "&lt;p&gt;Bernie Sanders and Raphael Warnock among Democratic lawmakers speaking at rallies&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/17/no-kings-protests-millions-trump\"&gt;What to know about the anti-Trump protests attracting millions&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Democratic officials across the US have posted in support of the &lt;/strong&gt;&lt;strong&gt;No Kings&lt;/strong&gt;&lt;strong&gt; protests.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The Senate minority leader, Chuck Schumer, wrote on Saturday morning in a social media &lt;a href=\"https://x.com/SenSchumer/status/1979533834619154742\"&gt;post&lt;/a&gt;: “Do not let Donald Trump and Republicans intimidate you into silence. That’s what they want to do. They’re afraid of the truth. Speak out, use your voice, and exercise your right to free speech.”&lt;/p&gt;&lt;p&gt;“They have a ‘Hate America’ rally that’s scheduled for October 18 on the National Mall,” the House speaker, &lt;a href=\"https://www.theguardian.com/us-news/mike-johnson\"&gt;Mike Johnson&lt;/a&gt;, said on &lt;a href=\"https://x.com/atrupar/status/1976625709046010111\"&gt;Fox News&lt;/a&gt; on Friday. “It’s all the pro-Hamas wing and, you know, the antifa people."
    },
    {
      "title": "Vermont Republican lawmaker resigns over racist and antisemitic group chat",
      "url": "https://www.theguardian.com/us-news/2025/oct/18/vermont-republican-resigns-racist-antisemitic-chat",
      "summary": "&lt;p&gt;State senator Samuel Douglass, 26, and wife, Brianna, both made comments in Young Republicans Telegram group&lt;/p&gt;&lt;p&gt;A &lt;a href=\"https://www.theguardian.com/world/vermont\"&gt;Vermont&lt;/a&gt; state lawmaker has resigned over racist and antisemitic chat messages that circulated within the Young Republican political group, another substantial consequence in a scandal that on Friday saw the New York state Young Republicans’ charter revoked.&lt;/p&gt;&lt;p&gt;State senator Samuel Douglass, the only elected official known to have taken part in the leaked group chat exposed by Politico, resigned Friday over his participation.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/18/vermont-republican-resigns-racist-antisemitic-chat\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}