{
  "updatedAt": "2025-09-16T06:51:41.638Z",
  "items": [
    {
      "title": "Federal Judge Declines to Intervene for Migrants Deported to Ghana",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/judge-migrants-deported-ghana.html",
      "summary": "Judge Tanya S. Chutkan said her hands were “tied” with regard to the migrants, even though they held protective orders, in another victory for President Trump’s deportation campaign."
    },
    {
      "title": "Lina Hidalgo Will Not Run for Re-election in Texas",
      "url": "https://www.nytimes.com/2025/09/15/us/politics/lina-hidalgo-texas-houston.html",
      "summary": "Lina Hidalgo, the top elected official in Harris County, which includes Houston, says she will not run for re-election or any other office in 2026."
    },
    {
      "title": "Deception? Conflicting Paperwork? Clerical Error? How a Politician’s Mortgages Can Get Muddy",
      "url": "https://www.nytimes.com/2025/09/15/us/politics/mortgages-politicians-paperwork-confusion.html",
      "summary": "Mortgage fraud allegations, like those President Trump has leveled against Lisa Cook, are hard to prove. A New York Times review of the holdings of other Washington officials shows how multiple mortgages can invite questions even when people act properly."
    },
    {
      "title": "Republicans Honor Charlie Kirk at Vigil in the Capitol",
      "url": "https://www.nytimes.com/2025/09/15/us/politics/republicans-charlie-kirk-vigil-capitol.html",
      "summary": "Only a handful of Democrats and none of the party’s top leaders attended the ceremony, an outpouring of praise and mourning for the right-wing activist, who was assassinated last week."
    },
    {
      "title": "Schwarzenegger Urges Voters to Reject California Redistricting Measure",
      "url": "https://www.nytimes.com/2025/09/15/us/schwarzenegger-california-redistricting-newsom.html",
      "summary": "Arnold Schwarzenegger issued his first public rebuke since Gov. Gavin Newsom placed a gerrymander plan on the ballot."
    },
    {
      "title": "Appeals Court Says Lisa Cook Can Remain on Fed Board",
      "url": "https://www.nytimes.com/2025/09/15/us/politics/lisa-cook-fed-appeals-court-decision.html",
      "summary": "The decision came the day before the Federal Reserve begins a two-day meeting at which policymakers are expected to cut interest rates."
    },
    {
      "title": "Donald Trump says he is bringing $15bn lawsuit against New York Times",
      "url": "https://www.theguardian.com/us-news/2025/sep/16/donald-trump-says-he-is-suing-new-york-times-15bn-lawsuit-against-newspaper-ntwnfb",
      "summary": "&lt;p&gt;US president says he is bringing defamation and libel action in Florida against the newspaper, accusing it of being a ‘virtual mouthpiece’ for Democrats&lt;/p&gt;&lt;p&gt;Donald Trump says he has brought a $15bn lawsuit against the New York Times, alleging defamation and libel.&lt;/p&gt;&lt;p&gt;In a social media post late on Monday, the US president accused the newspaper of a “decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/16/donald-trump-says-he-is-suing-new-york-times-15bn-lawsuit-against-newspaper-ntwnfb\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump at first says he is ‘not familiar’ with Minnesota Democrat’s assassination",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/trump-melissa-hortman-charlie-kirk-flags",
      "summary": "&lt;p&gt;President says he would have ordered half-staff flags for Melissa Hortman if Tim Walz had asked him to do so&lt;/p&gt;&lt;p&gt;In response to a question about why he did not order flags lowered to half-staff to honor Melissa Hortman, the Democratic speaker of the Minnesota House of Representatives who was assassinated alongside her husband this summer, Donald Trump initially said he was “not familiar” with the case.&lt;/p&gt;&lt;p&gt;The question came up during a briefing in the Oval Office on Monday, in light of the president’s order last week to lower flags in response to the killing of rightwing activist Charlie Kirk.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/15/trump-melissa-hortman-charlie-kirk-flags\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}