{
  "updatedAt": "2025-11-27T12:57:25.185Z",
  "items": [
    {
      "title": "The D.C. shooting suspect had worked with C.I.A.-backed units in Afghanistan.",
      "url": "https://www.nytimes.com/live/2025/11/27/us/national-guard-shooting-dc/the-dc-shooting-suspect-had-worked-with-cia-backed-units-in-afghanistan",
      "summary": ""
    },
    {
      "title": "Trump shuts the door to Afghans who face crises at home.",
      "url": "https://www.nytimes.com/live/2025/11/27/us/national-guard-shooting-dc/trump-shuts-the-door-to-afghans-who-face-crises-at-home",
      "summary": ""
    },
    {
      "title": "Here’s the latest.",
      "url": "https://www.nytimes.com/live/2025/11/27/us/national-guard-shooting-dc/heres-the-latest",
      "summary": ""
    },
    {
      "title": "Beekeepers, Farmers and the Fight to Save a Century-Old Research Hub",
      "url": "https://www.nytimes.com/2025/11/27/us/politics/beekeepers-farmers-research-hub-barc.html",
      "summary": "Industry groups and scientists have urged the Trump administration to reconsider its plan to close a renowned Agriculture Department center in Maryland and disperse its work around the country."
    },
    {
      "title": "Where the Waters Are Rough, a Fishing Town Confronts Trump’s Priorities",
      "url": "https://www.nytimes.com/2025/11/27/us/politics/newport-oregon-ice.html",
      "summary": "First, Newport, Ore., lost its Coast Guard rescue chopper. Then came the swirl of rumors and evidence that Immigration and Customs Enforcement was coming to town."
    },
    {
      "title": "Trump Administration Pauses Immigration From Afghanistan After D.C. Shooting",
      "url": "https://www.nytimes.com/2025/11/27/us/trump-immigration-pause-afghanistan.html",
      "summary": "The U.S. agency overseeing immigration made the announcement after an Afghan man shot two National Guard troops near the White House."
    },
    {
      "title": "Wild turkeys off the menu in Maine after ‘forever chemicals’ found in birds",
      "url": "https://www.theguardian.com/us-news/2025/nov/27/cancer-chemical-in-maine-wild-turkeys",
      "summary": "&lt;p&gt;Contamination of wildlife with Pfas, which can increase risk of cancer, a growing problem in US&lt;/p&gt;&lt;p&gt;Hunters in Maine have been warned not to eat wild turkeys in parts of the state, after the birds were found to contain “forever chemicals” that can cause an increased risk of cancer.&lt;/p&gt;&lt;p&gt;Maine officials warned that high levels of Pfas – per- and polyfluoroalkyl substances – have been detected in wild turkey and deer killed and harvested in areas in the south-west of the state.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/27/cancer-chemical-in-maine-wild-turkeys\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "National guard shooting will likely make Trump crack down even harder",
      "url": "https://www.theguardian.com/us-news/2025/nov/27/national-guard-shooting-trump-washington-dc",
      "summary": "&lt;p&gt;The attack makes the troops’ Washington DC exit less likely and offers a convenient data point for rightwing narratives&lt;/p&gt;&lt;p&gt;“Washington DC is considered a safe zone,” Donald Trump declared on Tuesday, veering off topic at the national Thanksgiving &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/25/thanksgiving-trump-turkey-tradition\"&gt;turkey pardoning ceremony&lt;/a&gt; at the White House. “This was one of the most unsafe places anywhere in the United States. It is now considered a totally safe city.”&lt;/p&gt;&lt;p&gt;A day later, two national guardsmen from West Virginia &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/26/national-guard-soldiers-shot-washington-dc\"&gt;were shot in a busy area&lt;/a&gt; a few blocks from the White House in downtown Washington. The ambush took place outside the Farragut West Metro railway station within sight of the Guardian’s office (I had been in the station three hours earlier and witnessed national guard troops milling around).&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/27/national-guard-shooting-trump-washington-dc\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}