{
  "updatedAt": "2025-09-15T06:54:04.039Z",
  "items": [
    {
      "title": "Trump Administration Claims Vast Powers as It Races to Fire Fed Governor Before Meeting",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/trump-lisa-cook-fed.html",
      "summary": "Trump has forged ahead with his attempts to fire Lisa Cook even as new documents call his claims of mortgage fraud into question."
    },
    {
      "title": "Florida Woman Fights Off Alligator to Save Her Puppy",
      "url": "https://www.nytimes.com/2025/09/14/us/alligator-attack-florida.html",
      "summary": "Danie Wright was walking her Shih Tzu near a creek behind her home in Land O’Lakes, Fla., on Wednesday when an alligator attacked them."
    },
    {
      "title": "White House Seeks More Supreme Court Security Funding After Kirk Killing",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/trump-security-supreme-court-congress.html",
      "summary": "In a notice to Congress, the Trump administration said the additional $58 million would go to the U.S. Marshals Service. It also said it supported additional security for lawmakers."
    },
    {
      "title": "Postcard Sent From the U.N. Is Returned to Sender After 72 Years",
      "url": "https://www.nytimes.com/2025/09/14/us/lost-postcard-united-nations.html",
      "summary": "Alan Ball sent the postcard to his family during the summer of 1953. Last week, it arrived at his home in Idaho."
    },
    {
      "title": "Kirk Shooting Suspect Held ‘Leftist Ideology,’ Utah Governor Says",
      "url": "https://www.nytimes.com/2025/09/14/us/kirk-shooting-suspect-ideology-partner.html",
      "summary": "Gov. Spencer Cox said the suspect had been “radicalized” but did not go into specifics about the suspect’s views."
    },
    {
      "title": "McCaul, a Foreign Policy Leader in the House, Won’t Seek Re-election",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/michael-mccaul-retires-house-texas.html",
      "summary": "Representative Michael McCaul, an 11-term Texas Republican who chairs the House Foreign Affairs Committee, announced on Sunday that he would retire from Congress."
    },
    {
      "title": "Two men arrested in Utah after bomb found under news vehicle",
      "url": "https://www.theguardian.com/us-news/2025/sep/14/utah-arrest-explosive-device",
      "summary": "&lt;p&gt;Men could face terrorism-related and weapons charges after officials say explosive ‘had been lit but failed to function’&lt;/p&gt;&lt;p&gt;Authorities in &lt;a href=\"https://www.theguardian.com/us-news/utah\"&gt;Utah&lt;/a&gt; say two men have been arrested on suspicion of placing an incendiary device under a news media vehicle in Salt Lake City. The bomb didn’t go off.&lt;/p&gt;&lt;p&gt;Police and fire department bomb squads responded on Friday when a suspicious device was found under the vehicle parked near an occupied building.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/14/utah-arrest-explosive-device\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Kathy Hochul backs Zohran Mamdani in race for New York City mayor",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/nyc-mayoral-election-kathy-hochul-zohran-mamdani-endorsement",
      "summary": "&lt;p&gt;New York governor endorses democratic socialist whose platform includes rent hikes for the wealthiest New Yorkers&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/kathy-hochul\"&gt;Kathy Hochul&lt;/a&gt;, the governor of New York, has endorsed &lt;a href=\"https://www.theguardian.com/us-news/zohran-mamdani\"&gt;Zohran Mamdani&lt;/a&gt; in his run for mayor of New York City, a major boost for the democratic socialist.&lt;/p&gt;&lt;p&gt;Writing in a &lt;a href=\"https://www.nytimes.com/2025/09/14/opinion/hochul-endorsement-mamdani.html\"&gt;New York Times&lt;/a&gt; opinion piece, Hochul said: “In the four years since I took office, one of my foundational beliefs has been the importance of the office of New York governor working hand in hand with the mayor of New York City for the betterment of the 8.3 million residents we both represent.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/15/nyc-mayoral-election-kathy-hochul-zohran-mamdani-endorsement\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}