{
  "updatedAt": "2025-11-11T06:39:56.637Z",
  "items": [
    {
      "title": "Dismantled by DOGE, a Foreign Policy Center Finds New Life",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/kennan-institute-doge-trump.html",
      "summary": "The Kennan Institute, which researches Russia and the surrounding region, has re-emerged in a form that is smaller but more impervious to government control."
    },
    {
      "title": "For Trump, Nothing Was Off Limits During the Shutdown",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/trump-government-shutdown.html",
      "summary": "President Trump pressured Democrats by taking punishing actions no previous administration ever took during a shutdown."
    },
    {
      "title": "Shutdown Deal Revives Democratic Infighting",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/shutdown-deal-revives-democratic-infighting.html",
      "summary": "The agreement prompted a backlash within the party, not only against the Democratic defectors who supported it, but against Senator Chuck Schumer, the leader who did not."
    },
    {
      "title": "Trump Asks Supreme Court to Overturn Verdict in E. Jean Carroll Case",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/trump-supreme-court-e-jean-carroll.html",
      "summary": "The president said the assertions behind a judgment that he sexually abused and defamed the writer were “implausible” and “unsubstantiated.”"
    },
    {
      "title": "Trump Pardons the Husband of a Republican Congressional Ally",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/trump-pardon-republican-harshbarger.html",
      "summary": "Robert Harshbarger Jr. pleaded guilty in 2013 to health care fraud and distributing a misbranded drug. His wife, Diana Harshbarger, is a member of Congress."
    },
    {
      "title": "Mobile Lounge Crashes at Dulles Airport, Causing Injuries and Damage",
      "url": "https://www.nytimes.com/2025/11/10/us/dulles-airport-crash-mobile-lounge.html",
      "summary": "More than a dozen people were hospitalized after a bus-like vehicle for passengers crashed into a dock at the Washington airport."
    },
    {
      "title": "Protests as rightwing Charlie Kirk activist group makes final campus tour stop",
      "url": "https://www.theguardian.com/us-news/2025/nov/10/charlie-kirk-turning-point-usa-berkeley",
      "summary": "&lt;p&gt;People shout ‘Fascists out of Berkeley’ as Turning Point USA brings message to college with history of leftwing activism&lt;/p&gt;&lt;p&gt;Turning Point USA, the influential rightwing college group founded by Charlie Kirk, has brought Kirk’s message to a campus with a long history of leftwing activism two months after his death.&lt;/p&gt;&lt;p&gt;An event at the University of California, Berkeley, on Monday evening marked the chaotic last stop of the American Comeback tour, which Kirk had just begun at the time of his death at Utah Valley University. In the aftermath of Kirk’s fatal shooting, the events have come to serve as memorials, with prominent conservative speakers, including JD Vance, highlighting the staggering impact the controversial rightwing influencer’s death has had on American politics.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/10/charlie-kirk-turning-point-usa-berkeley\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump asks supreme court to throw out jury’s finding in E Jean Carroll lawsuit",
      "url": "https://www.theguardian.com/us-news/2025/nov/10/trump-supreme-court-e-jean-carroll-lawsuit",
      "summary": "&lt;p&gt;Writer and author had testified, and won, at trial that the president had sexually assaulted her in the mid-1990s&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://apnews.com/article/trump-national-guard-new-orleans-chicago-baltimore-c9df92974b9fbb2f3be0bb015a512eff\"&gt;Donald Trump&lt;/a&gt; asked the US supreme court on Monday to throw out a jury’s finding in a civil lawsuit that he &lt;a href=\"https://apnews.com/article/trump-rape-carroll-trial-fe68259a4b98bb3947d42af9ec83d7db\"&gt;sexually abused writer E Jean Carroll&lt;/a&gt; at a Manhattan department store in the mid-1990s and later defamed her.&lt;/p&gt;&lt;p&gt;Trump’s lawyers argued in a lengthy filing with the high court that allegations leading to the $5m verdict were “propped up” by a “series of indefensible evidentiary rulings” that allowed Carroll’s lawyers to present “highly inflammatory propensity evidence” against him.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/10/trump-supreme-court-e-jean-carroll-lawsuit\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}