{
  "updatedAt": "2025-11-09T06:36:13.429Z",
  "items": [
    {
      "title": "Medical Helicopter Crashes in Tennessee, Killing One Crew Member",
      "url": "https://www.nytimes.com/2025/11/08/us/medical-helicopter-tennessee-vanderbilt.html",
      "summary": "Two other crew members were critically injured when the helicopter crashed about 30 miles from Nashville. No patients were on board."
    },
    {
      "title": "A Timeline of the Legal Saga Surrounding SNAP Payments",
      "url": "https://www.nytimes.com/2025/11/08/us/politics/snap-payments-timeline.html",
      "summary": "Weeks of uncertainty during the longest government shutdown in American history have left some states struggling to issue payments to food stamp recipients."
    },
    {
      "title": "Jury Awards $16.8 Million to Psychologist Fired After She Reported Inmate’s Threat",
      "url": "https://www.nytimes.com/2025/11/08/us/california-prison-doctor-awarded-millions.html",
      "summary": "A California jury found that Beth Fischgrund was wrongfully terminated and defamed after she reported an inmate’s violent threat at Salinas Valley State Prison in California."
    },
    {
      "title": "Shots Fired at Border Patrol Agents in Chicago, Federal Officials Say",
      "url": "https://www.nytimes.com/2025/11/08/us/chicago-border-patrol-agents.html",
      "summary": "No Border Patrol agents were injured in the incident on Saturday as an immigration enforcement campaign continues in the city."
    },
    {
      "title": "Worries Increase on Second Day of Flight Cancellations",
      "url": "https://www.nytimes.com/2025/11/08/us/worries-mount-as-air-traffic-delays-stretch-to-second-day.html",
      "summary": "Disruptions to air travel on Saturday were modest, but officials and passengers were bracing for worse as the government shutdown continued."
    },
    {
      "title": "Gavin Newsom, Eyeing 2028, Tries to Mess With Texas",
      "url": "https://www.nytimes.com/2025/11/08/us/politics/newsom-2028-texas-rally-abbott-trump.html",
      "summary": "Celebrating his recent redistricting victory, the California governor swooped into a state led by a Republican rival and sent the latest signal about his presidential ambitions."
    },
    {
      "title": "Nearly 1,500 flights canceled on second day of cuts tied to government shutdown",
      "url": "https://www.theguardian.com/us-news/2025/nov/08/flight-cancellations-government-shutdown",
      "summary": "&lt;p&gt;Charlotte, North Carolina, has the most cancellations – at 120 – as industry experts say other sectors might also feel effects&lt;/p&gt;&lt;p&gt;US airlines canceled 1,460 flights on Saturday, the second day of the Federal Aviation Administration’s (FAA) order to reduce air traffic because of the &lt;a href=\"https://www.theguardian.com/us-news/us-federal-government-shutdown-2025\"&gt;government shutdown&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;So far, the &lt;a href=\"https://www.theguardian.com/world/2025/nov/07/passengers-face-global-disruption-as-flights-cut-amid-us-government-shutdown\"&gt;slowdown at many of the nation’s busiest airports&lt;/a&gt; hasn’t caused widespread disruptions. But it has deepened the impact felt by what is now the nation’s longest federal shutdown.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/08/flight-cancellations-government-shutdown\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: President suggests scrapping Obamacare as shutdown flight chaos continues",
      "url": "https://www.theguardian.com/us-news/2025/nov/09/trump-news-at-a-glance-president-suggests-scrapping-obamacare-as-shutdown-flight-chaos-continues",
      "summary": "&lt;p&gt;Trump urged Republican senators to redirect federal money toward direct payments to individuals. Key US politics stories from 8 November at a glance&lt;/p&gt;&lt;p&gt;Donald Trump on Saturday urged Republican senators to redirect federal money used to subsidize health insurance costs under the Affordable Care Act toward direct payments to individuals, in an effort to overcome an issue at the heart of the US government shutdown.&lt;/p&gt;&lt;p&gt;“I am recommending to Senate Republicans that the Hundreds of Billions of Dollars currently being sent to money sucking Insurance Companies in order to save the bad Healthcare provided by ObamaCare, BE SENT DIRECTLY TO THE PEOPLE SO THAT THEY CAN PURCHASE THEIR OWN, MUCH BETTER, HEALTHCARE, and have money left over,” Trump wrote in a social media post.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/09/trump-news-at-a-glance-president-suggests-scrapping-obamacare-as-shutdown-flight-chaos-continues\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}