{
  "updatedAt": "2025-11-07T18:36:30.008Z",
  "items": [
    {
      "title": "Nancy Pelosi Knew Her ‘Why’",
      "url": "https://www.nytimes.com/2025/11/07/us/politics/nancy-pelosi-house-speaker.html",
      "summary": "The first female speaker of the House may be the last to truly rule the increasingly unruly chamber."
    },
    {
      "title": "Immigration Agents Arrest Man in L.A. Raid and Drive Off With His Toddler",
      "url": "https://www.nytimes.com/2025/11/07/us/immigration-raid-los-angeles-toddler.html",
      "summary": "The child was later reunited with her grandmother, but the episode alarmed immigrant rights groups. The father, a U.S. citizen, faces a gun possession charge."
    },
    {
      "title": "A Decade Later, Supreme Court Is Asked to Revisit Same-Sex Marriage Decision",
      "url": "https://www.nytimes.com/2025/11/07/us/politics/supreme-court-same-sex-marriage.html",
      "summary": "Kim Davis, a Kentucky county clerk once jailed for refusing to issue same-sex marriage licenses, has asked the court to reconsider its landmark 2015 opinion."
    },
    {
      "title": "Cornell Reaches Deal with Trump Administration to Restore Research Funds",
      "url": "https://www.nytimes.com/2025/11/07/us/cornell-deal-trump-administration.html",
      "summary": "The Ivy League university had warned of layoffs after the Trump administration stripped it of funds this year. The cuts were among the deepest in higher education."
    },
    {
      "title": "When a Vietnam Protest on Campus Turned Deadly",
      "url": "https://www.nytimes.com/2025/11/07/us/kent-state-vietnam-john-cleary.html",
      "summary": "In May 1970, National Guard troops clashed with students at Kent State University in Ohio. Four students were killed, and nine were injured."
    },
    {
      "title": "John Cleary, Wounded in Kent State Shooting, Dies at 74",
      "url": "https://www.nytimes.com/2025/11/07/us/john-cleary-dead.html",
      "summary": "A photo of him lying on the ground and bleeding made the cover of Life magazine after the 1970 shooting."
    },
    {
      "title": "Cornell University settles with Trump administration to restore $250m in funds",
      "url": "https://www.theguardian.com/us-news/2025/nov/07/cornell-university-trump-administration-deal",
      "summary": "&lt;p&gt;Upstate New York institution is the fifth university under government investigation to bow to White House demands&lt;/p&gt;&lt;p&gt;Cornell University announced a settlement with the Trump administration on Friday, becoming the fifth university under investigation by the US government to do so.&lt;/p&gt;&lt;p&gt;The &lt;a href=\"https://statements.cornell.edu/2025/documents/cornell-settlement-agreement.pdf\"&gt;agreement&lt;/a&gt; will see more than $250m in federal research funding restored. In exchange, the university will share admissions data with the government, pay $30m and invest $30m more in research programs benefiting farmers – a reflection of the university’s longstanding record of agricultural research. The university also agreed to continued to “evaluate the campus climate”, particularly for Jewish students and affirmed the Trump administration’s interpretation of civil rights laws, which views diversity initiatives as unlawful race-based discrimination.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/07/cornell-university-trump-administration-deal\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump says ‘looking at’ exemption for Hungary from Russian oil and gas sanctions – live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
      "summary": "&lt;p&gt;US president calls Hungarian prime minister Viktor Orbán a ‘great leader’ as they meet at the White House&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/profile/roth-andrew\"&gt;Andrew Roth&lt;/a&gt;&lt;em&gt; in Washington and &lt;/em&gt;&lt;a href=\"https://www.theguardian.com/profile/flora-garamvolgyi\"&gt;Flora Garamvolgyi&lt;/a&gt;&lt;em&gt; in Budapest&lt;/em&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Viktor Orbán&lt;/strong&gt; will visit the White House today as Hungary’s far-right prime minister &lt;strong&gt;tries to broker another summit between Donald Trump and Vladimir Putin&lt;/strong&gt; that Orbán’s advisers claim could help end the war between Russia and Ukraine.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}