{
  "updatedAt": "2025-11-04T12:59:33.380Z",
  "items": [
    {
      "title": "Bessent Plans to Attend Tariff Arguments at the Supreme Court",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/supreme-court-tariffs-bessent.html",
      "summary": "Treasury Secretary Scott Bessent dismissed the idea that his presence could be seen as an attempt to intimidate the court on a case that President Trump considers vital to his economic policy."
    },
    {
      "title": "New Jersey Elections: How to Vote, Where to Vote and What’s on the Ballot",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/new-jersey-how-vote-ballot.html",
      "summary": "New Jersey voters will pick a governor on Tuesday in a competitive off-year election."
    },
    {
      "title": "Elections to Play Out Amid Tensions Over ICE and Justice Dept. Monitors",
      "url": "https://www.nytimes.com/2025/11/04/us/elections-to-play-out-amid-tensions-over-ice-and-justice-dept-monitors.html",
      "summary": "Democrats are concerned that the immigration crackdown will hurt Latino turnout on Tuesday, and that election monitors at polling sites could intimidate voters."
    },
    {
      "title": "In the Virginia governor’s race, it’s Abigail Spanberger vs. Winsome Earle-Sears.",
      "url": "https://www.nytimes.com/live/2025/11/04/us/election-new-jersey-california/virginia-governor-abigail-spanberger-winsome-earle-sears",
      "summary": "Ms. Spanberger, a centrist Democrat, has led in most polls against Ms. Earle-Searles, the Republican lieutenant governor. One of them will become Virginia’s first female chief executive."
    },
    {
      "title": "Dick Cheney, Powerful Vice President and Washington Insider, Dies at 84",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/dick-cheney-dead.html",
      "summary": "A former defense secretary and congressman, he held the nation’s No. 2 job under President George W. Bush and was an architect of policies in an era of war and economic change."
    },
    {
      "title": "Virginia Elections: How to Vote, Where to Vote and What’s on the Ballot",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/virginia-how-vote-ballot.html",
      "summary": "Virginia voters will make their choice for governor and attorney general on Tuesday, and all 100 seats in the House of Delegates are also on the ballot."
    },
    {
      "title": "US elections 2025 live: Americans go to the polls, with elections in New York City, New Jersey, Virginia and California",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
      "summary": "&lt;p&gt;Attention in US and abroad will be on New York mayoral race with Democratic candidate Zohran Mamdani facing Andrew Cuomo and Curtis Sliwa&lt;/p&gt;&lt;p&gt;The former US vice-president, &lt;strong&gt;Dick Cheney&lt;/strong&gt;, has died aged 84, according to a family statement.&lt;/p&gt;&lt;p&gt;“Richard B. Cheney, the 46th Vice President of the United States, died last night, November 3, 2025. He was 84 years old,” Cheney’s family said in a statement quoted by The Hill and other media outlets.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Dick Cheney, vice-president and giant of Republican politics, dies aged 84",
      "url": "https://www.theguardian.com/us-news/2025/nov/04/dick-cheney-vice-president-republican-bush-dies",
      "summary": "&lt;p&gt;Cheney, who served under presidents from Nixon to George W Bush, will be remembered for key role after 9/11&lt;/p&gt;&lt;p&gt;The former White House chief of staff, member of Congress, secretary of defense and US vice-president Dick Cheney has died, his family has said. He was 84.&lt;/p&gt;&lt;p&gt;Cheney was one of the country’s most powerful vice-presidents, widely reported to wield great influence over the less experienced George W Bush, the president under whom he served.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/04/dick-cheney-vice-president-republican-bush-dies\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}