{
  "updatedAt": "2025-11-23T12:48:47.521Z",
  "items": [
    {
      "title": "At Harvard-Yale Game, Rivals Come Together Against Trump Administration Attacks",
      "url": "https://www.nytimes.com/2025/11/23/us/politics/yale-harvard-football-trump.html",
      "summary": "Students and alumni set aside rivalries at the 141st Harvard-Yale football game on Saturday to summon support against attacks on higher education under the Trump administration."
    },
    {
      "title": "Fact-Checking Trump’s Latest Claims on Affordability",
      "url": "https://www.nytimes.com/2025/11/23/us/politics/fact-check-trump-affordability.html",
      "summary": "The president has made misleading statements about the cost of a Thanksgiving meal, breakfast and gasoline and about prices in general."
    },
    {
      "title": "F.B.I. Letters Send Shivers Through California’s Political Inner Circle",
      "url": "https://www.nytimes.com/2025/11/23/us/california-fbi-state-capitol-corruption.html",
      "summary": "The indictment of Gov. Gavin Newsom’s former chief of staff shocked many power players in California. Now, some wonder how far the investigation will spread."
    },
    {
      "title": "Why Republicans Are Fighting About the Nazis",
      "url": "https://www.nytimes.com/2025/11/23/us/politics/republicans-antisemitism-carlson-fuentes-trump.html",
      "summary": "Tensions over right-wing antisemitism have burst to the forefront of Republican politics, and show signs of becoming a fierce point of contention in the midterms and beyond."
    },
    {
      "title": "One Undocumented Worker Used a Stolen Identity. Two Men Paid the Price.",
      "url": "https://www.nytimes.com/2025/11/23/us/undocumented-worker-stolen-identity-dan-kluver.html",
      "summary": "Thousands of undocumented workers rely on fraudulent Social Security numbers. One of them belonged to Dan Kluver."
    },
    {
      "title": "Patel Under Scrutiny for Use of SWAT Teams to Protect His Girlfriend",
      "url": "https://www.nytimes.com/2025/11/23/us/politics/kash-patel-girlfriend-fbi-protection.html",
      "summary": "The F.B.I. director’s travel on government jets has contributed to growing questions inside the administration about whether he is using taxpayer-funded resources inappropriately."
    },
    {
      "title": "Epstein survivor condemns Trump for calling file release fight a ‘hoax’",
      "url": "https://www.theguardian.com/us-news/2025/nov/23/epstein-survivor-condemns-trump",
      "summary": "&lt;p&gt;Danielle Bensky, who was abused by Jeffrey Epstein, says president was ‘incredibly disrespectful’ in recent comments&lt;/p&gt;&lt;p&gt;A survivor of &lt;a href=\"https://www.theguardian.com/us-news/jeffrey-epstein\"&gt;Jeffrey Epstein&lt;/a&gt;’s abuse has condemned &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; for dismissing the victims’ fight for transparency as a “hoax”.&lt;/p&gt;&lt;p&gt;Shortly after &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/19/trump-sign-bill-epstein-files\"&gt;signing a bill to release the Epstein files&lt;/a&gt;, the US president posted a lengthy social media rant accusing &lt;a href=\"https://www.theguardian.com/us-news/democrats\"&gt;Democrats&lt;/a&gt; of weaponising the scandal against him.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/23/epstein-survivor-condemns-trump\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Charlotte activists met the immigration crackdown with ‘bless your heart’ resistance",
      "url": "https://www.theguardian.com/us-news/2025/nov/23/activists-immigration-charlotte-north-carolina",
      "summary": "&lt;p&gt;ICE and CBP’s North Carolina operation faced an early-warning system run by thousands of volunteers&lt;/p&gt;&lt;p&gt;“The operation is not over and it is not ending anytime soon.”&lt;/p&gt;&lt;p&gt;The message from the Department of Homeland Security assistant secretary Tricia McLaughlin went out to Charlotte, North Carolina, on Thursday afternoon, in response to an announcement by Sheriff Garry McFadden that Customs and Border Protection (CBP) was done with its immigration enforcement sweep.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/23/activists-immigration-charlotte-north-carolina\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}