{
  "updatedAt": "2025-10-08T06:37:53.980Z",
  "items": [
    {
      "title": "Air Traffic Staffing Shortages Disrupt Travel for Second Straight Day",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/air-traffic-control-government-shutdown.html",
      "summary": "The national air space has long been reeling from a staffing crisis among air traffic controllers, as the F.A.A. grapples with a shortage of about 3,000 controllers."
    },
    {
      "title": "Trump Appoints New Head of Immigration Courts",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/trump-immigration-courts.html",
      "summary": "Col. Daren K. Margolin, who retired from the Marine Corps, was fired from a command position as head of security at Marine Base Quantico in 2013 for negligently firing a gun into the floor of his office."
    },
    {
      "title": "Carney and Trump: A Collision Avoided, Save for a Nasty Comment or Two",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/carney-trump-canada-trade-relationship.html",
      "summary": "The Canadian prime minister came to Washington determined to take the heat out of the relationship. He mostly succeeded, at least for now."
    },
    {
      "title": "3 Key Takeaways From the Bondi Hearing",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/bondi-hearing-takeaways.html",
      "summary": "The session before a Senate panel featured more fireworks than facts as Democrats and the attorney general repeatedly clashed."
    },
    {
      "title": "Senate Confirms Neil Jacobs, ‘Sharpiegate’ Meteorologist, to Lead NOAA",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/senate-neil-jacobs-noaa.html",
      "summary": "Neil Jacobs was found to have violated NOAA’s code of ethics after an investigation into an incident that centered on an altered hurricane forecast map in 2019."
    },
    {
      "title": "Health Care Politics Bolster Democrats in Shutdown Fight",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/trump-democrats-shutdown-obamacare.html",
      "summary": "Even President Trump has conceded that he and his party could face political pain from rising premiums, stiffening Democrats’ spines as they demand a subsidy extension."
    },
    {
      "title": "Oregon’s governor says she told Kristi Noem ‘there is no insurrection in Oregon’ – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
      "summary": "&lt;p&gt;This liveblog is now closed. You can find more of our politics coverage &lt;a href=\"https://www.theguardian.com/us-news/us-politics\"&gt;here&lt;/a&gt;&lt;/p&gt;&lt;p&gt;Before we turn our attention to Capitol Hill, we’re also keeping an eye on Illinois today. On Monday, a federal judge did not immediately block the president’s move to deploy national guard troops, including hundreds from Texas, to Chicago.&lt;/p&gt;&lt;p&gt;Instead, the judge set a hearing for Thursday, leaving room for the military to make their way to the windy city as soon as today.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Tesla debuts ‘affordable’ Model Y and 3 in US that strike some as too expensive",
      "url": "https://www.theguardian.com/us-news/2025/oct/07/tesla-affordable-model-y-3",
      "summary": "&lt;p&gt;CEO Elon Musk touts SUV and sedan, with starting prices of $39,990 and $36,990, as way to tap wider swath of buyers&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/technology/tesla\"&gt;Tesla&lt;/a&gt; rolled out “affordable” versions of its best-selling Model Y SUV and its Model 3 sedan, but the starting prices of US$39,990 and US$36,990 were too high, some said, to attract a new class of buyers to the electric vehicle brand.&lt;/p&gt;&lt;p&gt;CEO &lt;a href=\"https://www.theguardian.com/technology/elon-musk\"&gt;Elon Musk&lt;/a&gt; has touted the car as a way to tap a wider swath of buyers, saying last year that a price below $30,000, after incentives, was the key.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/07/tesla-affordable-model-y-3\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}