{
  "updatedAt": "2025-10-15T18:37:57.107Z",
  "items": [
    {
      "title": "Trump Considers Overhaul of Refugee System That Would Favor White People",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/trump-refugee-white-people.html",
      "summary": "The proposals would transform a program aimed at helping the most vulnerable people in the world into one that gives preference to mostly white people who say they are being persecuted."
    },
    {
      "title": "Trump Administration Authorizes Covert C.I.A. Action in Venezuela",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/trump-covert-cia-action-venezuela.html",
      "summary": "The development comes as the U.S. military is drawing up options for President Trump to consider, including possible strikes inside the country."
    },
    {
      "title": "Trump Allies Push to Bolster Putin-Backed Balkans Leader",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/trump-dodik-srpska-lobbying.html",
      "summary": "An influence campaign has relied on allies of the president, including Rudolph W. Giuliani, to cast a Serbian politician as a victim of political persecution."
    },
    {
      "title": "Schumer Calls on Trump and Vance to Condemn Young Republicans’ Texts",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/schumer-young-republicans-texts.html",
      "summary": "The top Senate Democrat said the president and Republican leaders had an “obligation to denounce vile rhetoric,” even when it comes from within their own party."
    },
    {
      "title": "Could a Supreme Court Ruling on Election Maps Affect the Midterms? Timing Matters.",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/voting-rights-midterms.html",
      "summary": "A prohibition on the use of race in drawing electoral districts could allow states to redraw legislative lines before voting begins next year."
    },
    {
      "title": "A second perilous challenge to the Voting Rights Act awaits.",
      "url": "https://www.nytimes.com/live/2025/10/15/us/supreme-court-voting-rights/second-challenge-voting-rights-act",
      "summary": "The justices will decide next month whether to hear an appeal from a ruling that would shut down almost all lawsuits under the law."
    },
    {
      "title": "Federal judge says she’s ‘inclined’ to block mass layoffs as Trump official estimates 10,000 could be affected – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Judge Susan Illston says administration has ‘taken advantage of lapse in government functioning’; Russell Vought says his office wants to be ‘very aggressive in shuttering bureaucracy’&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The far-right US congresswoman &lt;a href=\"https://www.theguardian.com/us-news/marjorie-taylor-greene\"&gt;Marjorie Taylor Greene&lt;/a&gt; is further distancing herself from her fellow Republicans and accusing men in her party of being “weak”.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;In an &lt;a href=\"https://www.washingtonpost.com/politics/2025/10/14/marjorie-taylor-greene-interview-shutdown-aca-epstein-mike-johnson/\"&gt;interview&lt;/a&gt; with the Washington Post, Greene expressed her frustrations with Republicans, signaling her further deviation from the political strategies of her party, as the government shutdown beginning 1 October was slated to enter its third week.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Gavin Newsom again denies parole for Manson follower Patricia Krenwinkel",
      "url": "https://www.theguardian.com/us-news/2025/oct/15/charles-manson-follower-parole-patricia-krenwinkel-gavin-newsom",
      "summary": "&lt;p&gt;California governor blocks 77-year-old’s parole for second time, saying she ‘poses an unreasonable danger to society’&lt;/p&gt;&lt;p&gt;Gavin Newsom this week again denied parole for Patricia Krenwinkel, who has spent more than half a century in prison for her role in the 1969 Tate-LaBianca killings orchestrated by &lt;a href=\"https://www.theguardian.com/us-news/charles-manson\"&gt;Charles Manson&lt;/a&gt; and perpetrated by his followers.&lt;/p&gt;&lt;p&gt;Nearly five months after California’s parole board found the 77-year-old suitable for release, the governor on Monday reversed the decisionand said she “currently poses an unreasonable danger to society if released from prison at this time’”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/15/charles-manson-follower-parole-patricia-krenwinkel-gavin-newsom\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}