{
  "updatedAt": "2025-09-26T06:50:42.388Z",
  "items": [
    {
      "title": "Trump Orders Broad Effort to Root Out Groups He Says Organize Political Violence",
      "url": "https://www.nytimes.com/2025/09/25/us/politics/trump-memorandum-left-wing-violence.html",
      "summary": "President Trump has long maintained that liberal activists and organizations secretly fund political violence. Law enforcement officials say efforts like the antifascist movement are often disparate groups."
    },
    {
      "title": "With Comey Indictment, Trump Gets Retribution but Shatters Norms",
      "url": "https://www.nytimes.com/2025/09/25/us/politics/trump-retribution-comey-indictment.html",
      "summary": "A prosecutor’s drive to indict James Comey trampled over the Justice Department’s long tradition of keeping a distance from politics and the White House, and raised the prospect of more arbitrary charges."
    },
    {
      "title": "Prosecutor Believes Shooting at ABC Affiliate Was Politically Motivated",
      "url": "https://www.nytimes.com/2025/09/25/us/abc-affiliate-shooting-california.html",
      "summary": "The suspect in the shooting in Sacramento, a retired California lobbyist, was ordered to remain in custody without bail. His lawyer questioned why federal lawyers were involved."
    },
    {
      "title": "James Comey, Former FBI Director, Indicted After Pressure From Trump",
      "url": "https://www.nytimes.com/2025/09/25/us/politics/james-comey-indicted.html",
      "summary": "The move came after the president intensified his pressure campaign on the Justice Department in recent days, publicly demanding that top officials prosecute Mr. Comey."
    },
    {
      "title": "Chicago to Pay $90 Million to Settle Cases Tied to an Ex-Police Sergeant’s Team",
      "url": "https://www.nytimes.com/2025/09/25/us/chicago-police-settlement-ronald-watts.html",
      "summary": "The agreement to resolve scores of lawsuits was a significant blow to a city facing budget challenges, but not as pricey as some officials had feared."
    },
    {
      "title": "911 Service Is Restored in Louisiana and Mississippi",
      "url": "https://www.nytimes.com/2025/09/25/us/mississippi-louisiana-outages-911-emergency.html",
      "summary": "Damage to fiber optic lines operated by AT&amp;T was to blame for the statewide outages, which lasted more than two hours on Thursday, officials said."
    },
    {
      "title": "Trump celebrates James Comey indictment as ex-FBI director says ‘I’m innocent: let’s have a trial’ – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
      "summary": "&lt;p&gt;This blog is now closed. &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/25/james-comey-fbi-director-indictment\"&gt;Read the full story here&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Dozens of House &lt;a href=\"https://www.theguardian.com/us-news/democrats\"&gt;Democrats&lt;/a&gt; have signed a letter to &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; and secretary of state &lt;a href=\"https://www.theguardian.com/us-news/marco-rubio\"&gt;Marco Rubio&lt;/a&gt;, urging the administration to recognize Palestinian statehood.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The letter, led by &lt;a href=\"https://www.theguardian.com/us-news/california\"&gt;California&lt;/a&gt; Democrat Ro Khanna, has 46 signatures, and lawmakers will send it to the US president on Friday, &lt;strong&gt;according to plans first provided to the Guardian&lt;/strong&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump says US will impose new tariffs on heavy trucks, drugs and kitchen cabinets",
      "url": "https://www.theguardian.com/us-news/2025/sep/25/trump-tariffs-heavy-trucks-drugs-kitchen-cabinets",
      "summary": "&lt;p&gt;President announces 100% tariffs on imported branded drugs, 25% on heavy-duty trucks and 50% on cabinets&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; on Thursday announced a new round of punishing &lt;a href=\"https://www.theguardian.com/us-news/trump-tariffs\"&gt;tariffs&lt;/a&gt;, saying the United States will impose a 100% tariffs on imported branded drugs, 25% tariff on imports of all heavy-duty trucks and 50% tariffs on kitchen cabinets.&lt;/p&gt;&lt;p&gt;The US president also said he would start charging a 50% tariff on bathroom vanities and a 30% tariff on upholstered furniture next week, with all the new duties to take effect from 1 October.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/25/trump-tariffs-heavy-trucks-drugs-kitchen-cabinets\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}