{
  "updatedAt": "2025-12-04T13:00:36.857Z",
  "items": [
    {
      "title": "F.D.A. Orders Recall of More than 1.5 Million Bags of Shredded Cheese",
      "url": "https://www.nytimes.com/2025/12/04/us/cheese-recall.html",
      "summary": "A warning over shredded cheese is the latest of hundreds in the U.S. food system. Understanding recalls can help shoppers determine what’s truly dangerous."
    },
    {
      "title": "Trump to Host Congo and Rwanda Leaders for Peace Talks in Persistent Conflict",
      "url": "https://www.nytimes.com/2025/12/04/us/politics/trump-congo-rwanda-leaders-peace-talks.html",
      "summary": "The president will meet with the leaders of Rwanda and the Democratic Republic of Congo to advance a deal meant to end a long war in eastern Congo."
    },
    {
      "title": "The Furor Over Trump’s Boat Attacks and a Particular Follow-Up Strike, Explained",
      "url": "https://www.nytimes.com/2025/12/04/us/politics/boat-strikes-trump-hegseth-caribbean.html",
      "summary": "Bipartisan congressional oversight is underway, but for now is focusing on narrow details about one missile instead of broader legal issues."
    },
    {
      "title": "A Volunteer’s Dire Warnings About the National Guard D.C. Shooting Suspect",
      "url": "https://www.nytimes.com/2025/12/04/us/rahmanullah-lakanwal-national-guard-shooting-dc.html",
      "summary": "More than a year before the Trump administration granted asylum to the Afghan immigrant, the volunteer’s emails raised concerns that he was unraveling."
    },
    {
      "title": "Inside Kennedy’s Methodical Quest to Shake Up America’s Vaccine System",
      "url": "https://www.nytimes.com/2025/12/04/us/politics/rfk-vaccines-hhs-trump.html",
      "summary": "The health secretary has walled himself off from government scientists and empowered fellow activists to pursue his vaccine agenda."
    },
    {
      "title": "San Francisco Mayor Names Derrick Lew as New Police Chief",
      "url": "https://www.nytimes.com/2025/12/04/us/derrick-lew-san-francisco-police-chief.html",
      "summary": "Mr. Lew is a veteran police officer whose experience includes major operations against drug dealing."
    },
    {
      "title": "New York Times sues Pentagon over new reporting restrictions – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/04/us-politics-live-donald-trump-latest-news-updates-democrats-republicans",
      "summary": "&lt;p&gt;NYT accuses Pentagon of infringing on the constitutional rights of its journalists&lt;/p&gt;&lt;p&gt;A law has come into effect in &lt;strong&gt;Texas&lt;/strong&gt; that will allow individuals in the state &lt;strong&gt;to sue abortion pill providers in other states&lt;/strong&gt;. Proponents say it is a way to enforce abortion restrictions in Texas. Opponents worry about the methods complainants might use to find their evidence.&lt;br&gt;&lt;br&gt; In this special episode of &lt;strong&gt;Politics Weekly America&lt;/strong&gt;, the Guardian US reproductive health and justice reporter, Carter Sherman, speaks to people who are using, providing and protecting abortion pills, and those fighting against them in Texas.&lt;/p&gt;&lt;p&gt;With the defense secretary, &lt;strong&gt;Pete Hegseth&lt;/strong&gt;, already in the hot seat &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/03/trump-officials-boat-strikes-legal-analysis\"&gt;over the 2 September boat strike&lt;/a&gt; and &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/03/hegseth-yemen-signal-group-chat\"&gt;the inspector-general report &lt;/a&gt;on his use of the Signal messaging app in March, the Wall Street Journal&lt;a href=\"https://www.wsj.com/politics/national-security/hegseth-asked-top-admiral-to-resign-after-months-of-discord-9e7b357f\"&gt; is reporting &lt;/a&gt;that Hegseth had asked Adml &lt;strong&gt;Alvin Holsey&lt;/strong&gt; to step down after he had expressed concerns over the legality of the attacks in the Caribbean.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/04/us-politics-live-donald-trump-latest-news-updates-democrats-republicans\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "First Thing: ‘Alligator Alcatraz’ detainees face human rights violations, report alleges",
      "url": "https://www.theguardian.com/us-news/2025/dec/04/first-thing-alligator-alcatraz-detainees-human-rights-violations-amnesty-report-alleges",
      "summary": "&lt;p&gt;Amnesty finds detainees at Florida facility were shackled and left outside in metal cage. Plus, how the dollar-store industry overcharges consumers&lt;/p&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;Detainees at the notorious Florida immigration jail known as “Alligator Alcatraz” were shackled inside a 2ft-high metal cage and left outside without water for up to a day at a time, a shocking report published on Thursday by Amnesty International alleges.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Wait, didn’t a judge order the facility to shut down?&lt;/strong&gt; A federal judge in August &lt;a href=\"https://www.theguardian.com/us-news/2025/aug/21/trump-alligator-alcatraz-judge-ruling\"&gt;ordered it to close&lt;/a&gt; after a wave of criticism and a lawsuit by environmental groups. However, by October, the facility was operating again with hundreds of detainees after two Trump-appointed appellate court judges – one whose husband &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/02/alligator-alcatraz-ron-desantis-paul-huck\"&gt;has close ties&lt;/a&gt; to the Republican governor Ron DeSantis – blocked the closure ruling.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Has the state of Florida responded to the allegations?&lt;/strong&gt; The press secretary to DeSantis told the Guardian the allegations were “fabrications” and part of a “politically motivated attack”.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Why have they released these photos now?&lt;/strong&gt; It’s unclear. Even though the images do not reveal anything new, they keep the pressure on the Trump administration ahead of a 19 December deadline for the justice department to release files, as per the &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/18/house-vote-epstein-documents\"&gt;Epstein Files Transparency Act&lt;/a&gt;, signed 19 November.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/04/first-thing-alligator-alcatraz-detainees-human-rights-violations-amnesty-report-alleges\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}