{
  "updatedAt": "2025-10-08T12:54:29.762Z",
  "items": [
    {
      "title": "James Comey, Former FBI Director, to Appear in Court for Arraignment",
      "url": "https://www.nytimes.com/2025/10/08/us/politics/james-comey-arraignment.html",
      "summary": "The case against James B. Comey, the former F.B.I. director, was deemed too thin by a previous federal prosecutor, who quit under pressure from President Trump."
    },
    {
      "title": "Civil Rights Lawyer Bryan Stevenson on How America’s Story Should Be Told",
      "url": "https://www.nytimes.com/2025/10/08/us/trump-smithsonian-bryan-stevenson.html",
      "summary": "The founder of the Equal Justice Initiative says it would be “dishonorable” to remain silent in the face of President Trump’s efforts."
    },
    {
      "title": "Oakland, California, Residents Are Fed Up With Illegal Dumping",
      "url": "https://www.nytimes.com/2025/10/08/us/oakland-california-trash-garbage.html",
      "summary": "Many residents say that illegal dumping has inundated Oakland, Calif., a city with more garbage than almost anywhere else."
    },
    {
      "title": "Supreme Court to Consider Illinois Mail-In Balloting Lawsuit",
      "url": "https://www.nytimes.com/2025/10/08/us/politics/supreme-court-mail-ballots-illinois.html",
      "summary": "The case, one of several challenges to mail-in ballot rules lodged by allies of President Trump, involves an effort to exclude votes received after Election Day."
    },
    {
      "title": "Trump’s H-1B Visa Fee Could Strain Universities and Schools",
      "url": "https://www.nytimes.com/2025/10/08/us/politics/trump-h-1b-visa-fee-universities.html",
      "summary": "Higher education leaders and public-school superintendents say they depend on skilled foreign workers to fill critical roles."
    },
    {
      "title": "Air Traffic Staffing Shortages Disrupt Travel for Second Straight Day",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/air-traffic-control-government-shutdown.html",
      "summary": "The national air space has long been reeling from a staffing crisis among air traffic controllers, as the F.A.A. grapples with a shortage of about 3,000 controllers."
    },
    {
      "title": "Ex-FBI director James Comey to appear in court amid concerns of Trump weaponizing justice department – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/08/donald-trump-james-comey-justice-department-national-guard-chicago-antifa-government-shutdown-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Former FBI director expected to plead not guilty in case that has amplified concerns that the department is being used to pursue Trump’s enemies&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/08/james-comey-court-indictment\"&gt;Ex-FBI director to appear in court on lying to Congress charge&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;A &lt;a href=\"https://www.nationalreview.com/news/dem-ag-nominee-jay-jones-fantasized-about-shooting-former-virginia-gop-speaker-he-receives-both-bullets/\"&gt;series of “violent” texts&lt;/a&gt; sent by a Democrat seeking to become Virginia’s attorney general has shaken up the state’s governor’s race, with Republican candidate Winsome Earle-Sears seizing on the controversy to try to reverse her opponent’s double-digit polling lead.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Earle-Sears has released&lt;a href=\"https://x.com/winwithwinsome/status/1974832866388566097?s=46&amp;amp;t=uQxq3EX7p3bygcqVfUnstg\"&gt; new campaign advertisements&lt;/a&gt; condemning Democratic former congresswoman Abigail Spanberger, her opponenent in the governor’s race, for continuing to support Jay Jones, whose private texts three years ago speculated about a senior state Republican getting “two bullets to the head” and “breeding little fascists”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/08/donald-trump-james-comey-justice-department-national-guard-chicago-antifa-government-shutdown-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "More than 40 Trump administration picks tied directly to oil, gas and coal, analysis shows",
      "url": "https://www.theguardian.com/us-news/2025/oct/08/trump-administration-fossil-fuels-climate",
      "summary": "&lt;p&gt;Report looks at White House nominees and appointees and agencies dictating energy, environment and climate policy&lt;/p&gt;&lt;p&gt;Donald Trump has placed dozens of people with ties to the fossil fuel sector in his &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;administration&lt;/a&gt;, including more than 40 who have directly worked for oil, gas or coal companies, according to a &lt;a href=\"https://u7061146.ct.sendgrid.net/ls/click?upn=u001.gqh-2BaxUzlo7XKIuSly0rCxXwZR0L9lem-2B5XpAYqIXzOQgVY0Vp5bkBMOekGT0T0OZ6NJRkYH7gijmHnEP9Vi1auCzsK7HAb2BEB-2Fccsj1Co-3DU5UH_9zSeFP1w5uBM-2FrFVTZzTH7D8qX16e0hB7b1f0c81TGsENPaaIQ2nJI4iWgJqb1lGBmam4oj4-2FRMZEB3hdBv2Gojr44mf4RjJkDMcieA2BrDrTPJT841TmlfHsJphHudKh19qPP2-2Bn7Ha4IXF7yU8r2mqBPwSJCYErcuMEFfneizIKUwhA9vxamfJS2-2BBb7FSaHwiPY4ueWplcEiSsfJaHnWHwzkvcvBEKmeaYxRWu86QEUcRnxlInM-2FdbV1lDYQtkzZTjArHxcpmxtzR-2FMAW50CSxzBK4ILlh8KO8KmU6D-2BvITyZPOhCwceexbDCmgDmiLUwMVjDjGsYgWX7x3psv1ooaVea2FE5gJbvS00a7jM-3D\"&gt;new analysis&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;The report from Public Citizen, a consumer advocacy and ethics non-profit that has been critical of the Trump administration, alongside the Revolving Door Project, a corporate watchdog, analyzed the backgrounds of nominees and appointees within the White House and eight agencies dictating energy, environmental and climate policy. That includes the Environmental Protection Agency, the interior and energy departments and others.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/08/trump-administration-fossil-fuels-climate\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}