{
  "updatedAt": "2025-09-27T12:47:02.220Z",
  "items": [
    {
      "title": "Trump’s Repeated Attacks May Undercut Case Against Comey",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/trump-comey-vindictive-prosecution.html",
      "summary": "The president’s voluble vitriol could provide defense lawyers with an avenue to protect the very people he most wants to punish."
    },
    {
      "title": "Trump Displays Little Interest in Fostering Unity Amid Political Violence",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/political-violence-kirk-trump.html",
      "summary": "After an assassination attempt, Gov. George Wallace, the segregationist, got a surprise visitor: Shirley Chisholm, the first Black woman elected to Congress. Could this happen today?"
    },
    {
      "title": "Iowa Matters Less Than Ever for Democrats, but They Can’t Quit It",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/iowa-democrats-president.html",
      "summary": "The state no longer goes first for the party’s presidential nomination process, but ambitious politicians with an eye toward 2028 keep showing up. It’s “the gravitational pull,” as one Iowa Democrat put it."
    },
    {
      "title": "Jeanne Shaheen Wants to Make Foreign Policy Bipartisan Again",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/jeanne-shaheen-foreign-policy.html",
      "summary": "The Democrat from New Hampshire has worked to find common ground with the Trump administration on foreign affairs."
    },
    {
      "title": "Making Florida More Flood Resistant Is Forcing Hard Choices for Homeowners",
      "url": "https://www.nytimes.com/2025/09/27/us/making-florida-more-flood-resistant-is-forcing-hard-choices-for-homeowners.html",
      "summary": "A rule requiring many storm-damaged homes to be demolished or rebuilt to the latest flood-resistant standards has exacted personal and cultural costs."
    },
    {
      "title": "U.S. Says It Will Revoke Colombian President’s Visa",
      "url": "https://www.nytimes.com/2025/09/27/us/colombia-petro-visa-palestine.html",
      "summary": "The State Department called President Gustavo Petro of Colombia reckless after he called for U.S. soldiers to disobey President Trump at a pro-Palestinian rally."
    },
    {
      "title": "Kamala Harris’s new book details her steep challenges without acknowledging her failures",
      "url": "https://www.theguardian.com/us-news/2025/sep/27/amala-harris-107-days-analysis-biden-walz",
      "summary": "&lt;p&gt;In 107 Days, Harris leaves little room for nuance – nor is she afflicted with a surplus of self-awareness&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/kamala-harris\"&gt;Kamala Harris’s&lt;/a&gt; book &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/18/kamala-harris-book-tim-walz\"&gt;107 Days&lt;/a&gt; confirms two truths: Joe Biden never should have sought re-election and she did not belong on a national ticket.&lt;/p&gt;&lt;p&gt;Biden was snared by Father Time and hubris. The 46th president was not the transformational figure he saw in the mirror. &lt;a href=\"https://news.gallup.com/poll/654878/americans-think-history-rate-biden-presidency-negatively.aspx\"&gt;More than half&lt;/a&gt; the US rated him a failure.&lt;/p&gt;&lt;p&gt;107 Days &lt;a href=\"https://bookshop.org/p/books/untitled-s-s-nf-to-be-confirmed-simon-schuster/577e0cf201a3828c?ean=9781668211656&amp;amp;next=t\"&gt;is published&lt;/a&gt; in the US by Simon &amp;amp; Schuster&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/27/amala-harris-107-days-analysis-biden-walz\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "‘Hell on earth’: immigrants held in new California detention facility beg for help",
      "url": "https://www.theguardian.com/us-news/2025/sep/27/immigrants-california-detention-facility",
      "summary": "&lt;p&gt;Six people at a remote Ice facility in California City describe medical problems and filthy conditions, which operator CoreCivic denies&lt;/p&gt;&lt;p&gt;Immigrants locked up in California’s newest federal detention center have described the facility as a “a torture chamber”, “a zoo” and “hell on earth”, saying they were confined in filthy cells and suffered medical crises without help.&lt;/p&gt;&lt;p&gt;Six people detained at the California City detention center, which opened in late August and is now the state’s largest Immigration and Customs Enforcement (Ice) detention center, shared accounts with the Guardian of poor conditions and alleged mistreatment by staff.&lt;/p&gt;&lt;p&gt;staff were not consistently giving people daily medications, and some detainees fell unconscious due to health issues;&lt;/p&gt;&lt;p&gt;some toilets and sinks were backed up or not functioning properly, creating a stench;&lt;/p&gt;&lt;p&gt;detainees were left to clean their own cells, but not given proper supplies;&lt;/p&gt;&lt;p&gt;detainees were confined to cells for hours, and when they were allowed outdoors, it was sometimes only for 30 minutes a day in a dusty area with nothing to do;&lt;/p&gt;&lt;p&gt;small food portions left people hungry, with some saying they rationed meals and feared the water they were drinking was dirty.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/27/immigrants-california-detention-facility\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}