{
  "updatedAt": "2025-11-08T12:49:56.066Z",
  "items": [
    {
      "title": "What We Know About Flight Cancellations and Air Travel During the Shutdown",
      "url": "https://www.nytimes.com/2025/11/08/us/flight-cancellations-delays-airports-shutdown.html",
      "summary": "The Federal Aviation Administration has required airlines to cut flights to reduce the strain on air traffic controllers, who have gone weeks without a paycheck."
    },
    {
      "title": "Who Can Collect Food Stamps? Fact-Checking Claims About SNAP Eligibility and Spending.",
      "url": "https://www.nytimes.com/2025/11/08/us/politics/snap-food-stamps-eligibility-fact-check.html",
      "summary": "We examined falsehoods about SNAP eligibility and costs and the number of unauthorized immigrants receiving benefits."
    },
    {
      "title": "After More Than 30 Years, a Man Is Charged in Seattle Girl’s Killing",
      "url": "https://www.nytimes.com/2025/11/08/us/seattle-police-arrest-tanya-frazier-murder.html",
      "summary": "Tanya Marie Frazier, 14, never returned from summer school in 1994, and was found dead in a wooded area five days later. The police say a new DNA analysis links a felon to her death."
    },
    {
      "title": "UPS and FedEx Ground MD-11 Cargo Planes After Louisville Crash",
      "url": "https://www.nytimes.com/2025/11/08/us/ups-fedex-cargo-planes-grounded.html",
      "summary": "Boeing, the plane’s manufacturer, said it had recommended the grounding as a precaution while it conducts further analysis."
    },
    {
      "title": "Biden Warns of a ‘Very, Very Dark Moment’ as He Hits Out at Trump",
      "url": "https://www.nytimes.com/2025/11/07/us/politics/biden-trump-omaha-nebraska.html",
      "summary": "The former president, now a far less popular figure in his party, appeared in Nebraska for an overtly political speech that slammed his successor."
    },
    {
      "title": "Airport Disruptions Limited as Shutdown Flight Cuts Begin",
      "url": "https://www.nytimes.com/2025/11/07/us/airport-flight-cancellations-faa-shutdown.html",
      "summary": "About 3 percent of Friday’s flights were canceled because of the government shutdown. The percentage could rise to 20 percent as the holidays approach."
    },
    {
      "title": "A year after devastating Trump loss, have the Democrats begun to find their way back?",
      "url": "https://www.theguardian.com/us-news/2025/nov/08/democrats-trump-elections",
      "summary": "&lt;p&gt;Party was shell-shocked after 2024 defeat but Tuesday night’s coast-to-coast romp signals brighter times ahead&lt;/p&gt;&lt;p&gt;It has been a year of soul-searching, hand-wringing, and self-flagellation for &lt;a href=\"https://www.theguardian.com/us-news/democrats\"&gt;Democrats&lt;/a&gt; after a ballot-box rejection so thorough that some had come to believe that the party had lost not only the White House and Congress but &lt;a href=\"https://www.npr.org/2024/11/14/nx-s1-5183075/did-democrats-lose-on-the-economy-or-the-culture-wars-three-strategists-weigh-in\"&gt;the culture itself&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;Shell-shocked, Democrats entered Donald Trump’s second term in a political stupor – unsure of who they were or what they stood for. Their base had lost faith in its aging leadership class, and their brand, in Democrats’ own words, had become “&lt;a href=\"https://www.nytimes.com/2025/03/29/us/politics/newsom-democrats-toxic.html\"&gt;toxic&lt;/a&gt;”: a party increasingly confined to coastal states, big cities and college towns. And &lt;a href=\"https://www.nytimes.com/interactive/2024/11/06/us/politics/presidential-election-2024-red-shift.html\"&gt;even there&lt;/a&gt;, warning signs were flashing.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/08/democrats-trump-elections\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Joy Reid on her ouster from MSNBC: ‘In this moment, not being a part of corporate media is a gift’",
      "url": "https://www.theguardian.com/us-news/2025/nov/08/joy-reid-msnbc",
      "summary": "&lt;p&gt;After the ex-host of the ReidOut was forced out in February, she launched her own streaming show on YouTube&lt;/p&gt;&lt;p&gt;Joy Reid hosted the 7pm hour on &lt;a href=\"https://www.theguardian.com/media/msnbc\"&gt;MSNBC&lt;/a&gt; for nearly five years, providing a daily dose of progressive energy and verve that led into the network’s primetime programming. Then, in late February, Reid was suddenly forced out, and her show, The ReidOut, was cancelled as part of a broader programming shakeup at the network. Reid has since launched her own streaming show, The Joy Reid Show, and has a few things to say about the mainstream media she was once part of.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Now that it’s been eight months since you were abruptly fired by MSNBC, how do you view your departure? &lt;/strong&gt;&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/08/joy-reid-msnbc\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}