{
  "updatedAt": "2025-11-20T18:38:58.811Z",
  "items": [
    {
      "title": "Senate Democrats Investigate Kennedy Center Deals With Trump Allies",
      "url": "https://www.nytimes.com/2025/11/20/us/politics/democrats-kennedy-center-investigate.html",
      "summary": "Under Richard Grenell, the performing arts center has given steep discounts to CPAC and FIFA, signed contracts with administration associates and spent lavishly on friends."
    },
    {
      "title": "Democrats Raise Concerns Over Allied Curbs on Intelligence Sharing",
      "url": "https://www.nytimes.com/2025/11/20/us/politics/democrats-allies-intelligence-sharing.html",
      "summary": "Britain’s limits on sharing information reflect growing unease among partner nations over the legality of the U.S. strikes on boats purportedly carrying drugs."
    },
    {
      "title": "Before Fatal UPS Plane Crash, Engine Brace Had Cracked, Safety Agency Says",
      "url": "https://www.nytimes.com/2025/11/20/us/ups-plane-crash-louisville-engine-ntsb.html",
      "summary": "The cargo plane was taking off from Louisville earlier this month when it crashed moments after becoming airborne, killing the three crew members and 11 people on the ground."
    },
    {
      "title": "MacKenzie Scott Expands Giving Spree to Tribal Colleges",
      "url": "https://www.nytimes.com/2025/11/20/us/mackenzie-scott-giving-tribal-colleges.html",
      "summary": "The billionaire philanthropist is steering millions of dollars toward tribal schools, after the Trump administration proposed a significant federal funding cut."
    },
    {
      "title": "Lawsuit Challenges Trump Administration Over $1.8 Million in Immigration Fines",
      "url": "https://www.nytimes.com/2025/11/20/us/politics/lawsuit-immigration-penalties.html",
      "summary": "A class-action suit accuses the Trump administration of weaponizing civil penalties to force undocumented migrants to self-deport through enormous penalties."
    },
    {
      "title": "Trump Was Not Invited to Cheney’s Memorial Service",
      "url": "https://www.nytimes.com/2025/11/20/us/politics/trump-dick-cheney-funeral.html",
      "summary": "Former Vice President Dick Cheney, a once-powerful Republican, turned on Mr. Trump last year by announcing he would vote for Vice President Kamala Harris."
    },
    {
      "title": "US dignitaries go to Dick Cheney’s funeral but Trump, Obama and Clinton not in attendance – live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/20/donald-trump-jeffrey-epstein-justice-department-zohran-mamdani-news-updates-us-politics-live",
      "summary": "&lt;p&gt;Donald Trump and JD Vance reportedly not invited to the former vice-president’s funeral; Clintons and Obamas notably absent from the event&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/20/dick-cheney-funeral-trump-vance\"&gt;Donald Trump and JD Vance snubbed for Dick Cheney’s funeral&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The &lt;strong&gt;&lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt;&lt;/strong&gt; presented a new plan to roll back regulations in the &lt;strong&gt;Endangered Species Act (ESA)&lt;/strong&gt; on Wednesday, a move experts fear will accelerate the extinction crisis if adopted.&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://content.govdelivery.com/accounts/USDOI/bulletins/3fc00d6\"&gt;The proposed&lt;/a&gt;&lt;strong&gt;&lt;a href=\"https://content.govdelivery.com/accounts/USDOI/bulletins/3fc00d6\"&gt; &lt;/a&gt;&lt;/strong&gt;&lt;a href=\"https://content.govdelivery.com/accounts/USDOI/bulletins/3fc00d6\"&gt;changes&lt;/a&gt; would allow the federal government more power to weigh economic impact against habitat designations, remove safeguards against future events – including the impacts from the climate crisis – and rescind the “blanket rule” that automatically grants threatened species the same protections as those designated as endangered.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/20/donald-trump-jeffrey-epstein-justice-department-zohran-mamdani-news-updates-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Donald Trump and JD Vance snubbed for Dick Cheney’s funeral",
      "url": "https://www.theguardian.com/us-news/2025/nov/20/dick-cheney-funeral-trump-vance",
      "summary": "&lt;p&gt;Joe Biden and George W Bush attend Republican’s service, while notable absences included Barack Obama and Bill Clinton&lt;/p&gt;&lt;p&gt;Donald Trump and JD Vance have been snubbed, by not being invited to former vice-president Dick Cheney’s funeral, taking place on Thursday, according to a White House official familiar with the matter.&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/dick-cheney\"&gt;Cheney&lt;/a&gt;, the former US vice-president to George W Bush and Republican defense hawk who became a fierce critic of the current US president, died earlier this month at the age of 84.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/20/dick-cheney-funeral-trump-vance\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}