{
  "updatedAt": "2025-11-16T18:34:52.390Z",
  "items": [
    {
      "title": "Marjorie Taylor Greene Extends an Olive Branch to Trump",
      "url": "https://www.nytimes.com/2025/11/16/us/politics/marjorie-taylor-greene-trump-epstein-files.html",
      "summary": "The Georgia Republican, long a loyal Trump ally, had come under attack by the president after showing independence, notably on the government’s investigation of Jeffrey Epstein."
    },
    {
      "title": "Pentagon to Withdraw Some National Guard Troops From Chicago and Portland",
      "url": "https://www.nytimes.com/2025/11/16/us/politics/national-guard-withdrawal-chicago-portland.html",
      "summary": "The move comes amid court battles and objections by state and local leaders to President Trump’s deployment orders."
    },
    {
      "title": "Homeland Security Missions Falter Amid Focus on Deportations",
      "url": "https://www.nytimes.com/2025/11/16/us/politics/dhs-agents-reassigned.html",
      "summary": "Under President Trump, an agency intended to keep Americans safe has diverted resources from combating child abuse, trafficking and terrorism."
    },
    {
      "title": "How to Make Sense of Law Enforcement in the Streets",
      "url": "https://www.nytimes.com/video/us/politics/100000010484295/how-to-make-sense-of-law-enforcement-in-the-streets.html",
      "summary": "The variety of federal forces deployed to support President Trump’s mass deportation campaign and anticrime efforts continues to expand. Often, it can be difficult for the public to tell them apart, or to understand what powers each agency has."
    },
    {
      "title": "4 Dead After Suspected Migrant Boat Overturns Near a San Diego Area Beach",
      "url": "https://www.nytimes.com/2025/11/15/us/panga-boat-capsizes-imperial-beach.html",
      "summary": "The boat capsized off the coast, officials said. Four people were taken to a hospital and one person was taken into custody."
    },
    {
      "title": "U.S. Border Patrol Launches Operation in Charlotte, N.C.",
      "url": "https://www.nytimes.com/2025/11/15/us/us-border-patrol-charlotte-nc-immigration.html",
      "summary": "It is unclear how long the operation will last in North Carolina’s largest city, which has a growing immigrant population."
    },
    {
      "title": "Marjorie Taylor Greene says Trump’s remarks hurtful but hopes they can make up",
      "url": "https://www.theguardian.com/us-news/2025/nov/16/marjorie-taylor-greene-trump-remarks",
      "summary": "&lt;p&gt;Congresswoman, a longtime Trump ally, pushes back on president’s remarks labeling her a traitor and a lunatic&lt;/p&gt;&lt;p&gt;Georgia congresswoman &lt;a href=\"https://www.theguardian.com/us-news/marjorie-taylor-greene\"&gt;Marjorie Taylor Greene&lt;/a&gt; on Sunday called &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt;’s remarks labeling her a traitor and &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/15/marjorie-taylor-greene-safety-trump\"&gt;a lunatic&lt;/a&gt; “hurtful” but said she hopes she and the US president can “make up”, despite stark differences over policy and the release of documents about &lt;a href=\"https://www.theguardian.com/us-news/jeffrey-epstein\"&gt;Jeffrey Epstein&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;Greene, a longtime ally and fierce defender of Trump and the “Make America great again” (Maga) base, pushed back against his name-calling in her first interview since Trump &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/14/trump-marjorie-taylor-greene-support\"&gt;withdrew&lt;/a&gt; his support for her on Friday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/16/marjorie-taylor-greene-trump-remarks\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "The banality of evil: how Epstein’s powerful friends normalised him",
      "url": "https://www.theguardian.com/us-news/2025/nov/16/jeffrey-epstein-powerful-friends",
      "summary": "&lt;p&gt;Long after his conviction for sexual abuse, people in royalty, academia, business, journalism and politics sought his ear&lt;/p&gt;&lt;p&gt;He got by with a little help from his friends. From British royalty to White House alumni, from a Silicon Valley investor to a leftwing academic, connections and influence were the ultimate currency for &lt;a href=\"https://www.theguardian.com/us-news/jeffrey-epstein\"&gt;Jeffrey Epstein&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;Yet none appeared to challenge Epstein over his horrific crimes. If silence is complicity, the casual disdain of the elite circles he moved in spoke volumes.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/16/jeffrey-epstein-powerful-friends\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}