{
  "updatedAt": "2025-10-09T12:54:53.873Z",
  "items": [
    {
      "title": "Appeals Court to Weigh Legality of Deploying Troops to Portland",
      "url": "https://www.nytimes.com/2025/10/09/us/politics/appeals-court-national-guard-portland-oregon-trump.html",
      "summary": "Judge Karin Immergut blocked President Trump from sending National Guardsmen to defend against a “rebellion.” Now three judges will hear the government’s appeal."
    },
    {
      "title": "New York Fed President Backs Interest Rate Cuts to Protect Labor Market",
      "url": "https://www.nytimes.com/2025/10/09/us/politics/new-york-fed-president-williams-interview-interest-rate-cuts.html",
      "summary": "In a wide-ranging interview, John C. Williams discussed the outlook for interest rates, his concerns about the labor market and the importance of the Fed’s independence. Here is a full transcript."
    },
    {
      "title": "Harvard Seeks Assurances as Talks Restart in Washington",
      "url": "https://www.nytimes.com/2025/10/09/us/politics/harvard-trump-research-money.html",
      "summary": "University leaders are wary of a new proposal from the Trump administration to impose far-reaching changes in higher education."
    },
    {
      "title": "Bob Ross’s ‘Happy Little’ Paintings Will Be Auctioned",
      "url": "https://www.nytimes.com/2025/10/09/us/bob-ross-paintings-auction.html",
      "summary": "Thirty canvases, many created for viewers of Ross’s PBS series, “The Joy of Painting,” will be sold to benefit public television stations grappling with funding cuts."
    },
    {
      "title": "Judge to Hear Arguments on Whether Guard Troops Near Chicago Can Stay",
      "url": "https://www.nytimes.com/2025/10/09/us/chicago-illinois-national-guard-hearing.html",
      "summary": "As local anxiety builds, Illinois officials say the deployment of Guard troops violates state sovereignty, while the White House says the troops’ presence is needed."
    },
    {
      "title": "The Army’s Race to Catch Up in a World of Deadly Drones",
      "url": "https://www.nytimes.com/2025/10/09/us/army-drone-warfare.html",
      "summary": "The rapid proliferation of drones in places like Ukraine has set off a growing sense of alarm inside the U.S. Army."
    },
    {
      "title": "Hero dog leads police to Florida woman, 86, who had fallen while walking him",
      "url": "https://www.theguardian.com/us-news/2025/oct/09/hero-dog-florida-woman-fallen",
      "summary": "&lt;p&gt;Dog named Eeyore attracted sheriff’s deputy’s attention: ‘He practically dragged me to her’&lt;/p&gt;&lt;p&gt;A dog named Eeyore turned into a very good boy and a hero of the hour after leading a Florida sheriff’s deputy to where a missing 86-year-old woman had fallen while walking him, body-cam footage shows.&lt;/p&gt;&lt;p&gt;The woman’s husband reported her missing on the night of 25 September after she failed to return from her walk in their Destin neighborhood in the Panhandle region of the US state.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/09/hero-dog-florida-woman-fallen\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "National guard troops ‘protecting’ ICE and other federal property in Chicago area – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live",
      "summary": "&lt;p&gt;Move comes as Donald Trump calls for imprisonment of Brandon Johnson, Chicago’s mayor, and JB Pritzker, the Illinois governor&lt;/p&gt;&lt;p&gt;We’ll hear from &lt;strong&gt;Donald Trump&lt;/strong&gt; at &lt;strong&gt;11am EST today&lt;/strong&gt;, when he hosts a cabinet meeting at the White House. We can expect to hear more about the first phase of the peace plan, but also some more reaction to National Guard troops deployed to Chicago.&lt;/p&gt;&lt;p&gt;The president’s last cabinet meeting went on for more than three hours…so we’re buckled in.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}