{
  "updatedAt": "2025-10-25T12:48:36.798Z",
  "items": [
    {
      "title": "Keeping the House Absent, Johnson Marginalizes Congress and Himself",
      "url": "https://www.nytimes.com/2025/10/25/us/politics/mike-johnson-speaker-congress.html",
      "summary": "The speaker’s decision to hold the House in an indefinite hiatus during the shutdown is his latest move to diminish the role of the legislative branch — and his own post."
    },
    {
      "title": "An Obamacare Hot Spot Where Price Spikes Pose an Outsized Threat",
      "url": "https://www.nytimes.com/2025/10/25/us/obamacare-price-spikes-lost-subsidies-threaten-florida.html",
      "summary": "South Florida will feel some of the most intense reverberations if Congress allows the extra insurance subsidies it approved during the pandemic to expire."
    },
    {
      "title": "As Vance Takes on a Forceful New Role, His Positions Are Shifting",
      "url": "https://www.nytimes.com/2025/10/25/us/politics/jd-vance-shifting-positions.html",
      "summary": "Vice President JD Vance has found himself defending or promoting positions that he once opposed, even as recently as the campaign."
    },
    {
      "title": "Trump Administration Plans a Shake-Up at ICE to Speed Deportations",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/trump-deportations-ice.html",
      "summary": "The preliminary plan stems from frustration over the pace of the deportations, which are lagging behind President Trump’s demands."
    },
    {
      "title": "Immigration Crackdown Spreads Through Chicago, Including Wealthy Neighborhoods",
      "url": "https://www.nytimes.com/2025/10/24/us/trump-immigration-crackdown-chicago-lakeview.html",
      "summary": "Federal agents detained a man on the city’s North Side on Friday, and residents emerged from their homes, yelling and blowing whistles."
    },
    {
      "title": "Justice Department Will Monitor Elections in California and New Jersey",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/doj-election-monitors-california-new-jersey.html",
      "summary": "The Trump administration said that monitors will watch polling in two states, led by Democrats, where key races or issues are on the ballot."
    },
    {
      "title": "Pennsylvania city divided over Trump as it reels from economic whiplash",
      "url": "https://www.theguardian.com/us-news/2025/oct/25/erie-pennsylvania-trump-policies",
      "summary": "&lt;p&gt;As Trump’s tariffs and funding cuts suspend projects in Erie, some residents view the changes as a necessary evil&lt;/p&gt;&lt;p&gt;It was set to be the most expensive project that the beaten-down manufacturing sector of Erie, Pennsylvania, had seen in decades. In a blighted corner of town, a startup planned a $300m plant that would turn plastic waste into fuel for steel factories.&lt;/p&gt;&lt;p&gt;Neighborhood advocates in Erie’s impoverished east side hoped the facility would provide the jobs and prosperity they needed. Environmentalists decried the pollution they expected the plant to bring. Unions got ready for what they hoped would be hundreds of jobs created by its construction, with more to come once it opened.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/25/erie-pennsylvania-trump-policies\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "RFK Jr to urge Americans to eat more saturated fats, alarming health experts",
      "url": "https://www.theguardian.com/us-news/2025/oct/25/rfk-jr-saturated-fats",
      "summary": "&lt;p&gt;Guidance from health and human services secretary contradicts decades of dietary recommendations&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/robert-f-kennedy-jr\"&gt;Robert F Kennedy Jr&lt;/a&gt;, the health and human services secretary, is planning to issue guidance encouraging Americans to &lt;a href=\"https://thehill.com/policy/healthcare/5563449-rfk-jr-saturated-fats-health-guidance-maha-hhs/\"&gt;eat more saturated fats&lt;/a&gt;, contradicting &lt;a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC9794145/\"&gt;decades of dietary recommendations&lt;/a&gt; and alarming experts.&lt;/p&gt;&lt;p&gt;“My response and sort of counsel to myself was to stay calm, and let’s see what happens, because there was no indication given as to how, why, when this potential shift would occur,” said Cheryl Anderson, an American Heart Association board member and professor at the University of California, San Diego’s school of public health and human longevity science.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/25/rfk-jr-saturated-fats\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}