{
  "updatedAt": "2025-10-05T12:47:30.177Z",
  "items": [
    {
      "title": "Not All National Parks Remain Open in the Shutdown. Here’s What to Know.",
      "url": "https://www.nytimes.com/2025/10/05/us/shutdown-national-parks.html",
      "summary": "Some underground attractions are closed, and many outdoor sites have reduced their services."
    },
    {
      "title": "Texas L.G.B.T.Q. Teenagers and Families Navigate a Public School Clampdown",
      "url": "https://www.nytimes.com/2025/10/05/us/politics/texas-lgbtq-schools.html",
      "summary": "Under a new state law, public schools can no longer sponsor gay and gender clubs or “assist” with transitioning, but implementation appears to be varying by the politics of the districts."
    },
    {
      "title": "How Trump’s National Guard Deployments Break With Military Tradition",
      "url": "https://www.nytimes.com/video/us/politics/100000010433782/how-trumps-national-guard-deployments-break-with-military-tradition.html",
      "summary": "By sending troops to U.S. cities that are not in active crisis, President Trump is breaking with military tradition. Helene Cooper, who covers national security issues for The New York Times, compares his recent actions with earlier domestic military deployments."
    },
    {
      "title": "Can Conversion Therapy Be Banned? Supreme Court Will Decide on Colorado Law.",
      "url": "https://www.nytimes.com/2025/10/05/us/politics/supreme-court-conversion-therapy.html",
      "summary": "Colorado and more than 20 other states restrict therapists from trying to change the gender identity or sexual orientation of clients under age 18."
    },
    {
      "title": "Push for Military Coverage of I.V.F. Faces Challenge in Congress",
      "url": "https://www.nytimes.com/2025/10/05/us/politics/military-ivf-congress.html",
      "summary": "A proposal to expand the Defense Department’s health care plan to include in vitro fertilization is moving through Congress but could die behind closed doors, again."
    },
    {
      "title": "A Chilling New Tactic in Nicaragua: Arrest, Then Silence",
      "url": "https://www.nytimes.com/2025/10/05/us/a-chilling-new-tactic-in-nicaragua-arrest-then-silence.html",
      "summary": "Nicaragua’s authoritarian government has begun holding dissidents without revealing their whereabouts or acknowledging their detention. Two have turned up dead."
    },
    {
      "title": "Youth-led US climate activists widen focus to fight authoritarianism",
      "url": "https://www.theguardian.com/us-news/2025/oct/05/sunrise-movement-climate-activism-authoritarianism",
      "summary": "&lt;p&gt;Sunrise Movement, which led calls for a Green New Deal, will organize against Trump’s attacks on universities&lt;/p&gt;&lt;p&gt;As the Trump administration cracks down on both environmental policies and progressive activism, the &lt;a href=\"https://www.theguardian.com/us-news/2025/jun/18/sunrise-movement-big-oil-climate-bills\"&gt;Sunrise Movement&lt;/a&gt;, the youth-led climate justice organization that &lt;a href=\"https://www.theguardian.com/environment/2020/oct/16/sunrise-movement-wide-awakes-us-climate-activists\"&gt;popularized&lt;/a&gt; &lt;a href=\"https://www.theguardian.com/us-news/2020/nov/16/joe-biden-climate-crisis-ennvironment-energy\"&gt;calls&lt;/a&gt; for a Green New Deal, is widening its mission to fight authoritarianism.&lt;/p&gt;&lt;p&gt;“Every day, &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; is seizing power and shredding the Constitution,” Sunrise’s executive director, Aru Shiney-Ajay, wrote in an open letter to Sunrise members, funders and allies. “What ordinary people do in the coming months will determine whether he and his billionaire cronies can cement their grip on power and turn this country into a playground for the rich and powerful.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/05/sunrise-movement-climate-activism-authoritarianism\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "How likely is it that Trump’s Gaza plan will work?",
      "url": "https://www.theguardian.com/us-news/2025/oct/05/how-likely-trump-gaza-plan-work",
      "summary": "&lt;p&gt;The US president’s proposal is the closest negotiators have got to an end to the war – but a deal is still far off&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/world/live/2025/oct/05/gaza-ceasefire-israel-palestine-hamas-trump-cairo-negotiations-middle-east-crisis-live-news-updates\"&gt;Gaza ceasefire talks – live updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Hamas’s partial acceptance of Donald Trump’s Gaza deal on Friday has been welcomed internationally and is the closest Israel and Hamas have got in two years to ending the war in Gaza.&lt;/p&gt;&lt;p&gt;Negotiators from Israel, Hamas and Palestinian parties, and the US will meet in Cairo, where they will begin negotiations on Monday to iron out differences remaining in the US president’s plan. They have a groundswell of optimism and political momentum behind them as Israeli, Palestinian, US and Arab leaders alike urge the warring parties to reach a deal.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/05/how-likely-trump-gaza-plan-work\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}