{
  "updatedAt": "2025-09-19T18:47:17.525Z",
  "items": [
    {
      "title": "Protesters and federal agents clash outside an ICE detention facility near Chicago.",
      "url": "https://www.nytimes.com/live/2025/09/19/us/trump-news/protesters-and-federal-agents-clash-outside-an-ice-detention-facility-near-chicago",
      "summary": ""
    },
    {
      "title": "New to the Fed, Miran Defends Calls for Sharper Reduction in Interest Rates",
      "url": "https://www.nytimes.com/2025/09/19/us/politics/stephen-miran-fed-interest-rates.html",
      "summary": "In his first comments since joining the Federal Reserve Board, Stephen Miran sought to emphasize his independence from the White House."
    },
    {
      "title": "Fight Erupts Over Fate of U.S. Attorney Investigating Two Trump Foes",
      "url": "https://www.nytimes.com/2025/09/19/us/politics/erik-siebert-comey-letitia-james.html",
      "summary": "Trump officials told Erik S. Siebert that he was likely to be fired. He had hit roadblocks investigating New York’s attorney general, Letitia James, and the former F.B.I. director James B. Comey."
    },
    {
      "title": "Schumer, Wary of Blowback, Holds Out on Mamdani",
      "url": "https://www.nytimes.com/2025/09/19/us/politics/schumer-mamdani.html",
      "summary": "Will the Senate minority leader, the avatar of old New York politics, endorse the young, up-and-coming democratic socialist?"
    },
    {
      "title": "Trump Administration Petitions Supreme Court on Passport Gender Policy",
      "url": "https://www.nytimes.com/2025/09/19/us/politics/trump-administration-gender-passports.html",
      "summary": "The administration asked the justices to lift a lower court block on a policy requiring passports to reflect only the holder’s sex on an original birth certificate."
    },
    {
      "title": "Trump Officials Question Harvard’s Stability, Saying Federal Inquiries Raise Financial Risk",
      "url": "https://www.nytimes.com/2025/09/19/us/politics/trump-harvard-financial-risk.html",
      "summary": "The administration’s latest attack on the nation’s oldest university comes as negotiations stall for a settlement to restore billions in frozen federal research funds."
    },
    {
      "title": "Louisiana reports five deaths from flesh-eating bacteria found in coastal waters",
      "url": "https://www.theguardian.com/us-news/2025/sep/19/louisiana-flesh-eating-bacteria-deaths",
      "summary": "&lt;p&gt;Officials say deaths from Vibrio vulnificus exceeding average amid warning over climate-linked case increase&lt;/p&gt;&lt;p&gt;Five people in &lt;a href=\"https://www.theguardian.com/us-news/louisiana\"&gt;Louisiana&lt;/a&gt; have died in 2025 from a flesh-eating bacteria found in warm coastal waters, substantially exceeding the annual average on such deaths, state officials have said.&lt;/p&gt;&lt;p&gt;Those who had died from contracting Vibrio vulnificus as of Wednesday were among at least 26 to be infected with the bacteria, with each case resulting in hospitalization, according to &lt;a href=\"https://ldh.la.gov/news/vibrio-seafood-safety\"&gt;Louisiana’s department of health&lt;/a&gt;. Most of those cases – 85% – involved wounds being exposed to seawater, and 92% of the infected had one underlying health condition, the health department said.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/19/louisiana-flesh-eating-bacteria-deaths\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Man arrested by Ice dies in jail cell in Long Island, New York",
      "url": "https://www.theguardian.com/us-news/2025/sep/19/ice-death-long-island-ny",
      "summary": "&lt;p&gt;Officials in Nassau county confirmed death of 42-year-old man to Newsday but declined to share details&lt;/p&gt;&lt;p&gt;A man arrested by US Customs and Immigration Enforcement (Ice) died in a Long Island, New York, jail on Thursday, &lt;a href=\"https://www.newsday.com/long-island/politics/nassau-detainee-ice-k3n3lavn#utm_source=newsletter&amp;amp;utm_medium=email&amp;amp;utm_campaign=Breaking-News&amp;amp;lctg=ef6bd0f65322b80bee123366d74b955fed51c6e39a1f337b010dff2ed72fc948&amp;amp;utm_term=sub\"&gt;according to a report.&lt;/a&gt;&lt;/p&gt;&lt;p&gt;Officials in Nassau county confirmed the death of a 42-year-old man to Newsday but declined to share details, saying that an investigation was under way.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/19/ice-death-long-island-ny\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}