{
  "updatedAt": "2025-09-14T18:40:29.275Z",
  "items": [
    {
      "title": "White House Seeks More Supreme Court Security Funding After Kirk Killing",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/trump-security-supreme-court-congress.html",
      "summary": "In a notice to Congress, the Trump administration said the additional $58 million would go to the U.S. Marshals Service. It also said it supported additional security for lawmakers."
    },
    {
      "title": "Postcard Sent From the U.N. Is Returned to Sender After 72 Years",
      "url": "https://www.nytimes.com/2025/09/14/us/lost-postcard-united-nations.html",
      "summary": "Alan Ball sent the postcard to his family during the summer of 1953. Last week, it arrived at his home in Idaho."
    },
    {
      "title": "Kirk Shooting Suspect Held ‘Leftist Ideology,’ Utah Governor Says",
      "url": "https://www.nytimes.com/2025/09/14/us/kirk-shooting-suspect-ideology-partner.html",
      "summary": "Gov. Spencer Cox said the suspect had been “radicalized,” and noted he had a romantic partner who is transitioning from male to female who is cooperating fully with investigators."
    },
    {
      "title": "McCaul, a Foreign Policy Leader in the House, Won’t Seek Re-election",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/michael-mccaul-retires-house-texas.html",
      "summary": "Representative Michael McCaul, an 11-term Texas Republican who chairs the House Foreign Affairs Committee, announced on Sunday that he would retire from Congress."
    },
    {
      "title": "Arriving in Israel, Rubio Meets Netanyahu at Jerusalem’s Western Wall",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/israel-rubio-netanyahu-gaza.html",
      "summary": "The secretary of state is visiting Israel to consult with officials on security issues including the war in Gaza, which is testing relations with the United States."
    },
    {
      "title": "Inside the Golden State Valkyries, the Most Valuable Team in Women’s Sports",
      "url": "https://www.nytimes.com/2025/09/14/us/valkyries-wnba-playoffs.html",
      "summary": "Expectations were low for the Golden State Valkyries, the W.N.B.A.’s first expansion team in 17 years, but they captivated Bay Area sports fans and surprised the league by securing a playoff spot in their first season."
    },
    {
      "title": "Bobby Hart, co-writer of Monkees hits like Last Train to Clarksville, dies aged 86",
      "url": "https://www.theguardian.com/us-news/2025/sep/14/bobby-hart-monkees-writer-death",
      "summary": "&lt;p&gt;Hart, who wrote and produced for years with Tommy Boyce, died in his Los Angeles home after a period of poor health&lt;/p&gt;&lt;p&gt;Bobby Hart, a key part of &lt;a href=\"https://www.theguardian.com/music/the-monkees\"&gt;the Monkees&lt;/a&gt;’ multimedia empire who teamed with Tommy Boyce on such hits as Last Train to Clarksville and (I’m Not Your) Steppin’ Stone, has died. He was 86.&lt;/p&gt;&lt;p&gt;Hart died at his home in Los Angeles, according to his friend and co-author Glenn Ballantyne. He had been in poor health since breaking his hip last year.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/14/bobby-hart-monkees-writer-death\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "A tiny town in Idaho dodged incineration in 2024. Will the next wildfire take it out?",
      "url": "https://www.theguardian.com/us-news/2025/sep/14/stanley-idaho-wildfires",
      "summary": "&lt;p&gt;Heroic firefighting and a lucky turn in weather helped avert disaster once, but ‘a perfect storm of conditions’ remains&lt;/p&gt;&lt;p&gt;During a 2024 &lt;a href=\"https://www.theguardian.com/world/wildfires\"&gt;wildfire&lt;/a&gt; season described as “unprecedented”, the tiny central Idaho town of Stanley and nearby Redfish Lake Lodge narrowly missed incineration by two fires: the Bench Lake and then the Wapiti blazes.&lt;/p&gt;&lt;p&gt;It took heroic firefighting efforts and favorable turns in weather conditions for the town – a mountain mecca for tourists from around the world – to survive without the loss of a single life or home.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/14/stanley-idaho-wildfires\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}