{
  "updatedAt": "2025-09-09T18:44:36.802Z",
  "items": [
    {
      "title": "Michigan Judge Tosses Out Cases Against Fake Trump Electors",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/michigan-electors-ruling.html",
      "summary": "The judge, a Democrat, concluded that fake electors recruited to support Donald J. Trump’s candidacy in 2020 did not understand that they were being asked to do something illegal."
    },
    {
      "title": "Effort to Force a House Vote on Epstein Files Nears Success",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/epstein-house-vote.html",
      "summary": "Supporters are on the brink of collecting the 218 signatures to proceed, but House Republican leaders and the White House are trying to stop it."
    },
    {
      "title": "U.S. Wildfire Fighters to Mask Up After Decades-Long Ban on Smoke Protections",
      "url": "https://www.nytimes.com/2025/09/09/us/wildfires-masks-firefighters.html",
      "summary": "The Forest Service is changing course as it faces growing pressure over firefighters who are falling ill with cancer and other smoke-related illnesses."
    },
    {
      "title": "Gabbard Retracted Intelligence Report on Venezuela",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/gabbard-intelligence-report-venezuela.html",
      "summary": "The report, which remains classified, described work by Richard Grenell, a former top intelligence official in the Trump administration."
    },
    {
      "title": "Nick Fuentes: A White Nationalist Problem for the Right",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/nick-fuentes-trump.html",
      "summary": "For years, conservatives hoped that the notorious white nationalist would go away. Instead, Mr. Fuentes has gained more traction, even while opposing the president."
    },
    {
      "title": "In New Book, Think Tank Behind Project 2025 Takes On the Constitution",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/heritage-foundation-constitution-book.html",
      "summary": "The Heritage Foundation’s clause-by-clause analysis, to be published next month, is an originalist manifesto and a showcase for aspiring Supreme Court nominees."
    },
    {
      "title": "White House denies that Trump wrote Epstein letter and calls investigation a Democrat ‘hoax’ – live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news",
      "summary": "&lt;p&gt;White House press secretary denies that president wrote Epstein a card that included the outline of a woman’s body for the sex trafficker’s 50th birthday&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/09/trump-epstein-photo-check-woman\"&gt;Photo of novelty check suggests Epstein ‘sold’ Trump a woman&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/gallery/2025/sep/09/jeffrey-epstein-birthday-book-in-pictures\"&gt;Jeffrey Epstein’s 50th birthday book – in pictures&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;My colleague, &lt;strong&gt;Oliver Holmes&lt;/strong&gt;, has been &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/09/epstein-50th-birthday-book-who-is-in-it-and-what-did-they-say-donald-trump-bill-clinton-peter-mandelson\"&gt;going through the Jeffrey Epstein 50th birthday album&lt;/a&gt; that House Democrats on the oversight committee released on Monday, after they subpoenaed Epstein’s estate.&lt;/p&gt;&lt;p&gt;As Oliver notes, much of the book seems to be a collection of flattering and celebratory letters – often highly sexualised – from people who knew Epstein. They include photos of him embracing women in bikinis whose faces were redacted, and others showing scenes featuring wild animals having sex.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Bill Clinton&lt;/strong&gt;, who had left the US presidency a couple years before the publication of the book, is listed in the “friends” section.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Peter Mandelson&lt;/strong&gt;, the current UK ambassador to the United States, called Epstein his “best pal”. There are also photographs in the book which show Mandelson in shorts gazing from a balcony and in a white dressing gown laughing with Epstein.&lt;/p&gt;&lt;p&gt;One of the most striking images in the collection is a drawing of Epstein handing young girls balloons and a lollipop in 1983, alongside another drawing of him 20 years later, receiving a massage from topless women in 2003.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Epstein 50th birthday book: who is in it and what did they say?",
      "url": "https://www.theguardian.com/us-news/2025/sep/09/epstein-50th-birthday-book-who-is-in-it-and-what-did-they-say-donald-trump-bill-clinton-peter-mandelson",
      "summary": "&lt;p&gt;Figures including Donald Trump, Bill Clinton and the UK ambassador to US, Peter Mandelson, apparently contributed&lt;/p&gt;&lt;p&gt;Democratic politicians have released a 238-page scrapbook given to Jeffrey Epstein as a present on his 50th birthday, with contributions attributed to high-profile figures including Donald Trump, Bill Clinton and the current UK ambassador to Washington, Peter Mandelson.&lt;/p&gt;&lt;p&gt;Much of the book seems to be a collection of flattering and celebratory letters – often highly sexualised – from people who knew Epstein. They include photos of him embracing women in bikinis whose faces were redacted, and others showing scenes featuring wild animals having sex.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/09/epstein-50th-birthday-book-who-is-in-it-and-what-did-they-say-donald-trump-bill-clinton-peter-mandelson\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}