{
  "updatedAt": "2025-11-17T06:40:47.637Z",
  "items": [
    {
      "title": "New International Student Enrollment Plummeted This Fall, Survey Finds",
      "url": "https://www.nytimes.com/2025/11/17/us/international-students-enrollment-decrease.html",
      "summary": "The overall number of international students enrolled in U.S. colleges and universities, including those who enrolled in prior years or who are working after graduation, fell only slightly."
    },
    {
      "title": "Trump Defends Tucker Carlson After Nick Fuentes Interview",
      "url": "https://www.nytimes.com/2025/11/16/us/politics/trump-tucker-carlson-nick-fuentes.html",
      "summary": "President Trump defended Mr. Carlson’s friendly interview with an openly antisemitic white supremacist that prompted denunciations from some on the right."
    },
    {
      "title": "Trump Says House Republicans Should Vote to Release Epstein Files",
      "url": "https://www.nytimes.com/2025/11/16/us/politics/trump-epstein-files-release-vote.html",
      "summary": "President Trump reversed himself as he faced the prospect that dozens of Republicans could vote this week to compel his administration to release files related to Jeffrey Epstein."
    },
    {
      "title": "U.S. Airport Restrictions to End Monday",
      "url": "https://www.nytimes.com/2025/11/16/us/politics/faa-ends-airport-restrictions-monday.html",
      "summary": "The administrator of the F.A.A. said that attendance among air traffic controllers had improved. New data suggested that some airlines had not been complying with the flight cuts in recent days."
    },
    {
      "title": "At Catholic Churches, Trump’s Immigration Crackdown Takes Center Stage",
      "url": "https://www.nytimes.com/2025/11/16/us/catholic-church-immigration-trump.html",
      "summary": "Immigration was on the minds of priests and parishioners following a letter from the nation’s Catholic bishops decrying how immigrants are being treated."
    },
    {
      "title": "Latest U.S. Strike on Boat in Pacific Kills 3, Southern Command Says",
      "url": "https://www.nytimes.com/2025/11/16/us/politics/strike-boat-pacific-caribbean.html",
      "summary": "The United States has carried out at least 21 strikes on boats the Trump administration accuses of smuggling drugs, killing at least 83 people."
    },
    {
      "title": "Trump tells Republicans to vote to release Epstein files, in a reversal of his previous stance",
      "url": "https://www.theguardian.com/us-news/2025/nov/17/trump-tells-republicans-to-vote-to-release-epstein-files-saying-we-have-nothing-to-hide",
      "summary": "&lt;p&gt;The US president has said he backs US lawmakers efforts to release the files, ahead of an expected House vote this week&lt;/p&gt;&lt;p&gt;US president Donald Trump has urged his fellow Republicans in Congress to vote for the release of files related to the late convicted sex offender Jeffrey Epstein, reversing his earlier resistance to such a move.&lt;/p&gt;&lt;p&gt;Trump’s post on his Truth Social came after House speaker Mike Johnson said earlier that he believed a vote on releasing justice department documents in the Epstein case should help put to rest allegations “that he [Trump] has something to do with it”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/17/trump-tells-republicans-to-vote-to-release-epstein-files-saying-we-have-nothing-to-hide\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US attacks another alleged drug boat in Pacific, killing three, as Trump signals possible talks with Maduro",
      "url": "https://www.theguardian.com/us-news/2025/nov/16/pentagon-military-drug-boat-strike",
      "summary": "&lt;p&gt;Strike comes as navy’s most advanced aircraft carrier arrives in Caribbean Sea and president says US may open talks with Venezuelan leader&lt;/p&gt;&lt;p&gt;The United States conducted &lt;a href=\"https://www.theguardian.com/world/2025/nov/12/us-strikes-against-boats-in-caribbean-disregard-international-law-french-minister-says\"&gt;another&lt;/a&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/10/hegseth-boat-attacks\"&gt;attack&lt;/a&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/02/three-killed-in-us-military-strike-on-alleged-drug-vessel-in-the-caribbean\"&gt;on&lt;/a&gt; an alleged drug trafficking boat in the eastern Pacific on Saturday, killing three people aboard, the Pentagon said on Sunday.&lt;/p&gt;&lt;p&gt;“Intelligence confirmed that the vessel was involved in illicit narcotics smuggling, transiting along a known narco-trafficking route, and carrying narcotics,” the US Southern Command announced in a &lt;a href=\"https://x.com/Southcom/status/1990147866397221102\"&gt;post on social media&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/16/pentagon-military-drug-boat-strike\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}