{
  "updatedAt": "2025-10-20T12:55:14.822Z",
  "items": [
    {
      "title": "Judge Demands Answers on Trump Immigration Crackdown in Chicago",
      "url": "https://www.nytimes.com/2025/10/20/us/chicago-hearing-tear-gas-trump.html",
      "summary": "A federal judge has ordered operational leaders of the crackdown to appear before her on Monday to be questioned about their tactics and their use of tear gas."
    },
    {
      "title": "To Fight ICE, Portland’s Leaders Turn to What They Know Best: Zoning",
      "url": "https://www.nytimes.com/2025/10/20/us/politics/portland-ice.html",
      "summary": "Portland, Ore., is well known for its dense laws on land use. Now, under pressure from its liberal residents, the city is using those restrictions against immigrant detention."
    },
    {
      "title": "How Trump Aims to Redefine the Military",
      "url": "https://www.nytimes.com/video/us/politics/100000010448180/how-trump-aims-to-redefine-the-military.html",
      "summary": "President Trump and his defense secretary, Pete Hegseth, have been reshaping the way the U.S. military works. David Sanger, who covers the White House and national security for The New York Times, explains how Trump has been using the military lately."
    },
    {
      "title": "Trump Reiterates That He Wants to Send National Guard to San Francisco",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/trump-national-guard-san-francisco.html",
      "summary": "Such a move could increase the already high tension between the president and California officials"
    },
    {
      "title": "For Alaskan Evacuees, Home Is Gone, With No Return in Sight",
      "url": "https://www.nytimes.com/2025/10/19/us/alaska-storm-flooding-evacuations.html",
      "summary": "Their communities devastated from last weekend’s storm, many are in shelters in Anchorage and facing life in a completely different world."
    },
    {
      "title": "Shell Detonated Over Interstate 5 During Marines Event, California Officials Say",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/shell-interstate-5-marines-california.html",
      "summary": "The mishap, during an anniversary celebration for the Marine Corps attended by the vice president and defense secretary, underscores safety concerns that Gov. Gavin Newsom voiced before Saturday’s event at Camp Pendleton."
    },
    {
      "title": "Scramble to shore up ceasefire as Israel hits Gaza with deadly strikes | First Thing",
      "url": "https://www.theguardian.com/us-news/2025/oct/20/first-thing-scramble-to-shore-up-ceasefire-as-israel-hits-gaza-with-deadly-strikes",
      "summary": "&lt;p&gt;IDF says attack followed Hamas killing of two soldiers, but both sides say they are committed to ceasefire. Plus, No Kings protesters on their hopes for resistance movement against Trump&lt;/p&gt;&lt;p&gt;• &lt;a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"&gt;&lt;strong&gt;Don’t already get First Thing in your inbox? Sign up here&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;Israel launched waves of lethal airstrikes yesterday and cut off all aid into Gaza “until further notice” &lt;a href=\"https://www.theguardian.com/world/2025/oct/19/israel-identifies-body-of-11th-hostage-from-gaza-amid-ceasefire-tensions\"&gt;after a reported attack by Hamas&lt;/a&gt;, in escalations that marked the most serious threat so far to the increasingly fragile ceasefire.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What else is the US doing to help maintain the ceasefire?&lt;/strong&gt; Senior US officials, possibly including the vice-president, JD Vance, were expected to arrive in Israel in the coming days for what observers said was a clear effort to hold the Israeli prime minister, Benjamin Netanyahu, to the deal signed in Sharm-el-Sheikh, Egypt, earlier this month.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What happened in the meeting with Zelenskyy? &lt;/strong&gt;Ukraine’s president had flown to Washington hoping to capitalise on Trump’s growing frustration with Vladimir Putin after the summit in Alaska failed to produce a breakthrough in the war. But Zelenskyy left the US empty-handed, failing to secure long-range Tomahawk cruise missiles after weeks of lobbying.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/20/first-thing-scramble-to-shore-up-ceasefire-as-israel-hits-gaza-with-deadly-strikes\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "‘Contract that never was’ adds twist to scientist’s fight over Everglades project",
      "url": "https://www.theguardian.com/us-news/2025/oct/20/florida-everglades-project-tom-van-lent",
      "summary": "&lt;p&gt;A legal saga stemming from a water quality project saw Tom Van Lent briefly jailed in a case brought by allies of DeSantis&lt;/p&gt;&lt;p&gt;An environmental scientist briefly jailed in what he called a “political prosecution” brought by allies of Florida’s rightwing Republican governor, Ron DeSantis, now alleges new evidence shows his jail sentence stemmed from fraudulent allegations.&lt;/p&gt;&lt;p&gt;Tom Van Lent’s claim represents the latest twist in a &lt;a href=\"https://newrepublic.com/article/182364/everglades-scientist-trial-ron-desantis-florida\"&gt;three-year legal saga&lt;/a&gt; ignited by a disagreement over a proposed restoration project that aimed to address Florida’s recurrent red tides and toxic algal blooms by helping restore the environment of the vast Everglades wetlands.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/20/florida-everglades-project-tom-van-lent\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}