{
  "updatedAt": "2025-10-21T12:57:15.739Z",
  "items": [
    {
      "title": "This Democrat Lost a Big Race. The Party Is Uneasy About His Return.",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/mandela-barnes-governors-race-wisconsin.html",
      "summary": "Mandela Barnes, the former lieutenant governor of Wisconsin, lost a race for Senate in 2022. He is likely to run for governor in 2026, while Democrats are eager for new candidates and new ideas."
    },
    {
      "title": "No Education Department? No Problem, Trump’s Education Secretary Says.",
      "url": "https://www.nytimes.com/2025/10/21/us/education-department-shutdown-layoffs.html",
      "summary": "The shutdown means there is, essentially, no Education Department. The latest round of layoffs would leave few workers to enforce special education and civil rights laws."
    },
    {
      "title": "G.O.P. Senators Oppose Trump Watchdog Nominee After Report of Racist Texts",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/paul-ingrassia-trump-senate.html",
      "summary": "At least four Republican senators, including the Senate majority leader, signaled their opposition to Paul Ingrassia, the president’s pick to lead the Office of Special Counsel."
    },
    {
      "title": "Biden Completes a Course of Radiation Therapy for Prostate Cancer",
      "url": "https://www.nytimes.com/2025/10/20/us/politics/biden-cancer-treatment-radiation-therapy.html",
      "summary": "Former President Joseph R. Biden Jr. began radiation therapy last month for an aggressive form of prostate cancer. It is unclear if his treatment has ended."
    },
    {
      "title": "Some States With Democratic Governors Are Posting Partisan Shutdown Messages on Official Websites",
      "url": "https://www.nytimes.com/2025/10/20/us/politics/shutdown-messages-state-websites.html",
      "summary": "The messages follow a pattern set by the Trump administration, but use notably milder language."
    },
    {
      "title": "Illinois Officials Ask Supreme Court to Keep Block on Trump’s Chicago Troop Deployment",
      "url": "https://www.nytimes.com/2025/10/20/us/politics/trump-national-guard-chicago.html",
      "summary": "A Supreme Court ruling, while technically temporary, could set the ground rules for National Guard deployments elsewhere in the country."
    },
    {
      "title": "Police arrest man at Atlanta airport after getting tip he was planning to ‘shoot it up’",
      "url": "https://www.theguardian.com/us-news/2025/oct/21/atlanta-airport-arrest",
      "summary": "&lt;p&gt;Police found an assault rifle and ammunition in a Georgia man’s truck after his family had contacted them&lt;/p&gt;&lt;p&gt;Police arrested a man at &lt;a href=\"https://www.theguardian.com/us-news/atlanta\"&gt;Atlanta&lt;/a&gt;’s bustling airport on Monday after getting a tip from his family that he was planning to shoot up the place – and found an assault rifle and ammunition in his truck outside, the city’s police chief said.&lt;/p&gt;&lt;p&gt;Billy Joe Cagle, of Cartersville, Georgia, had described his plan to shoot up the world’s busiest airport on a social media livestream, said Darin Schierbaum, the chief of police, during a news conference.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/21/atlanta-airport-arrest\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump to host GOP senators at White House amid demolition work and government shutdown – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates",
      "summary": "&lt;p&gt;The president will host a lunch for Republicans in the Rose Garden as construction is carried out on the White House’s east wing&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The Central Intelligence Agency is providing the bulk of the intelligence used to carry out the controversial lethal air strikes by the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; against small, fast-going boats in the Caribbean Sea suspected of carrying drugs from Venezuela, according to three sources familiar with the operations.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Experts say the agency’s central role means much of the evidence used to select which alleged smugglers to kill on the open sea will almost certainly remain secret.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}