{
  "updatedAt": "2025-09-28T06:34:34.753Z",
  "items": [
    {
      "title": "Gunman Fires on Riverside Bar in North Carolina From Boat, Killing 3",
      "url": "https://www.nytimes.com/2025/09/28/us/north-carolina-boat-shooting.html",
      "summary": "Eight others were injured in the attack on the bar in Southport, N.C., the authorities said. The gunman escaped on the boat."
    },
    {
      "title": "A Man Is Linked to the Brutal ‘Yogurt Shop Murders’ 34 Years Ago",
      "url": "https://www.nytimes.com/2025/09/27/us/yogurt-shop-murders-dna-serial-killer.html",
      "summary": "Police said they used DNA to identify a suspect in the Austin killings known as the yogurt shop murders. The case has haunted the city for decades."
    },
    {
      "title": "Giuliani and Dominion Voting Systems Settle $1.3 Billion Defamation Suit",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/rudy-giuliani-dominion-case-settlement.html",
      "summary": "The election technology company Dominion Voting Systems had accused Rudolph W. Giuliani of waging “a viral disinformation campaign” over the 2020 election."
    },
    {
      "title": "Des Moines Schools Superintendent Arrested By ICE Is Placed on Leave",
      "url": "https://www.nytimes.com/2025/09/27/us/des-moines-schools-superintendent-ice-leave.html",
      "summary": "School Board members in Iowa’s capital made the decision one day after immigration officials accused the superintendent, Ian Roberts, of being in the country illegally."
    },
    {
      "title": "Trader Joe’s and Walmart Frozen Meals May Have Listeria Linked to Outbreak",
      "url": "https://www.nytimes.com/2025/09/27/us/listeria-outbreak-trader-joes-fettuccine-alfredo.html",
      "summary": "The outbreak has killed four people and spread to 15 states, with officials linking it to frozen pasta meals sold at Walmart and Kroger."
    },
    {
      "title": "At Least 3 Killed in Arizona Flood That Swept Away Vehicles Overnight",
      "url": "https://www.nytimes.com/2025/09/27/us/arizona-globe-flood.html",
      "summary": "The damage was concentrated in Globe, a small city east of Phoenix, where heavy rains overflowed a creek."
    },
    {
      "title": "Trump news at a glance: Trump orders deployment of national guard to ‘war ravaged’ Portland",
      "url": "https://www.theguardian.com/us-news/2025/sep/28/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;Officials in Portland have pushed back against the announcement, saying there is ‘no need for military troops’ – key US politics stories from Saturday 27 September&lt;/p&gt;&lt;p&gt;Donald Trump has ordered the deployment of the national guard to Portland, Oregon, authorizing “full force, if necessary”, ignoring calls from local and state officials who say the president has been misinformed about the scale of a protest outside a federal immigration office.&lt;/p&gt;&lt;p&gt;The president says that he has directed all necessary troops to be deployed to protect “war ravaged Portland”, claiming that immigration facilities were “under siege from attack by Antifa and other domestic terrorists”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/28/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Portland residents scoff at Trump threat to send military: ‘This is not a war zone’",
      "url": "https://www.theguardian.com/us-news/2025/sep/27/portland-oregon-trump-national-guard",
      "summary": "&lt;p&gt;Claims of violence by US president contrast with reality of life in vibrant, peaceful Oregon city, residents say&lt;/p&gt;&lt;p&gt;A visit to downtown Portland, Oregon, on Saturday, hours after Donald Trump falsely declared the city “war ravaged” to justify the deployment of federal troops, made it plain the US president’s impression of the city, apparently shaped by &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/05/trump-portland-video-protests\"&gt;misleading conservative media reports&lt;/a&gt;, is entirely divorced from reality.&lt;/p&gt;&lt;p&gt;There were just four protesters outside the Immigration and Customs Enforcement (Ice) field office in an outlying residential neighborhood that the president had claimed was “under siege” by antifascists and “other domestic terrorists”. Jack Dickinson, 26, wore a chicken costume draped in an American flag and held a sign that read “Portland Will Outlive Him”. Passing motorists honked in appreciation.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/27/portland-oregon-trump-national-guard\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}