{
  "updatedAt": "2025-10-11T18:30:26.799Z",
  "items": [
    {
      "title": "Search After Tennessee Explosion Finds No Survivors, Officials Say",
      "url": "https://www.nytimes.com/2025/10/11/us/tennessee-munitions-plant-explosion-deaths.html",
      "summary": "Local authorities said earlier that 18 people were missing after the blast at the ammunition plant. On Saturday, they said they were looking for remains."
    },
    {
      "title": "Biden Is Receiving Radiation Therapy for Cancer",
      "url": "https://www.nytimes.com/2025/10/11/us/politics/biden-cancer-radiation.html",
      "summary": "The former president, who was diagnosed with an aggressive form of prostate cancer in May, also had a cancerous lesion removed from his forehead recently."
    },
    {
      "title": "Tennessee Plant Where Explosion Took Place Employs Many in the Region",
      "url": "https://www.nytimes.com/2025/10/11/us/tennessee-plant-explosion-hickman-humphreys-counties.html",
      "summary": "The plant owned by Accurate Energetic Systems has long been an economic bedrock for families in rural Hickman and Humphreys Counties."
    },
    {
      "title": "At Least 4 Dead, 12 Wounded in Mississippi Shooting After Homecoming Game, Official Says",
      "url": "https://www.nytimes.com/2025/10/11/us/leland-mississippi-mass-shooting.html",
      "summary": "It was unclear what led to the shooting in Leland, Miss., which happened as the city was celebrating homecoming weekend, the mayor said."
    },
    {
      "title": "What We Know About the Explosion in Central Tennessee",
      "url": "https://www.nytimes.com/2025/10/11/us/tennessee-plant-explosion-what-we-know.html",
      "summary": "The blast happened at a plant owned by Accurate Energetic Systems. Local authorities said no survivors had been found after the site was searched."
    },
    {
      "title": "West Virginia’s School Vaccination Law Has Been Effective. That May Change.",
      "url": "https://www.nytimes.com/2025/10/11/us/west-virginia-school-vaccines.html",
      "summary": "The law allows only medical exemptions, and the state has one of the highest childhood vaccination rates. But hundreds of families are seeking religious exemptions."
    },
    {
      "title": "Six people dead with multiple injured in three shootings at Mississippi homecoming weekends",
      "url": "https://www.theguardian.com/us-news/2025/oct/11/leland-mississippi-mass-shooting",
      "summary": "&lt;p&gt;Four people were killed in an attack in Leland, while two were killed in Heidelberg, amid a third attack in Rolling Fork&lt;/p&gt;&lt;p&gt;Six people were killed and 18 others injured in three separate shootings at high school football homecoming celebrations in &lt;a href=\"https://www.theguardian.com/us-news/mississippi\"&gt;Mississippi&lt;/a&gt;, according to a number of local officials on Saturday.&lt;/p&gt;&lt;p&gt;The most fatal incident took place around midnight on Friday in Leland, where four people died, John Lee, the mayor of the small city in Washington county, western Mississippi, said on Saturday morning. At least 16 were wounded in that incident, with four in critical condition airlifted to the state capital of Jackson and 12 others treated at local hospitals.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/11/leland-mississippi-mass-shooting\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "No survivors in Tennessee explosives factory blast, officials say",
      "url": "https://www.theguardian.com/us-news/2025/oct/11/no-survivors-tennessee-explosives-factory",
      "summary": "&lt;p&gt;Initial toll after explosions at plant near McEwen on Friday was believed to be 19 people but later revised&lt;/p&gt;&lt;p&gt;There were no survivors in the &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/10/tennessee-military-explosives-plant-explosion\"&gt;blast&lt;/a&gt; that obliterated part of an explosives factory in rural &lt;a href=\"https://www.theguardian.com/us-news/tennessee\"&gt;Tennessee&lt;/a&gt;, authorities said on Saturday.&lt;/p&gt;&lt;p&gt;The families of 18 people had been waiting anxiously on Saturday as their loved ones had been feared dead since explosions ripped through the plant near McEwen in western Tennessee early on Friday. The initial toll had been believed to be 19 people but that figure was later revised.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/11/no-survivors-tennessee-explosives-factory\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}