{
  "updatedAt": "2025-10-20T06:39:10.318Z",
  "items": [
    {
      "title": "Trump Reiterates That He Wants to Send National Guard to San Francisco",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/trump-national-guard-san-francisco.html",
      "summary": "Such a move could increase the already high tension between the president and California officials"
    },
    {
      "title": "For Alaskan Evacuees, Home Is Gone, With No Return in Sight",
      "url": "https://www.nytimes.com/2025/10/19/us/alaska-storm-flooding-evacuations.html",
      "summary": "Their communities devastated from last weekend’s storm, many are in shelters in Anchorage and facing life in a completely different world."
    },
    {
      "title": "Shell Detonated Over Interstate 5 During Marines Event, California Officials Say",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/shell-interstate-5-marines-california.html",
      "summary": "The mishap, during an anniversary celebration for the Marine Corps attended by the vice president and defense secretary, underscores safety concerns that Gov. Gavin Newsom voiced before Saturday’s event at Camp Pendleton."
    },
    {
      "title": "U.S. Kills 3 on Boat Suspected of Smuggling Drugs for Colombian Rebels",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/trump-military-boat-strike-colombia.html",
      "summary": "It was the seventh known strike in President Trump’s military campaign of attacking, rather than arresting, those suspected of running drugs in the Caribbean."
    },
    {
      "title": "Hit-and-Run at a Child’s Birthday Party Leaves 1 Dead, 13 Hurt",
      "url": "https://www.nytimes.com/2025/10/19/us/crash-birthday-party-bladensburg.html",
      "summary": "The driver fled the scene after ramming a vehicle into a group of people, including children, outside a Maryland home Saturday night. He later turned himself in, the police said."
    },
    {
      "title": "Trump Posts Fake A.I. Video of Himself Flying a ‘King Trump’ Jet Over Protesters",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/trump-fake-video-no-kings.html",
      "summary": "President Trump shared what appeared to be an A.I.-generated video on social media. It shows Mr. Trump wearing a crown and flying a jet that dumps brown liquid on demonstrators."
    },
    {
      "title": "Trump news at a glance: ‘Illegal drug leader’ – threat of new tariffs against Colombia",
      "url": "https://www.theguardian.com/us-news/2025/oct/20/trump-briefing-news-at-a-glance-latest",
      "summary": "&lt;p&gt;Trump says Washington will also slash assistance to Colombia while US forces attack another alleged drug boat. Key US politics stories from Sunday 19 October&lt;/p&gt;&lt;p&gt;Donald Trump has escalated tensions between Washington and one of its closest Latin American allies, declaring the US will slash assistance to Colombia and enact tariffs on its exports because its president, Gustavo Petro, “does nothing to stop” drug production.&lt;/p&gt;&lt;p&gt;Trump referred to Petro as “an illegal drug leader” in a post on the Truth Social platform and warned that Petro “better close up” drug operations “or the United States will close them up for him, and it won’t be done nicely”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/20/trump-briefing-news-at-a-glance-latest\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Artillery shell exploded prematurely over California freeway during marines celebration",
      "url": "https://www.theguardian.com/us-news/2025/oct/19/california-marines-explosion-freeway-jd-vance",
      "summary": "&lt;p&gt;Shrapnel fragments rained on vehicles parked on Interstate 5 including highway patrol and JD Vance’s detail&lt;/p&gt;&lt;p&gt;A live artillery shell exploded prematurely during a marines live-fire demonstration that launched over a southern &lt;a href=\"https://www.theguardian.com/us-news/california\"&gt;California&lt;/a&gt; freeway in celebration of the military branch’s 250th anniversary, raining shrapnel down on a California Highway Patrol vehicle and a motorcycle that was part of &lt;a href=\"https://www.theguardian.com/us-news/jd-vance\"&gt;JD Vance&lt;/a&gt;’s detail, according to a police report.&lt;/p&gt;&lt;p&gt;The New York Times reported that fragments that fell from the 155mm shell landed on vehicles parked on a ramp on Interstate 5 – a major artery through southern California – which governor &lt;a href=\"https://www.theguardian.com/us-news/gavin-newsom\"&gt;Gavin Newsom&lt;/a&gt; had &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/18/california-highway-closure-military-celebration\"&gt;ordered closed&lt;/a&gt; after learning that military officials had no plans to close the freeway.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/19/california-marines-explosion-freeway-jd-vance\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}