{
  "updatedAt": "2025-10-25T06:34:25.114Z",
  "items": [
    {
      "title": "Trump Administration Plans a Shake-Up at ICE to Speed Deportations",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/trump-deportations-ice.html",
      "summary": "The preliminary plan stems from frustration over the pace of the deportations, which are lagging behind President Trump’s demands."
    },
    {
      "title": "Immigration Crackdown Spreads Through Chicago, Including Wealthy Neighborhoods",
      "url": "https://www.nytimes.com/2025/10/24/us/trump-immigration-crackdown-chicago-lakeview.html",
      "summary": "Federal agents detained a man on the city’s North Side on Friday, and residents emerged from their homes, yelling and blowing whistles."
    },
    {
      "title": "Justice Department Will Monitor Elections in California and New Jersey",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/doj-election-monitors-california-new-jersey.html",
      "summary": "The Trump administration said that monitors will watch polling in two states, led by Democrats, where key races or issues are on the ballot."
    },
    {
      "title": "Trump Leaves Behind a Reeling Washington to Chase a Deal With China",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/trump-china-trade-deal.html",
      "summary": "President Trump is embarking on a six-day diplomatic tour of Asia, testing his role as a statesman and negotiator as he pursues a trade deal with Beijing."
    },
    {
      "title": "Bannon Claims ‘There Is a Plan’ for Trump to Run for a Third Term",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/president-trump-2028-steve-bannon.html",
      "summary": "The claim comes after months of President Trump toying with the idea, insisting that he is “not joking” about defying a constitutionally-mandated term limit."
    },
    {
      "title": "D.C. Seeks to Block National Guard Deployment in Court",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/national-guard-dc-lawsuit.html",
      "summary": "During a hearing on Friday, lawyers told a judge that National Guard troops sent from Republican-led states had been conducting conduct law enforcement work."
    },
    {
      "title": "Trump says he would be open to meeting Kim Jong-un as he embarks on whirlwind Asia tour",
      "url": "https://www.theguardian.com/us-news/2025/oct/25/trump-open-to-meeting-kim-jong-un-asia-tour-japan-korea-xi-jinping",
      "summary": "&lt;p&gt;The trip will see him take part in high-stakes trade talks with Chinese leader Xi Jinping – but he also raised the prospect of meeting the North Korean leader&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-asia-tour-key-questions-xi-jinping-china-japan-south-korea-malaysia\"&gt;&lt;strong&gt;Trump in Asia: five key questions as US president prepares for diplomatic tour&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Donald Trump has embarked on a tour of Asia where he is expected to take part in high-stakes trade talks with Chinese leader Xi Jinping – telling reporters that he was also open to a meeting with North Korean leader Kim Jong-un.&lt;/p&gt;&lt;p&gt;Trump, who left Washington on Friday night, &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-asia-tour-key-questions-xi-jinping-china-japan-south-korea-malaysia\"&gt;is set for a five-day trip&lt;/a&gt; to Malaysia, Japan and South Korea, his first to the region since taking office in January.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/25/trump-open-to-meeting-kim-jong-un-asia-tour-japan-korea-xi-jinping\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "What is the White House East Wing and why has it been torn down in Trump’s renovation plans?",
      "url": "https://www.theguardian.com/us-news/2025/oct/25/what-is-the-white-house-east-wing-and-why-has-it-been-torn-down-in-trumps-renovation-plans",
      "summary": "&lt;p&gt;President Donald Trump is adding a $300m ballroom to the White House – but that plan has come at the cost of the historic East Wing&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/24/white-house-demolition-east-wing-trump-ballroom\"&gt;&lt;strong&gt;East Wing of White House reduced to rubble as part of Trump’s ballroom construction&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;It was confirmed on Friday that the East Wing of the White House has now been completely destroyed, days after construction started on the planned $300m (£225m) ballroom that Donald Trump is adding to the historic building.&lt;/p&gt;&lt;p&gt;The demolition marked a reversal of &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/23/trump-white-house-ballroom-reaction\"&gt;Trump’s earlier promise in July&lt;/a&gt; that none of the White House’s existing infrastructure would be torn down during construction of the ballroom.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/25/what-is-the-white-house-east-wing-and-why-has-it-been-torn-down-in-trumps-renovation-plans\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}