{
  "updatedAt": "2025-10-28T18:39:20.384Z",
  "items": [
    {
      "title": "Shutdown Makes Air Travel System ‘Less Safe,’ Air Traffic Controllers Say",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/shutdown-air-traffic-controllers-duffy.html",
      "summary": "Controllers have urged air passengers to contact their representatives to end the shutdown. The transportation secretary also warned of consequences for travel, though he said the system remained safe."
    },
    {
      "title": "After Law Firm Deals With Trump, D.C. Bar Warns of Ethical Jeopardy",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/trump-settlements-law-firms-ethical-issues.html",
      "summary": "The bar group’s ethics committee says firms that make a deal with the government may need to get waivers from clients with opposing interests."
    },
    {
      "title": "Dozens of States Sue Trump Administration Over Food Stamp Funding During Shutdown",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/trump-food-stamps-snap-lawsuit.html",
      "summary": "The states petitioned a federal court days after the Agriculture Dept. said it would not take emergency steps to provide aid during the government shutdown."
    },
    {
      "title": "Steven Hatfill, Covid Vaccine Critic, Is Ousted From H.H.S.",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/hatfill-covid-hhs-ousted.html",
      "summary": "Dr. Hatfill said he was pushed out by Health Secretary Robert F. Kennedy Jr.’s chief of staff, who fired him when he refused to resign."
    },
    {
      "title": "Trump’s Feud With Colombian Leader Threatens U.S. Antidrug Efforts",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/trump-colombia-petro.html",
      "summary": "President Trump said he is cutting U.S. aid. Gustavo Petro, a leftist guerrilla turned president, has called Mr. Trump’s boat strikes murder."
    },
    {
      "title": "U.S. Military Kills 14 More People Accused of Smuggling Drugs on Boats",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/us-military-boat-strikes.html",
      "summary": "Defense Secretary Pete Hegseth said that the three strikes hit four boats in international waters and that there had been one survivor."
    },
    {
      "title": "Two dozen states sue Trump administration over potential food stamp cuts – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/28/donald-trump-sanae-takaichi-japan-trade-national-guard-us-politics-live",
      "summary": "&lt;p&gt;State officials ask federal judge to force Washington to use emergency reserve funds so 42 million Americans on food stamps will not lose their benefits on 1 November&lt;/p&gt;&lt;p&gt;In &lt;a href=\"https://oversight.house.gov/wp-content/uploads/2025/10/102528_Department-of-Justice.pdf\"&gt;a letter&lt;/a&gt; this morning, James Comer, the House oversight chair, has asked the justice department to investigate whether Joe Biden’s aides improperly used an autopen to sign executive actions, claiming the former president’s inner circle concealed his cognitive decline while exercising presidential authority without authorization.&lt;/p&gt;&lt;p&gt;“While President Biden’s deterioration was evident to the American people, and consequently, robust systems should have been put in place to document executive actions reflected the actual will of the president, the President’s inner circle took no action to establish such a record,” Comer wrote in the letter.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/28/donald-trump-sanae-takaichi-japan-trade-national-guard-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Gavin Newsom tells supporters of redistricting proposal to ‘stop donating’",
      "url": "https://www.theguardian.com/us-news/2025/oct/28/gavin-newsom-prop-50-donations-california",
      "summary": "&lt;p&gt;California governor launched the effort to counter Texas’ gerrymander and has far out-raised measure’s opponents&lt;/p&gt;&lt;p&gt;With just one week before California voters are set to head to the polls to decide on the state’s redistricting proposal, Gavin Newsom sent an unexpected message to would be donors: keep your money.&lt;/p&gt;&lt;p&gt;“We have hit our budget goals and raised what we need in order to pass Proposition 50. You can stop donating,” the California governor said in an email.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/28/gavin-newsom-prop-50-donations-california\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}