{
  "updatedAt": "2025-10-17T12:54:28.097Z",
  "items": [
    {
      "title": "U.S. Says Louisiana Man Joined Hamas-Led 2023 Attack on Israel",
      "url": "https://www.nytimes.com/2025/10/17/us/fbi-hamas-attack-louisiana.html",
      "summary": "A man was in custody after federal prosecutors accused him of joining Gazan militants in attacking Israel on Oct. 7, 2023. He was also accused of lying to obtain a U.S. visa."
    },
    {
      "title": "What We Know About the Latest ‘No Kings’ Protests Amid Government Shutdown",
      "url": "https://www.nytimes.com/2025/10/17/us/no-kings-protest.html",
      "summary": "The nationwide protests are playing out as a federal government shutdown lingers and troops are being deployed in cities."
    },
    {
      "title": "Universities Are Standing Up to Trump",
      "url": "https://www.nytimes.com/2025/10/17/us/universities-are-standing-up-to-trump.html",
      "summary": "A White House proposal for special funding treatment crossed a line for several schools. Some say it feels like a turning point in the federal government’s battle with higher education."
    },
    {
      "title": "ICE Deported a Teen and Her Mother. Devastation Met Them in Guatemala.",
      "url": "https://www.nytimes.com/2025/10/17/us/ice-immigration-deportations.html",
      "summary": "ICE deported 17-year-old Nory Sontay Ramos and her mother. Devastation met them in Guatemala."
    },
    {
      "title": "Top San Francisco Lawmaker Expected to Challenge Nancy Pelosi in Primary",
      "url": "https://www.nytimes.com/2025/10/17/us/politics/nancy-pelosi-scott-wiener.html",
      "summary": "Ms. Pelosi, 85, has not yet said whether she will run again. The challenge would be the latest example of the Democratic Party facing a push for generational change."
    },
    {
      "title": "Salesforce Offers Its Services to Boost Trump’s Immigration Force",
      "url": "https://www.nytimes.com/2025/10/16/us/salesforce-benioff-ice.html",
      "summary": "The San Francisco-based firm has told ICE that it could use A.I. to help the agency nearly triple its staff. The company’s C.E.O., once a progressive tech titan, has embraced President Trump."
    },
    {
      "title": "John Bolton expected to surrender to authorities on Friday after being indicted – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates",
      "summary": "&lt;p&gt;Eighteen-count indictment of former Trump adviser handed down by federal grand jury in Maryland as US president calls ex-ally a ‘bad guy’&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The &lt;a href=\"https://www.theguardian.com/us-news/us-senate\"&gt;US Senate&lt;/a&gt; failed on Thursday to re-open the government and to vote to fund the military during the federal government shutdown, ensuring that the standoff will stretch into next week.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The Senate vote on a short-term &lt;a href=\"https://www.theguardian.com/us-news/republicans\"&gt;Republican&lt;/a&gt; funding bill failed for the 10th time with just 51 votes. A second vote on Pentagon funding in the afternoon similarly failed in a floor vote, meaning the process to begin fully funding military operations also becomes a non-starter. After the votes, senators are expected to leave Washington for the weekend, almost guaranteeing the shutdown lasts until at least Monday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "The bipartisan tool that could help lower energy bills across the US",
      "url": "https://www.theguardian.com/us-news/2025/oct/17/tool-lower-home-energy-bills",
      "summary": "&lt;p&gt;With AI datacenters soaring power bills for households, a policy called ‘demand flexibility’ could help ease grid strain&lt;/p&gt;&lt;p&gt;A cheap, bipartisan tool could help the US meet increasing energy demand from AI datacenters while also easing soaring power bills for households, preventing deadly blackouts and helping the climate.&lt;/p&gt;&lt;p&gt;The policy solution, called “demand flexibility”, can be quickly deployed across the US. Demand flexibility essentially means rewarding customers for using less power during times of high demand, reducing strain on the grid or in some cases, selling energy they have captured by solar panels on their homes.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/17/tool-lower-home-energy-bills\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}