{
  "updatedAt": "2025-10-19T12:48:43.776Z",
  "items": [
    {
      "title": "Shutdown Fight Reopens Debate in G.O.P. Over Health Care",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/obamacare-republicans-shutdown-subsidies.html",
      "summary": "The spending showdown has highlighted Republicans’ failure to produce an alternative to Obamacare, which many of them assail but concede is too politically risky to undo."
    },
    {
      "title": "A Squalid Building, a Tip to the Feds, and Then ‘Straight-Up Chaos’",
      "url": "https://www.nytimes.com/2025/10/19/us/chicago-south-shores-border-patrol-raid.html",
      "summary": "An immigration raid on an apartment building in Chicago followed years of problems with crime, and neglect by landlords. It swept up dozens of U.S. citizens who were detained in the middle of the night."
    },
    {
      "title": "It’s 2025, and Democrats Are Still Running Against Trump",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/democratic-campaign-ads-trump.html",
      "summary": "In New Jersey, Virginia and beyond, voters have been inundated with ads linking Republican candidates to the president. Some Democratic strategists see a missed opportunity to forge a more positive message."
    },
    {
      "title": "The Democratic Mayor Who Thinks Cities Are Handling Trump Wrong",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/houston-mayor.html",
      "summary": "Mayor John Whitmire of Houston believes the best way to govern a diverse, immigrant-heavy city in the current political climate is by keeping your head down and your ambitions modest."
    },
    {
      "title": "Vance Flexes the Marines’ Might as Thousands Protest Trump’s Agenda",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/vance-marines-california-protests.html",
      "summary": "Vice President JD Vance’s trip to a military base in California illustrated rising tensions between the federal government and Democratic leaders."
    },
    {
      "title": "Woman Who Tried to Blame Twin for Fatal Buggy Crash Sentenced to 4 Years",
      "url": "https://www.nytimes.com/2025/10/18/us/minnesota-amish-buggy-crash-sentence.html",
      "summary": "The crash killed two Amish children and injured two others in rural Minnesota in 2023."
    },
    {
      "title": "‘Empty shelves, higher prices’: Americans tell of cost of Trump’s tariffs",
      "url": "https://www.theguardian.com/us-news/2025/oct/19/trump-tariffs-us-consumers",
      "summary": "&lt;p&gt;US consumers say price rises caused by president’s tariffs contradicts his promise to make life more affordable&lt;/p&gt;&lt;p&gt;As a mother of two, Paige Harris has noticed a change in the way she shops for her family.&lt;/p&gt;&lt;p&gt;“Items that I have bought regularly have gone up in price steadily,” she said. “From hair dye to baby formula, our grocery list has gotten smaller while our budget has had to increase. Meats like steak are a no-go for our household.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/19/trump-tariffs-us-consumers\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Fears over higher rates as Georgia moves to provide more electricity for AI datacenters",
      "url": "https://www.theguardian.com/us-news/2025/oct/19/georgia-electricity-datacenters",
      "summary": "&lt;p&gt;State’s Republican-led public service commission to decide on power expansion and prices, as Democrats vie for voice&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/state-of-georgia\"&gt;Georgia&lt;/a&gt; is facing the largest demand for electricity in its history, driven by nation-leading datacenter construction.&lt;/p&gt;&lt;p&gt;The Georgia Power company has made an unprecedented bid to the agency that oversees the utility for about 10 additional gigawatts of energy in the coming years – enough to power 8.3m homes, at an estimated cost of nearly $16bn, according to the &lt;a href=\"https://www.selc.org/\"&gt;Southern Environmental Law Center&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/19/georgia-electricity-datacenters\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}