{
  "updatedAt": "2025-09-30T18:35:02.155Z",
  "items": [
    {
      "title": "Schools Superintendent in Iowa, Arrested by ICE, Plans to Resign",
      "url": "https://www.nytimes.com/2025/09/30/us/des-moines-ian-roberts-resign.html",
      "summary": "A lawyer for Ian Roberts, superintendent of Des Moines Public Schools, announced that Dr. Roberts would step down."
    },
    {
      "title": "Harvard Blasts Administration Over ‘Inaccurate’ Civil Rights Investigation",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/harvard-response-trump.html",
      "summary": "The Sept. 19 letter came days before the Department of Health and Human Services started the process of cutting off federal funds to the university."
    },
    {
      "title": "Bobby Cain, Barrier Breaker in School Desegregation, Dies at 85",
      "url": "https://www.nytimes.com/2025/09/30/us/bobby-cain-dead.html",
      "summary": "In 1957, facing down white mobs, he became the first Black student to graduate from a public high school in the South under a court mandate."
    },
    {
      "title": "Gov. Jeff Landry Wants National Guard Troops Deployed in Louisiana",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/jeff-landry-louisiana-national-guard.html",
      "summary": "Gov. Jeff Landry’s request to the Trump administration highlights how Republican-led states are embracing the president’s push to use the Guard to crack down on crime."
    },
    {
      "title": "Deadlock Grows Uglier as Congress Heads Toward Government Shutdown",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/government-shutdown-deadlock.html",
      "summary": "President Trump’s posting of a deepfake video mocking and insulting the top two Democrats in Congress underscored the lack of progress toward any deal to extend funding."
    },
    {
      "title": "Hegseth Lectures Military Brass on ‘Woke’ Leaders, Fitness and Grooming",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/hegseth-military-officers.html",
      "summary": "Senior officers, summoned from around the world, are entrusted to manage complex military operations. They got a lecture on fitness and grooming standards."
    },
    {
      "title": "Trump says government shutdown likely as House Democrats call out Republicans for delaying votes before funding deadline – live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
      "summary": "&lt;p&gt;Government funding is set to expire at midnight ET; Republican speaker Mike Johnson pushed back House return in order to prevent Democrats from negotiating further&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The US government is hurtling towards its first shutdown in six years, with no signs &lt;a href=\"https://www.theguardian.com/us-news/us-congress\"&gt;congressional&lt;/a&gt; leaders are near agreement on legislation to continue funding beyond the Tuesday night deadline to prevent workers from being furloughed and agencies from shutting their doors.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Congress’s &lt;a href=\"https://www.theguardian.com/us-news/republicans\"&gt;Republican&lt;/a&gt; majority is pushing legislation to fund the government through 21 November, but Democrats have refused to vote for it unless it includes a series of concessions centered on healthcare.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "What is a government shutdown and why is this year’s threat more serious?",
      "url": "https://www.theguardian.com/us-news/2025/sep/27/government-shutdown-explainer",
      "summary": "&lt;p&gt;US government will shut down on 1 October if Congress cannot reach a funding agreement. Here is what to know&lt;/p&gt;&lt;p&gt;The federal government is once again on the brink of a shutdown, unless &lt;a href=\"https://www.theguardian.com/us-news/us-congress\"&gt;Congress&lt;/a&gt; can reach a funding agreement before the start of the new fiscal year, on 1 October.&lt;/p&gt;&lt;p&gt;With the clock ticking and both Democrats and Republicans seemingly dug in, there is little time left to avoid a lapse in government funding. And in a sharp escalation, the White House has threatened permanent mass layoffs of government workers in the event of a shutdown, adding to the roughly &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/28/us-mass-resignation-federal-workers\"&gt;300,000 &lt;/a&gt;it forced out earlier this year.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/27/government-shutdown-explainer\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}