{
  "updatedAt": "2025-11-14T06:39:30.665Z",
  "items": [
    {
      "title": "The Shutdown Is Over. For Many SNAP Recipients, the Scars Remain.",
      "url": "https://www.nytimes.com/2025/11/14/us/the-shutdown-is-over-for-many-snap-recipients-the-scars-remain.html",
      "summary": "Some recipients have seen their benefits return but are worried they could still be taken away. Others wonder whether the funding could be stopped again at some point."
    },
    {
      "title": "N.I.H. Worker Who Criticized Trump Health Policies Says She Is on Administrative Leave",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/nih-trump-jenna-norton.html",
      "summary": "The employee, Dr. Jenna Norton, was a key organizer of “The Bethesda Declaration,” a scathing public letter issued in June to Dr. Jay Bhattacharya, the N.I.H. director."
    },
    {
      "title": "Republicans Tried to Squelch the Epstein Furor. Instead, They Fed It.",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/republicans-epstein-trump-house.html",
      "summary": "A House investigation that the G.O.P. has tried to use to deflect calls for more transparency has yielded striking revelations that have only fueled the Epstein saga."
    },
    {
      "title": "California’s Pack Fire Spreads, Forcing Evacuations",
      "url": "https://www.nytimes.com/2025/11/13/us/pack-fire-mono-county-california.html",
      "summary": "The Pack fire has grown to 3,400 acres amid high winds, but a coming winter storm might help firefighters control the blaze."
    },
    {
      "title": "After 3 Whale Deaths Off British Columbia, Researchers Fear a Pattern",
      "url": "https://www.nytimes.com/2025/11/13/us/humpback-whale-dead-bc-canada.html",
      "summary": "A humpback whale known to locals since 2004 was found dead on Nov. 8. Vessel collisions have become a major threat to humpback whales in the region."
    },
    {
      "title": "John Beam, Football Coach Who Was Focus of Netflix’s ‘Last Chance U,’ Is Shot",
      "url": "https://www.nytimes.com/2025/11/13/us/john-beam-laney-college-shooting-last-chance.html",
      "summary": "The coaching fixture John Beam was gravely wounded in a shooting at Laney College in Oakland, Calif., a commuter school where he is athletic director, according to a city councilman."
    },
    {
      "title": "Hegseth announces military operation to remove ‘narco-terrorists from our Hemisphere’– as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/13/donald-trump-jeffrey-epstein-files-us-government-shutdown-latest-news-updates",
      "summary": "&lt;p&gt;This live blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/13/trump-news-at-a-glance-latest-updates\"&gt;Trump news at a glance: president faces potentially damaging congressional vote over releasing Epstein files&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Democrats appear more enthusiastic than Republicans about voting in next year’s congressional elections following the party’s victories in recent state and local contests, according to a new Reuters/Ipsos poll, which showed Republican President Donald Trump’s approval steady at 40%.&lt;/p&gt;&lt;p&gt;The six-day poll, which closed on Wednesday, showed 44% of registered voters who called themselves Democrats said they were “very enthusiastic” about voting in the November 3, 2026, elections, compared with 26% of Republicans who said the same. Some 79% of Democrats said they would regret it if they didn’t vote in the election, compared to 68% of Republicans.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/13/donald-trump-jeffrey-epstein-files-us-government-shutdown-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: president faces potentially damaging congressional vote over releasing Epstein files",
      "url": "https://www.theguardian.com/us-news/2025/nov/13/trump-news-at-a-glance-latest-updates",
      "summary": "&lt;p&gt;Attempts to persuade two female members of Congress to withdraw backing for petition appear to have failed – key US politics stories from Thursday 13 November at a glance&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; is facing the prospect of a politically damaging congressional vote on releasing the &lt;a href=\"https://www.theguardian.com/us-news/jeffrey-epstein\"&gt;Jeffrey Epstein&lt;/a&gt; files after attempts to press two female members of Congress to withdraw their backing for it appeared to have failed.&lt;/p&gt;&lt;p&gt;The reported refusal of Lauren Boebert, a Republican representative from Colorado, and Nancy Mace, from South Carolina, to remove their names from a discharge petition to force a vote leaves Trump exposed on an issue that carries the possibility of turning segments of his Maga base against him.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/13/trump-news-at-a-glance-latest-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}