{
  "updatedAt": "2025-09-21T13:04:52.376Z",
  "items": [
    {
      "title": "The W.N.B.A.’s Growing Fan-Base",
      "url": "https://www.nytimes.com/2025/09/21/us/wnba-fans-charlie-kirk-memorial.html",
      "summary": "Boys and men now love women’s basketball, too."
    },
    {
      "title": "For Erika Kirk, a Husband’s Life Cut Short by Violence He Seemed to Foresee",
      "url": "https://www.nytimes.com/2025/09/21/us/politics/erika-kirk.html",
      "summary": "In an interview, the wife of the conservative activist Charlie Kirk said she had implored him to wear a bulletproof vest. But she sees divine work in his death."
    },
    {
      "title": "Charlie Kirk Memorial to Draw an Outpouring From the Right",
      "url": "https://www.nytimes.com/2025/09/21/us/politics/charlie-kirk-memorial-trump-jd-vance.html",
      "summary": "President Trump, JD Vance and other high-profile guests are among the more than 100,000 expected at the service, held at an N.F.L. stadium and an adjoining arena near Phoenix on Sunday."
    },
    {
      "title": "Trump Is Expanding the National Guard’s Role. Some Former Generals Worry.",
      "url": "https://www.nytimes.com/2025/09/21/us/national-guard-crime-washington-cities.html",
      "summary": "Responding to crises at home is part of the Guard’s mission. Helping crack down on crime in U.S. cities isn’t, say some former leaders, who fear this shift could hurt the force."
    },
    {
      "title": "Man Is Charged After Fatal Shooting at New Hampshire Country Club",
      "url": "https://www.nytimes.com/2025/09/20/us/new-hampshire-country-club-shooting.html",
      "summary": "A 23-year-old was charged with murder after a shooting at a country club left one dead and two wounded. The suspect had no known connection to the victim."
    },
    {
      "title": "Trump Administration to Stop Measuring Food Insecurity",
      "url": "https://www.nytimes.com/2025/09/20/us/politics/trump-hunger-report-data.html",
      "summary": "The move strips the government of its main gauge of hunger in America, and will impede efforts to track the impact of aid cuts."
    },
    {
      "title": "Shooting at New Hampshire country club leaves one dead and two wounded",
      "url": "https://www.theguardian.com/us-news/2025/sep/21/nashua-new-hampshire-country-club-shooting",
      "summary": "&lt;p&gt;Witness recounts shooter yelling ‘free Palestine’ while targeting someone as investigators try to determine motive&lt;/p&gt;&lt;p&gt;A man shot one person to death and wounded two others at a &lt;a href=\"https://www.theguardian.com/us-news/new-hampshire\"&gt;New Hampshire&lt;/a&gt; country club as a wedding took place there on Saturday, according to authorities.&lt;/p&gt;&lt;p&gt;A witness to the attack – named as Tom Bartelson of Pepperell, Massachusetts – said his nephew was getting married at the time of the shooting, and he recounted hearing the shooter yell “the children are safe” and “free Palestine” while evidently targeting someone.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/21/nashua-new-hampshire-country-club-shooting\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "States rally to offset fracturing of federal healthcare agencies: ‘Diseases don’t see state lines’",
      "url": "https://www.theguardian.com/us-news/2025/sep/21/states-healthcare-vaccines-recommendations",
      "summary": "&lt;p&gt;Changes to regulatory or information environments will help states decouple from federal health recommendations&lt;/p&gt;&lt;p&gt;Seven US states and the nation’s largest city &lt;a href=\"https://www.mass.gov/news/several-northeastern-states-and-americas-largest-city-announce-the-northeast-public-health-collaborative\"&gt;announced&lt;/a&gt; this week that they have formed the Northeast Public Health Collaborative, in an effort to strengthen the region’s health guidance as the national health landscape fractures.&lt;/p&gt;&lt;p&gt;As national health agencies revisit their recommendations, including high-profile restrictions on the updated Covid shots and the measles, mumps, rubella and varicella (MMRV) vaccine, the pressure is increasingly falling on states to navigate recommendations and new federal rules.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/21/states-healthcare-vaccines-recommendations\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}