{
  "updatedAt": "2025-11-25T06:42:11.934Z",
  "items": [
    {
      "title": "U.S. Army Secretary Travels to U.A.E. for Meetings With Russian Envoys",
      "url": "https://www.nytimes.com/2025/11/25/us/daniel-driscoll-uae-russia-ukraine.html",
      "summary": "The secretary, Daniel Driscoll, was in Geneva over the weekend for talks with a Ukrainian delegation."
    },
    {
      "title": "At a Congressional Hearing, Residents Detail the Trauma of the L.A. Raids",
      "url": "https://www.nytimes.com/2025/11/24/us/ice-raids-congressional-hearing.html",
      "summary": "More than two dozen people described the upheaval the raids had caused in immigrant communities and aired accusations of mistreatment by agents."
    },
    {
      "title": "Batteries for Rad Power Bikes Get Federal Fire Risk Warning",
      "url": "https://www.nytimes.com/2025/11/24/us/cpsc-rad-power-bikes-batteries.html",
      "summary": "A federal watchdog said two models of batteries found in Rad Power Bikes should be immediately, and safely, disposed of. The bike company disputes the safety agency’s findings."
    },
    {
      "title": "How Rubio Tried to Bring a Pro-Russia Peace Plan to Middle Ground",
      "url": "https://www.nytimes.com/2025/11/24/us/politics/trump-russia-ukraine-peace-plan-middle-ground.html",
      "summary": "While President Trump attacked the Ukrainians, Secretary of State Marco Rubio flew to Geneva to seize control of negotiations that were going off the rails."
    },
    {
      "title": "Trump Orders Construction of A.I. Platform to Use Troves of Government Data for Research",
      "url": "https://www.nytimes.com/2025/11/24/us/politics/trump-ai-executive-order.html",
      "summary": "The executive order signed on Monday directs the Department of Energy’s national laboratories to create the A.I. platform in partnership with A.I. companies."
    },
    {
      "title": "What to Know About Trump’s Peace Plan for Russia and Ukraine",
      "url": "https://www.nytimes.com/2025/11/24/us/politics/trump-peace-plan-russia-ukraine.html",
      "summary": "U.S. officials have responded to a storm of criticism about the plan by insisting that it is still a work in progress."
    },
    {
      "title": "Cases against Comey and James tossed, Pentagon investigating US senator and Turning Point USA looks to 2028 – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates",
      "summary": "&lt;p&gt;This live blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/24/trump-administration-briefing-latest-updates-news\"&gt;Trump news at a glance: judge tosses criminal cases against James Comey and Letitia James&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The president was online early today, and fired off a Truth Social post at 5:38am touting the economic impact that his sweeping tariffs will soon have on the country. He also noted that countries’ efforts to stockpile US goods ahead of the levies kicking in was “wearing thin”.&lt;/p&gt;&lt;p&gt;“These payments will be RECORD SETTING, and put our Nation on a new and unprecedented course,” he wrote. “This Tariff POWER will bring America National Security and Wealth the likes of which has never been seen before.”&lt;/p&gt;&lt;p&gt;Those opposing us are serving hostile foreign interests that are not aligned with the success, safety and prosperity of the USA. They couldn’t care less about us. I look so much forward to the United States Supreme Court’s decision on this urgent and time sensitive matter,” he added.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Majority of Latino voters disapprove of Trump, Pew study finds",
      "url": "https://www.theguardian.com/us-news/2025/nov/24/trump-latino-voters-pew",
      "summary": "&lt;p&gt;Research shows 70% disapprove of job US president – who won backing of nearly half of Latino voters in 2024 – is doing&lt;/p&gt;&lt;p&gt;A majority of Latinos disapprove of Donald Trump and his economic and immigration policies, according to &lt;a href=\"https://www.pewresearch.org/race-and-ethnicity/2025/11/24/majorities-of-latinos-disapprove-of-trump-and-his-policies-on-immigration-economy/?_gl=1%2A1k4pmdf%2A_up%2AMQ..%2A_gs%2AMQ..&amp;amp;gclid=Cj0KCQiAoZDJBhC0ARIsAERP-F9FVusKoTUXKNwsxVF7Op3CIaTC4F9gik34xgBC5D8Ni1_jfG2Q98caArkIEALw_wcB&amp;amp;gbraid=0AAAAA_c1WRm0AZFiMW3uClUkzhkA_FxF0\"&gt;a new report&lt;/a&gt; from the Pew Research Center.&lt;/p&gt;&lt;p&gt;After receiving support from nearly half of Latino voters in the 2024 election, Trump had lost the backing of a majority surveyed in October. Pew found that 70% of Latinos “disapprove of the way Trump is handling his job as president”, while 65% disapprove of his administration’s approach to immigration and 61% believe his economic policies have worsened economic conditions.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/24/trump-latino-voters-pew\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}