{
  "updatedAt": "2025-11-28T06:41:06.513Z",
  "items": [
    {
      "title": "Trump Uses National Guard Shooting to Cast Suspicion on Refugees",
      "url": "https://www.nytimes.com/2025/11/27/us/politics/trump-national-guard-shooting.html",
      "summary": "President Trump claimed there were “a lot of problems with Afghans,” without providing evidence, as his administration announced that it was implementing new immigration guidelines."
    },
    {
      "title": "For Shooting Suspect, a Long Path of Conflict From Afghanistan to America",
      "url": "https://www.nytimes.com/2025/11/27/us/guard-shooting-suspect-profile.html",
      "summary": "Rahmanullah Lakanwal was among the Afghans who came to the United States after the Taliban takeover of Afghanistan. Earlier, he served in a paramilitary unit that worked with U.S. forces."
    },
    {
      "title": "Recent Afghan Arrivals Fear Their Futures in the U.S. Are Now in Jeopardy",
      "url": "https://www.nytimes.com/2025/11/27/us/politics/afghans-immigrants-fearful-guard-shooting.html",
      "summary": "Many are anxious after the Trump administration vowed to undertake sweeping reviews of immigrants after the shooting of two National Guard troops."
    },
    {
      "title": "SNAP Helping Families Put Thanksgiving Dinner on the Table",
      "url": "https://www.nytimes.com/2025/11/27/us/politics/snap-benefits-trump-thanksgiving.html",
      "summary": "SNAP benefits helped Leanna Nieves of Haverhill, Mass., buy Thanksgiving dinner for her family, but she used the day to set aside what have been chronic worries about the federal program."
    },
    {
      "title": "D.C. Shooting: What We Know About the National Guard Victims",
      "url": "https://www.nytimes.com/2025/11/27/us/national-guard-shooting-andrew-wolfe-sarah-beckstrom.html",
      "summary": "The family of one of the West Virginia National Guard members was at her side before she died on Thursday. A man at the other member’s home asked for prayers for his son."
    },
    {
      "title": "U.S. Reviews Biden Asylum Cases After Shooting",
      "url": "https://www.nytimes.com/2025/11/27/us/politics/biden-asylum-cases-shooting.html",
      "summary": "A Homeland Security Department spokeswoman accused the previous administration of failing to vet asylum applicants “on a massive scale.”"
    },
    {
      "title": "Trump says he will ‘permanently pause’ migration from ‘third world countries’ after national guard shooting",
      "url": "https://www.theguardian.com/us-news/2025/nov/28/trump-says-he-will-permanently-pause-migration-from-third-world-countries-after-national-guard-shooting",
      "summary": "&lt;p&gt;In a social media post sent late on Thanksgiving, US president said he would ‘end all federal benefits and subsidies to noncitizens’ following Washington DC shooting&lt;/p&gt;&lt;p&gt;Donald Trump has said he will “permanently pause migration from all third world countries,” a day after &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/28/national-guard-member-sarah-beckstrom-has-died-after-shooting-in-washington-dc-trump-announces\"&gt;two national guard members were shot&lt;/a&gt; in Washington DC in an attack that has become a political flashpoint in the president’s ongoing crackdown on immigration.&lt;/p&gt;&lt;p&gt;In a social media post beginning with “a very happy Thanksgiving,” sent after 11pm on Thursday, the US president said his administration would “end all federal benefits and subsidies to noncitizens” and remove “anyone who is not a net asset to the United States”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/28/trump-says-he-will-permanently-pause-migration-from-third-world-countries-after-national-guard-shooting\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: FBI expands Washington shooting investigation as president says one victim has died",
      "url": "https://www.theguardian.com/us-news/2025/nov/28/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;Trump announced the death of national guard member Sarah Beckstrom, as his administration pledged to re-examine entry of Afghan refugees. Key US politics stories from Thursday at a glance&lt;/p&gt;&lt;p&gt;The FBI searched multiple properties on Thursday as it widened its investigation into a shooting in Washington on Wednesday, that has left one national guard member dead and another in a critical condition.&lt;/p&gt;&lt;p&gt;The search including a home in Washington state linked to the suspect, Afghan national Rahmanullah Lakanwal, who officials said was part of a CIA-backed unit in Afghanistan before coming to the US in 2021 under a resettlement program.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/28/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}