{
  "updatedAt": "2025-11-05T06:41:52.363Z",
  "items": [
    {
      "title": "Californian wait in long lines to vote on Prop. 50",
      "url": "https://www.nytimes.com/live/2025/11/04/us/election-new-jersey-california/california-voters-long-lines-prop-50",
      "summary": ""
    },
    {
      "title": "Abigail Spanberger Flips Virginia, Becomes State’s First Female Governor",
      "url": "https://www.nytimes.com/2025/11/05/us/abigail-spanberger-virginia-governor-election.html",
      "summary": "In her campaign, Abigail Spanberger focused on jobs and the cost of living. and emphasized her support for abortion rights."
    },
    {
      "title": "6 Takeaways From Democrat Mikie Sherrill’s Victory in New Jersey",
      "url": "https://www.nytimes.com/2025/11/05/us/politics/nj-governor-takeaways.html",
      "summary": "Representative Mikie Sherrill, who was elected governor, made her opposition to President Trump the centerpiece of her campaign. He gave her a political gift by “terminating” the Gateway tunnel project."
    },
    {
      "title": "6 Takeaways From Elections in Virginia, New Jersey, New York and Beyond",
      "url": "https://www.nytimes.com/2025/11/05/us/politics/election-takeaways-democrats.html",
      "summary": "In Virginia, New Jersey and beyond, Democratic voters powered their candidates to victory and sent a warning sign to President Trump and his Republican Party."
    },
    {
      "title": "New York Muslims Exult in Mamdani’s Victory: ‘Now This Is Our Time’",
      "url": "https://www.nytimes.com/2025/11/05/us/muslim-new-yorkers-mamdani.html",
      "summary": "Zohran Mamdani’s victory as the city’s next mayor is a milestone for hundreds of thousands of residents who see one of their own atop the city’s political infrastructure."
    },
    {
      "title": "How the California Prop. 50 Redistricting Plan Will Affect 2026 Elections",
      "url": "https://www.nytimes.com/2025/11/05/us/politics/california-prop-50-map-redistricting-democrats.html",
      "summary": "Five districts held by Republicans become potential Democratic pickups, but some remain highly competitive. And a number of incumbent lawmakers have easier pathways to re-election."
    },
    {
      "title": "Prop 50: Californians pass redistricting measure that helps Democrats flip up to five House seats",
      "url": "https://www.theguardian.com/us-news/2025/nov/04/california-prop-50-voting-result",
      "summary": "&lt;p&gt;Approval of measure could determine if Republicans keep full control of government in next year’s midterm elections&lt;/p&gt;&lt;p&gt;Voters in &lt;a href=\"https://www.theguardian.com/us-news/california\"&gt;California&lt;/a&gt; on Tuesday approved a high-stakes redistricting measure, a national triumph for Democrats hoping to stop &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; and &lt;a href=\"https://www.theguardian.com/us-news/republicans\"&gt;Republicans&lt;/a&gt; from retaining full control of the federal government in next year’s midterm elections.&lt;/p&gt;&lt;p&gt;It was a decisive victory for Democrats in deep-blue California, who had raced to counter a gerrymander in Texas, &lt;a href=\"https://www.theguardian.com/us-news/2025/aug/20/texas-house-redistricting-bill-floor\"&gt;engineered at the US president’s behest&lt;/a&gt;, to carve out new safe Republican districts. The Associated Press declared Proposition 50 had passed almost instantly when polls closed statewide.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/04/california-prop-50-voting-result\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "‘Time for a new era’: hope swells in New York as Zohran Mamdani makes history",
      "url": "https://www.theguardian.com/us-news/2025/nov/05/zohran-mamdani-election-night-party",
      "summary": "&lt;p&gt;Supporters and high-profile New York Democrats gathered in Brooklyn to celebrate New York’s first Muslim mayor&lt;/p&gt;&lt;p&gt;At &lt;a href=\"https://www.theguardian.com/us-news/zohran-mamdani\"&gt;Zohran Mamdani&lt;/a&gt;’s election night party in downtown Brooklyn on Tuesday night, hundreds of his supporters erupted in cheers and applause as the democratic socialist from Queens was elected the next mayor of New York City.&lt;/p&gt;&lt;p&gt;“I’m ecstatic!” “This is life-changing!” “I’m lost for words!” were just some of the refrains from the crowd as they celebrated history in the making: New York has its first Muslim mayor.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/05/zohran-mamdani-election-night-party\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}