{
  "updatedAt": "2025-12-04T06:42:04.169Z",
  "items": [
    {
      "title": "Trump Pardons Developer Prosecuted by His Administration",
      "url": "https://www.nytimes.com/2025/12/03/us/politics/trump-pardon-leiweke.html",
      "summary": "This summer, Trump administration officials had lauded the indictment of Timothy J. Leiweke as an effort to root out corruption and unfair business practices."
    },
    {
      "title": "Armed Volunteer Charged in Fatal Shooting at Utah ‘No Kings’ Protest",
      "url": "https://www.nytimes.com/2025/12/03/us/no-kings-protest-shooting-salt-lake-city-charges.html",
      "summary": "The volunteer is facing one count of manslaughter after he tried to confront a man who was carrying an AR-15 style rifle at the Salt Lake City event in June."
    },
    {
      "title": "Trump Renames Institute of Peace for Himself",
      "url": "https://www.nytimes.com/2025/12/03/us/politics/trump-us-institute-peace-name.html",
      "summary": "Workers installed the president’s name on the Washington institute, thrusting it back into the spotlight as it is set to host the signing of a peace deal between Rwanda and Congo."
    },
    {
      "title": "Trump’s Former Campaign Manager Assisted Honduran Presidential Candidate",
      "url": "https://www.nytimes.com/2025/12/03/us/politics/brad-parscale-trump-honduras-asfura-pardon.html",
      "summary": "Brad Parscale advised the campaign of Nasry Asfura, a right-wing candidate who was endorsed by the U.S. president."
    },
    {
      "title": "Trump Faces Choices on Russia-Ukraine Talks as Peace Deal Deadline Passes",
      "url": "https://www.nytimes.com/2025/12/03/us/politics/trump-russia-ukraine-deadline.html",
      "summary": "The president wanted Moscow and Kyiv to come to terms by Thanksgiving. Negotiations are now stalled, leaving the White House to decide if an agreement is possible anytime soon."
    },
    {
      "title": "Gunman Killed and 3 Officers Hurt in Shooting at Omaha Gas Station",
      "url": "https://www.nytimes.com/2025/12/03/us/quiktrip-shooting-omaha-nebraska.html",
      "summary": "Police say the man, whose identity has yet to be released, shot another man at a grocery store across town in what appeared to be a random attack."
    },
    {
      "title": "Detainees at ‘Alligator Alcatraz’ facing ‘harrowing human right violations’, new report alleges",
      "url": "https://www.theguardian.com/us-news/2025/dec/04/alligator-alcatraz-human-right-violations-amnesty-report",
      "summary": "&lt;p&gt;Amnesty International finds immigrants at Florida facility were shackled and left outside in metal cage for up to a day&lt;/p&gt;&lt;p&gt;Detainees at the notorious Florida immigration jail known as “Alligator Alcatraz” were shackled inside a 2ft high metal cage and left outside without water for up to a day at a time, a shocking report &lt;a href=\"https://www.amnestyusa.org/alligator-alcatraz-krome\"&gt;published Thursday&lt;/a&gt; by Amnesty International alleges.&lt;/p&gt;&lt;p&gt;The human rights group said migrants held at the state-run Everglades facility, and at Miami’s Krome immigration processing center operated by a private company on behalf of the Trump administration, continue to be exposed to “cruel, inhuman and degrading treatment” rising in some cases to torture.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/04/alligator-alcatraz-human-right-violations-amnesty-report\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "New England warming faster than most places on Earth, study finds",
      "url": "https://www.theguardian.com/us-news/2025/dec/03/new-england-warming",
      "summary": "&lt;p&gt;Pace of area’s temperature rise, outpaced in US only by Alaskan Arctic, apparently increased in past five years&lt;/p&gt;&lt;p&gt;The US region called New England is widely known for its colonial history, maple syrup and frigid, snow-bound winters. Many of these norms are in the process of being upended, however, by a rapidly altering climate, with new research finding the area is heating up faster than almost anywhere else on Earth.&lt;/p&gt;&lt;p&gt;The breakneck speed of New England’s transformation makes it the fastest-heating area of the US, bar the Alaskan &lt;a href=\"https://www.theguardian.com/environment/2022/jun/15/new-data-reveals-extraordinary-global-heating-in-the-arctic\"&gt;Arctic&lt;/a&gt;, and the pace of its temperature rise has apparently increased in the past five years, according to the study.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/03/new-england-warming\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}