{
  "updatedAt": "2025-09-10T18:48:46.552Z",
  "items": [
    {
      "title": "Trump’s Economic Agenda Hinges on the Supreme Court’s Tariff Ruling",
      "url": "https://www.nytimes.com/2025/09/10/us/politics/trump-tariffs-supreme-court.html",
      "summary": "For the president, the power to issue limitless tariffs is at the heart of his second-term vision, from trade to foreign policy."
    },
    {
      "title": "Firefighters Condemn ‘Greed’ as Fire Engine Prices Soar",
      "url": "https://www.nytimes.com/2025/09/10/us/fire-trucks-manufacturers-costs-congress.html",
      "summary": "A bipartisan group in Congress has increased scrutiny of the fire engine industry. Firefighters complain that escalating prices and yearslong delays are straining public safety resources."
    },
    {
      "title": "Harvard Is Told Research Money Could Flow Again, for Now",
      "url": "https://www.nytimes.com/2025/09/10/us/harvard-research-funding-trump.html",
      "summary": "After a court victory, Harvard researchers were told some grants were being restored. But the battle over whether the government can halt the money is probably not over."
    },
    {
      "title": "Trump Administration to Appeal Ruling That Allows Lisa Cook to Remain at Fed",
      "url": "https://www.nytimes.com/2025/09/10/us/politics/trump-lisa-cook-fed-governor-appeal.html",
      "summary": "The administration contested a preliminary injunction, issued late Tuesday, that temporarily blocked President Trump from firing her."
    },
    {
      "title": "Trump White House Exerts Enormous Influence Over FBI, Lawsuit Says",
      "url": "https://www.nytimes.com/2025/09/10/us/politics/trump-fbi-lawsuit.html",
      "summary": "A sprawling suit by three fired F.B.I. officials provides a disturbing account of efforts by top Trump aides to strip the bureau of its independence."
    },
    {
      "title": "Texas Professor Fired After Accusations of Teaching ‘Gender Ideology’",
      "url": "https://www.nytimes.com/2025/09/10/us/texas-professor-fired-gender-ideology.html",
      "summary": "Two administrators also lost their posts at Texas A&amp;M, an example of how Republican policies meant to curb liberal ideas are reaching into university classrooms."
    },
    {
      "title": "Kamala Harris calls Joe Biden’s choice to run for 2024 re-election ‘reckless’ in new book – live updates",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Former VP criticizes Biden in new book excerpt about his decision to run for re-election: ‘This wasn’t a choice that should have been left to an individual’s ego’&lt;/p&gt;&lt;p&gt;&lt;strong&gt;A jump in greenhouse gas &lt;a href=\"https://www.theguardian.com/environment/pollution\"&gt;pollution&lt;/a&gt; in the US helped push global &lt;a href=\"https://www.theguardian.com/environment/carbon-emissions\"&gt;emissions&lt;/a&gt; higher in the first half of this year. This could be an omen of what’s to come, with &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt;’s pro-fossil fuel agenda set to significantly slow down the emissions cuts required to avoid disastrous climate impacts, a new forecast has found.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The “most abrupt shift in energy and climate policy in recent memory” that has occurred since Trump re-entered the White House will have profound consequences for the global &lt;a href=\"https://www.theguardian.com/environment/climate-crisis\"&gt;climate crisis&lt;/a&gt; by slowing the pace of US emissions cuts by as much as half the rate achieved over the past two decades, &lt;a href=\"https://rhg.com/research/taking-stock-2025/\"&gt;the Rhodium Group forecast states&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Ex-FBI officials sue Kash Patel over claims they were fired for investigating Trump",
      "url": "https://www.theguardian.com/us-news/2025/sep/10/fbi-kash-patel-lawsuit",
      "summary": "&lt;p&gt;Officials claim FBI director said he had been instructed by White House to fire any agent who worked on an investigation of Trump&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates\"&gt;US politics live – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Three former senior FBI &lt;a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.284697/gov.uscourts.dcd.284697.1.0_1.pdf\"&gt;officials sued&lt;/a&gt; its director, Kash Patel, and the federal government on Wednesday for wrongful termination, saying there had been widespread unlawful political influence at the bureau.&lt;/p&gt;&lt;p&gt;The three officials, Brian Driscoll Jr, Steven Jensen and Spencer Evans, filed the lawsuit in federal court in Washington DC, asking a judge to declare their firings were illegal, reinstate them, and award them backpay.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/10/fbi-kash-patel-lawsuit\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}