{
  "updatedAt": "2025-09-19T13:34:19.425Z",
  "items": [
    {
      "title": "Charlie Kirk’s Base Was Young People. Now His Tent Might Be Expanding.",
      "url": "https://www.nytimes.com/2025/09/19/us/charlie-kirk-turning-point-usa.html",
      "summary": "Since his death, the parents and grandparents of his original followers are discovering his work. They like what they see."
    },
    {
      "title": "What Jimmy Kimmel’s Suspension Says About Free Speech",
      "url": "https://www.nytimes.com/2025/09/19/us/jimmy-kimmel-free-speech.html",
      "summary": "President Trump’s allies now argue that the freedom of speech doesn’t let you say anything you want."
    },
    {
      "title": "Plane Crashes in North Carolina With 3 on Board",
      "url": "https://www.nytimes.com/2025/09/19/us/plane-crash-north-carolina-brett-james.html",
      "summary": "The plane crashed into a field in the town of Franklin, in the western part of the state, officials said."
    },
    {
      "title": "Democrats Seek to Limit Trump’s War Powers After Venezuela Boat Strikes",
      "url": "https://www.nytimes.com/2025/09/19/us/politics/trump-military-powers-democrats-venezuela.html",
      "summary": "Lawmakers have said that President Trump has not provided sufficient evidence about the threat posed by the vessels or the legal basis to use force against them."
    },
    {
      "title": "Soros Gives $10 Million to Newsom Redistricting Fight",
      "url": "https://www.nytimes.com/2025/09/19/us/politics/gavin-newsom-redistricting-california-fundraising.html",
      "summary": "The sum makes the Soros family the single largest funder so far in favor of the California effort to counter President Trump."
    },
    {
      "title": "What Charlie Kirk Could Mean for the Future of Marriage and Family",
      "url": "https://www.nytimes.com/2025/09/19/us/politics/charlie-kirk-erika-family-marriage-children.html",
      "summary": "Erika Kirk said her husband aspired to “revive the American family.” Conservative activists wonder if Charlie Kirk’s legacy will lend new urgency to White House policy discussions."
    },
    {
      "title": "Congress prepares to vote on short-term funding bill to avert US government shutdown – live updates",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news",
      "summary": "&lt;p&gt;Republican bill would fund government until 21 November; House GOP leadership is confident they have enough support for it to pass as Democrats plan to vote against it&lt;/p&gt;&lt;p&gt;Today, lawmakers in the House will vote on legislation, known as a “continuing resolution” (CR), to prevent a looming government shutdown at the end of September.&lt;/p&gt;&lt;p&gt;The bill, introduced by Republicans, would fund the government until 21 November. According to Politico, House GOP whip &lt;strong&gt;Tom Emmer&lt;/strong&gt; was confident, as of Thursday, that his party had enough votes. “We’re going to pass this,” he said in an interview.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "How Trump has turned the legal system ‘on its head’ to meet deportation goals",
      "url": "https://www.theguardian.com/us-news/ng-interactive/2025/sep/19/trump-immigration-cuba-asylum-seeker",
      "summary": "&lt;p&gt;Cuban asylum seeker EC and others saw hard-won victories vanish as new rules upended immigration courts&lt;/p&gt;&lt;p&gt;The Cuban asylum seeker referred to in court papers as EC could not believe his luck, and neither could his lawyers.&lt;/p&gt;&lt;p&gt;They’d come to &lt;a href=\"https://www.theguardian.com/us-news/usimmigration\"&gt;immigration&lt;/a&gt; court in &lt;a href=\"https://www.theguardian.com/us-news/miami\"&gt;Miami&lt;/a&gt; in late spring expecting only incremental progress in a case that had been grinding away for more than three years. Yet here was the Department of Homeland Security (DHS) lawyer telling the judge the government was dropping its deportation demands. It seemed EC had won, eligible at last for a green card and permanent residency in the United States.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/sep/19/trump-immigration-cuba-asylum-seeker\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}