{
  "updatedAt": "2025-11-02T12:48:45.785Z",
  "items": [
    {
      "title": "For SNAP Recipients, Anxiety Over Funding Leads to Hard Choices",
      "url": "https://www.nytimes.com/2025/11/02/us/im-going-to-stretch-it-anxiety-over-snap-leads-to-hard-choices.html",
      "summary": "At one grocery store in Massachusetts, SNAP recipients faced growing fears, dwindling funds and lighter shopping carts."
    },
    {
      "title": "Austin Asked Voters to Raise Taxes for the Homeless. It’s Not Going Well.",
      "url": "https://www.nytimes.com/2025/11/02/us/austin-tax-vote.html",
      "summary": "A proposed tax hike before the city on Tuesday has become a referendum on governance in the fast-changing Texas capital."
    },
    {
      "title": "Food Stamp Cuts Expose Trump’s Strategy to Use Shutdown to Advance Agenda",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/trump-strategy-food-stamps.html",
      "summary": "The president has stretched the limits of his powers to help those at the heart of his agenda, not the many in greatest need."
    },
    {
      "title": "Anger Over ICE Raids Is Driving Some Latino Voters to the Polls",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/elections-latino-turnout-ice-raids.html",
      "summary": "Democrats are concerned that the immigration crackdown will hurt Latino turnout on Tuesday. Republicans dispute that the raids will play any role in the election."
    },
    {
      "title": "Democrats Running for Governor Stick to a Familiar Theme: Fight Trump",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/virginia-new-jersey-democrats.html",
      "summary": "While other Democrats have tried to address their party’s failings with new strategies, Abigail Spanberger in Virginia and Mikie Sherrill in New Jersey are hoping to once again tap into anger at the president."
    },
    {
      "title": "Trump’s Retribution Campaign Leaves D.C. Prosecutor’s Office in Crisis",
      "url": "https://www.nytimes.com/2025/11/02/us/politics/trump-pirro-washington-prosecutors.html",
      "summary": "Few places have felt the effects as palpably as the U.S. attorney’s office in Washington, which is deeply enmeshed in the workings of government and has filed criminal cases against President Trump."
    },
    {
      "title": "The president who cried tariffs: will the US supreme court challenge Trump’s trade war?",
      "url": "https://www.theguardian.com/us-news/2025/nov/02/trump-tariffs-supreme-court",
      "summary": "&lt;p&gt;The US high court will hear arguments on whether Trump’s erratic imposition of global tariffs is legally valid&lt;/p&gt;&lt;p&gt;Donald Trump thrives on emergencies. He cried havoc on the very first day of his second term, declaring a national emergency caused by an “invasion” of “&lt;a href=\"https://www.whitehouse.gov/presidential-actions/2025/01/declaring-a-national-emergency-at-the-southern-border-of-the-united-states/\"&gt;illegal aliens&lt;/a&gt;” from Mexico. He has since invoked emergencies more than any president since the passage of the National Emergencies Act in 1976.&lt;/p&gt;&lt;p&gt;Next Wednesday, he faces another of his own making, as the US supreme court hears oral arguments on whether his globe-shaking signature economic policy – tariffs – is legally valid.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/02/trump-tariffs-supreme-court\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "America’s redistricting fight: how could the US congressional map shift?",
      "url": "https://www.theguardian.com/us-news/ng-interactive/2025/nov/02/us-redistrcting-congressional-map",
      "summary": "&lt;p&gt;Republicans hold a 219-213 majority in the House, but they could lock in more seats if reapportionments go their way&lt;/p&gt;&lt;p&gt;Republicans and Democrats have entered a war in legislatures and courts to narrow the political battlefield of 2026 before a single vote is cast.&lt;/p&gt;&lt;p&gt;Normally, redistricting only occurs after the US census counts residents in each state every 10 years. A demand from Donald Trump to lock in more Republican-leaning districts in Congress, together with a changing legal landscape around partisan gerrymandering, set off a chain of mid-decade reapportionments.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/nov/02/us-redistrcting-congressional-map\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}