{
  "updatedAt": "2025-10-23T18:37:36.395Z",
  "items": [
    {
      "title": "Trump Calls Off Federal Operation in San Francisco",
      "url": "https://www.nytimes.com/2025/10/23/us/san-francisco-trump-federal-deployment.html",
      "summary": "President Trump said he had called off a planned federal deployment of immigration agents to the city. It was not clear what that meant for the rest of the Bay Area."
    },
    {
      "title": "Democrats Block Federal Worker Pay Bill as Shutdown Drags On",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/democrats-shutdown-federal-employee-pay.html",
      "summary": "A Republican measure that would pay essential government employees faltered in the Senate, and the G.O.P. blocked a pair of Democratic bills to pay a broader swath of workers."
    },
    {
      "title": "Trump Supporters Are Uneasy About Military Actions Against Venezuela",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/trump-supporters-venezuela.html",
      "summary": "Some conservative policy advisers and commentators, including Laura Loomer and Stephen K. Bannon, are raising questions about the administration’s policy in the region."
    },
    {
      "title": "Bay Area Protesters Try to Block Base Entrance Before Immigration Operation",
      "url": "https://www.nytimes.com/2025/10/23/us/san-francisco-bay-area-protesters.html",
      "summary": "About 200 people stood in an intersection outside the Coast Guard base in Alameda, Calif., where federal agents were said to be arriving to prepare for an immigration enforcement operation."
    },
    {
      "title": "Virginia Democrats Plan to Redraw House Maps in Redistricting Push",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/virginia-democrats-redistrict.html",
      "summary": "The surprise move could give Democrats two or three additional House seats and is likely to scramble the last couple weeks of campaigning ahead of the Nov. 4 election."
    },
    {
      "title": "4 Members of Illinois Politician Darren Bailey’s Family Are Killed in Helicopter Crash",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/darren-bailey-family-helicopter-crash-montana.html",
      "summary": "Darren Bailey, a Republican candidate for governor, lost his son, daughter-in-law and two grandchildren, ages 12 and 7, in a helicopter accident in Montana, his campaign said."
    },
    {
      "title": "Trump cancels plans to send federal troops to San Francisco for immigration crackdown",
      "url": "https://www.theguardian.com/us-news/2025/oct/23/san-francisco-federal-immigration-operation",
      "summary": "&lt;p&gt;Trump confirmed he spoke with mayor Daniel Lurie about calling off deployment and would ‘give him a chance’ &lt;/p&gt;&lt;p&gt;Donald Trump cancelled plans for a deployment of federal troop to the San Francisco Bay Area that had sparked widespread condemnation from California leaders and sent protesters flooding into the streets.&lt;/p&gt;&lt;p&gt;The region had been on edge &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/22/trump-federal-agents-san-francisco\"&gt;after reports emerged&lt;/a&gt; on Wednesday that the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; was poised to send more than 100 Customs and Border Protection (CBP) and other federal agents to the US Coast Guard base in Alameda, across the Bay from San Francisco, as part of a large-scale immigration enforcement plan.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/23/san-francisco-federal-immigration-operation\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Senate fails to pass bill to keep essential federal workers and troops paid throughout government shutdown – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates",
      "summary": "&lt;p&gt;Three Democratic senators – John Fetterman, Raphael Warnock and Jon Ossoff – broke ranks with their party and voted in favor of the Republican bill&lt;/p&gt;&lt;p&gt;&lt;strong&gt;More than half of Americans, including about three in 10 Republicans, believe president Donald Trump is using federal law enforcement to go after his enemies, according to a new Reuters/Ipsos poll that also found growing concern about US political divisions nine months into his second term in office.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Some 55% of poll respondents in the six-day poll, which closed on Monday, agreed with a statement that the Republican president is using law enforcement to target his enemies, while 26% disagreed and the rest were unsure or did not respond.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}