{
  "updatedAt": "2025-11-23T18:35:40.134Z",
  "items": [
    {
      "title": "Trump Calls Ukraine Ungrateful, Again, for U.S. Support in War With Russia",
      "url": "https://www.nytimes.com/2025/11/23/us/politics/trump-ukraine-criticism-russia.html",
      "summary": "President Trump renewed his criticism of Ukraine’s government as emissaries from Kyiv and Washington met to discuss a plan to end the war."
    },
    {
      "title": "As Trump’s Inquisitors Face Scrutiny, a Divisive Figure Could Play a New Role",
      "url": "https://www.nytimes.com/2025/11/23/us/politics/trump-florida-cannon-grand-jury.html",
      "summary": "The prosecutor running an inquiry into those who investigated President Trump has established a grand jury under Judge Aileen M. Cannon, whose scuttling of the documents case made her a White House favorite."
    },
    {
      "title": "Rubio Insists U.S. Authored the Ukraine Peace Plan",
      "url": "https://www.nytimes.com/2025/11/23/us/politics/rubio-us-author-ukraine-peace-plan.html",
      "summary": "The comment from Secretary of State Marco Rubio came after a group of U.S. lawmakers claimed that he said the plan was a Russian initiative, not a U.S. proposal."
    },
    {
      "title": "At Harvard-Yale Game, Rivals Come Together Against Trump Administration Attacks",
      "url": "https://www.nytimes.com/2025/11/23/us/politics/yale-harvard-football-trump.html",
      "summary": "Students and alumni set aside rivalries at the 141st Harvard-Yale football game on Saturday to summon support against attacks on higher education under the Trump administration."
    },
    {
      "title": "Fact-Checking Trump’s Latest Claims on Affordability",
      "url": "https://www.nytimes.com/2025/11/23/us/politics/fact-check-trump-affordability.html",
      "summary": "The president has made misleading statements about the cost of a Thanksgiving meal, breakfast and gasoline and about prices in general."
    },
    {
      "title": "F.B.I. Letters Send Shivers Through California’s Political Inner Circle",
      "url": "https://www.nytimes.com/2025/11/23/us/california-fbi-state-capitol-corruption.html",
      "summary": "The indictment of Gov. Gavin Newsom’s former chief of staff shocked many power players in California. Now, some wonder how far the investigation will spread."
    },
    {
      "title": "Many prominent Maga personalities on X are based outside US, new tool reveals",
      "url": "https://www.theguardian.com/us-news/2025/nov/23/rightwing-influencers-outside-us-x-twitter-tool",
      "summary": "&lt;p&gt;Users posing as rightwing Americans are operating internationally, per the platform’s transparency feature&lt;/p&gt;&lt;p&gt;Many of the most influential personalities in the “Make America great again” (Maga) movement on &lt;a href=\"https://www.theguardian.com/technology/twitter\"&gt;X&lt;/a&gt; are based outside of the US, including Russia, Nigeria and India, a new transparency feature on the social media site has revealed.&lt;/p&gt;&lt;p&gt;The new tool, called “about this account,” became available on Friday to users of the &lt;a href=\"https://www.theguardian.com/technology/elon-musk\"&gt;Elon Musk&lt;/a&gt;-owned platform. It allows anyone to see where an account is located, when it joined the platform, how often its username has been changed, and how the X app was downloaded.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/23/rightwing-influencers-outside-us-x-twitter-tool\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "‘That doesn’t exist’: Doge reportedly quietly disbanded ahead of schedule",
      "url": "https://www.theguardian.com/us-news/2025/nov/23/trump-musk-doge-reportedly-disbanded",
      "summary": "&lt;p&gt;Statement by Trump administration confirms longstanding suspicions that Musk-led agency is on its way out&lt;/p&gt;&lt;p&gt;The “department of government efficiency” (Doge) has apparently been dissolved with eight months still remaining on its contract, ending a drawn-out campaign of invading federal agencies and firing thousands of federal workers.&lt;/p&gt;&lt;p&gt;“That doesn’t exist,” office of personnel management (OPM) director Scott Kupor told &lt;a href=\"https://www.reuters.com/world/us/doge-doesnt-exist-with-eight-months-left-its-charter-2025-11-23/https://www.reuters.com/world/us/doge-doesnt-exist-with-eight-months-left-its-charter-2025-11-23/\"&gt;Reuters&lt;/a&gt; earlier this month when asked about Doge’s status, adding that it was no longer a “centralized entity”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/23/trump-musk-doge-reportedly-disbanded\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}