{
  "updatedAt": "2025-09-19T06:50:31.793Z",
  "items": [
    {
      "title": "Trump Pressures Broadcasters Over Critical Coverage, Escalating Attack on Speech",
      "url": "https://www.nytimes.com/2025/09/18/us/politics/trump-fcc-licenses.html",
      "summary": "The president’s suggestion that broadcasters should lose their licenses because of criticism of him indicated that his assault on critics’ language is driven in part by personal animus."
    },
    {
      "title": "Texas A&amp;M President to Step Down After Controversy Over ‘Gender Ideology’",
      "url": "https://www.nytimes.com/2025/09/18/us/texas-am-president-gender-ideology-controversy.html",
      "summary": "The university had been roiled after a student filmed herself arguing with the instructor of a children’s literature course that recognized more than two genders."
    },
    {
      "title": "Helicopter Carrying 4 Soldiers Crashes in Washington State",
      "url": "https://www.nytimes.com/2025/09/18/us/military-helicopter-crash-washington.html",
      "summary": "Rescue efforts have been hampered by fire, and officials did not release information on the conditions of those aboard."
    },
    {
      "title": "Trump Has Threatened Broadcast Licenses. Here’s How They Work.",
      "url": "https://www.nytimes.com/2025/09/18/us/politics/trump-broadcast-licenses-fcc.html",
      "summary": "The Federal Communications Commission gives out licenses to TV stations to broadcast over radio frequencies and approves major telecom and media deals."
    },
    {
      "title": "The F.J. King, a Ship Lost in 1886, Is Found in Lake Michigan",
      "url": "https://www.nytimes.com/2025/09/18/us/ghost-ship-wreckage-lake-michigan.html",
      "summary": "Long rumored to be on the floor of the lake but never seen, the schooner had eluded divers and taunted storytellers for generations. It was miles off the Door Peninsula in Wisconsin."
    },
    {
      "title": "Texas Man Dies in Fall From Alaska Mountain Trail",
      "url": "https://www.nytimes.com/2025/09/18/us/alaska-hikers-dead-juneau.html",
      "summary": "Britain Pool, 32, died after falling from a steep mountain trail above Juneau, the authorities said. He and a companion, who survived the fall, were cruise ship passengers."
    },
    {
      "title": "Late night hosts condemn Trump administration – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
      "summary": "&lt;p&gt;&lt;strong&gt;This live blog is closed&lt;/strong&gt;, you can read our coverage of Jimmy Kimmel’s suspension &lt;a href=\"https://www.theguardian.com/tv-and-radio/jimmy-kimmel\"&gt;here&lt;/a&gt;, or via the links below&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/18/late-night-show-host-kimmel-cancel-colbert-letterman\"&gt;Late-night show hosts decry suspension of Kimmel’s show&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/18/jimmy-kimmel-show-trump\"&gt;Trump suggests punishing TV networks for ‘negative’ coverage&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/brendan-carr-fcc-jimmy-kimmel\"&gt;Profile: The Trump-backed FCC chair at heart of Jimmy Kimmel storm&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;In reaction to the news that &lt;strong&gt;Jimmy Kimmel’&lt;/strong&gt;s late-night show has been indefinitely suspended, the &lt;strong&gt;American Federation of Musicians (AFM)&lt;/strong&gt; said that “Trump’s FCC identified speech it did not like and threatened ABC with extreme reprisals. This is state censorship.”&lt;/p&gt;&lt;p&gt;On X, the president of the American Federation of Musicians of the United States and Canada, &lt;strong&gt;Tino Gagliardi&lt;/strong&gt;, issued a statement in response to &lt;strong&gt;ABC&lt;/strong&gt; taking &lt;strong&gt;Jimmy Kimmel Live!&lt;/strong&gt;, which employs musicians from the &lt;strong&gt;American Federation of Musicians Local 47&lt;/strong&gt; in &lt;strong&gt;Los Angeles&lt;/strong&gt;, off the air. In it he said:&lt;/p&gt;&lt;p&gt;This is not complicated: Trump’s FCC identified speech it did not like and theatened ABC with extreme reprisals. This is state censorship. It’s now happening in the United States of America, not some far-off country."
    },
    {
      "title": "Hundreds protest outside Disney HQ over ‘un-American’ Kimmel suspension",
      "url": "https://www.theguardian.com/us-news/2025/sep/18/jimmy-kimmel-protest-disney-abc-burbank",
      "summary": "&lt;p&gt;Demonstrators condemn CEO Bob Iger and fellow executives for ‘bending the knee’ to Trump administration&lt;/p&gt;&lt;p&gt;The Mickey Mouse logo is all over Walt Disney’s headquarters in Burbank, California. But on Thursday, those famous ears were also on display outside the studio on protest signs, including one labeling Disney executives as “cowards” for suspending Jimmy Kimmel’s late-night talkshow in response to pressure from the Trump administration.&lt;/p&gt;&lt;p&gt;Disney, which owns ABC, “indefinitely” suspended Kimmel’s show on Wednesday night, following threatening remarks by Trump’s Federal Communications Commission chair Brendan Carr about &lt;a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-live-suspended-indefinitely-after-hosts-charlie-kirk-comments\"&gt;possible regulatory consequences&lt;/a&gt; for comments Kimmel made about Trump and the Maga movement’s &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/18/what-did-jimmy-kimmel-say-said-comments-about-charlie-kirk\"&gt;response to Charlie Kirk’s killing&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/18/jimmy-kimmel-protest-disney-abc-burbank\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}