{
  "updatedAt": "2025-10-13T12:54:44.433Z",
  "items": [
    {
      "title": "Originalist ‘Bombshell’ Complicates Case on Trump’s Power to Fire Officials",
      "url": "https://www.nytimes.com/2025/10/13/us/politics/originalism-trump-supreme-court-unitary-executive.html",
      "summary": "As the Supreme Court seems poised to expand the president’s power, a leading scholar whose work the justices have often cited issued a provocative dissent."
    },
    {
      "title": "Fragments of 2003 Cable Detail Torture in a Secret C.I.A. Prison",
      "url": "https://www.nytimes.com/2025/10/13/us/politics/cia-torture-black-sites.html",
      "summary": "An interrogator covertly used a power drill and handgun to menace a prisoner, without permission from the agency’s headquarters."
    },
    {
      "title": "Dozens Rescued in Remote Alaskan Villages in Storm That Swept Away Homes",
      "url": "https://www.nytimes.com/2025/10/13/us/alaska-flooding-rescues.html",
      "summary": "The Coast Guard and the Alaska National Guard were conducting search-and-rescue operations in two villages along the Bering Sea on Sunday."
    },
    {
      "title": "A Tennessee Sheriff Becomes the Face of Grief After Plant Explosion",
      "url": "https://www.nytimes.com/2025/10/12/us/tennessee-sheriff-plant-explosion-tears.html",
      "summary": "The blast that killed 16 people has left area residents reeling, including Sheriff Chris Davis of Humphreys County, who has fought back tears in his public briefings."
    },
    {
      "title": "2 Dead After Small Plane Crashes Into Semitrailers Near Texas Airfield",
      "url": "https://www.nytimes.com/2025/10/12/us/fort-worth-plane-crash-hicks-field.html",
      "summary": "It was unknown what led up to the crash on Sunday afternoon near Hicks Airfield outside of Fort Worth."
    },
    {
      "title": "Trump Has Not Ruled Out Invoking Insurrection Act to Deploy National Guard, Vance Says",
      "url": "https://www.nytimes.com/2025/10/12/us/politics/jd-vance-trump-insurrection-act.html",
      "summary": "Vice President JD Vance asserted in an interview on NBC News’ “Meet the Press” that crime was “out of control” in major U.S. cities."
    },
    {
      "title": "Tennessee community mourns 16 killed in munitions plant explosion",
      "url": "https://www.theguardian.com/us-news/2025/oct/13/tennessee-munitions-plant-explosion",
      "summary": "&lt;p&gt;Cause of explosion at Accurate Energetic Systems that leveled building is unknown but foul play ruled out&lt;/p&gt;&lt;p&gt;At least 200 mourners came to the Humphreys county courthouse at twilight on Sunday to mourn the 16 people killed in an explosion at a nearby munitions plant in middle Tennessee early on Friday.&lt;/p&gt;&lt;p&gt;Humphreys county sheriff Chris Davis said that even in these nightmarish days, “the true strength of our county is our people”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/13/tennessee-munitions-plant-explosion\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Growing number of US veterans face arrest over Ice raid protests",
      "url": "https://www.theguardian.com/us-news/2025/oct/13/us-veterans-protest-ice-raids",
      "summary": "&lt;p&gt;Veterans are facing federal charges after protesting Ice sweeps and Trump’s national guard deployments. The justice department claims the veterans were violent&lt;/p&gt;&lt;p&gt;US military veterans increasingly face arrest and injury amid protests over&lt;strong&gt; &lt;/strong&gt;Donald Trump’s deportation campaign and his push to deploy national guard members to an ever-widening number of American cities.&lt;/p&gt;&lt;p&gt;The Guardian has identified eight instances where military veterans have been prosecuted or sought damages after being detained by federal agents.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/13/us-veterans-protest-ice-raids\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}