{
  "updatedAt": "2025-09-26T13:33:48.106Z",
  "items": [
    {
      "title": "Close National Parks if Government Shuts Down, Former Superintendents Plead",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/national-parks-open-government-shutdown.html",
      "summary": "More than 35 former park superintendents wrote a letter to the Trump administration, saying the lands could be damaged under limited staffing."
    },
    {
      "title": "A Timeline of the Trump-Comey Relationship",
      "url": "https://www.nytimes.com/2025/09/26/us/trump-comey-relationship-timeline.html",
      "summary": "James B. Comey, the former F.B.I. director now under indictment, has long been a target of President Trump’s ire."
    },
    {
      "title": "4 Takeaways From Trump’s Securing of an Indictment Against Comey",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/comey-indictment-trump-takeaways.html",
      "summary": "The president’s pressure on the Justice Department to charge one of his highest-profile retribution targets could have profound consequences."
    },
    {
      "title": "Gabbard Ends Intelligence Report on Future Threats to U.S.",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/gabbard-intelligence-report-cancellation.html",
      "summary": "Some issues in the document, which is issued every four years, had become politically inconvenient, former officials said."
    },
    {
      "title": "A Broad Wave of Firings Followed Charlie Kirk’s Assassination",
      "url": "https://www.nytimes.com/2025/09/26/us/kirk-critics-fired-free-speech.html",
      "summary": "More than 145 people in a wide range of occupations have been fired or disciplined after they made statements about the assassination of Charlie Kirk."
    },
    {
      "title": "Federal Bureau of Prisons Ends Union Protections for Workers",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/federal-prisons-workers-union.html",
      "summary": "The union of prison employees condemned the contract’s termination, which is part of the Trump administration’s overhaul of the federal work force."
    },
    {
      "title": "ACLU calls James Comey indictment ‘a grotesque abuse of presidential power’ – live updates",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
      "summary": "&lt;p&gt;Civil rights group says ‘Trump has yet again proven his disdain for the principles that have actually made America great’; US president calls Comey a ‘dirty cop’&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Well, the president is awake.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Donald Trump has posted the following on his Truth Social social media network:&lt;/p&gt;&lt;p&gt;JAMES COMEY IS A DIRTY COP. MAKE AMERICA GREAT AGAIN!&lt;/p&gt;&lt;p&gt;Whether you like Corrupt James Comey or not, and I can’t imagine too many people liking him, HE LIED! It is not a complex lie, it’s a very simple, but IMPORTANT one. There is no way he can explain his way out of it. He is a Dirty Cop, and always has been, but he was just assigned a Crooked Joe Biden appointed Judge, so he’s off to a very good start."
    },
    {
      "title": "Several demonstrators arrested outside Netanyahu’s hotel ahead of UN speech",
      "url": "https://www.theguardian.com/us-news/2025/sep/26/benjamin-netanyahu-new-york-un-protest",
      "summary": "&lt;p&gt;About two dozen protested after midnight, carrying flags and signs and calling out ‘baby killer’ and ‘free Palestine’&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/world/live/2025/sep/26/gaza-israel-benjamin-netanyahu-un-united-nations-unga-west-bank-donald-trump-middle-east-crisis-live\"&gt;Middle East crisis – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Several demonstrators were arrested in the early hours of Friday outside the hotel where the Israeli prime minister, &lt;a href=\"https://www.theguardian.com/world/benjamin-netanyahu\"&gt;Benjamin Netanyahu&lt;/a&gt;, is staying in New York &lt;a href=\"https://www.theguardian.com/world/live/2025/sep/26/gaza-israel-benjamin-netanyahu-un-united-nations-unga-west-bank-donald-trump-middle-east-crisis-live\"&gt;ahead of&lt;/a&gt; his scheduled speech on Friday morning at the &lt;a href=\"https://www.theguardian.com/world/unitednations\"&gt;United Nations&lt;/a&gt; general assembly.&lt;/p&gt;&lt;p&gt;About two dozen people protested in a small but noisy gathering near Netanyahu’s hotel in the Lenox Hill neighborhood on the east side of Manhattan, not far from the UN building.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/26/benjamin-netanyahu-new-york-un-protest\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}