{
  "updatedAt": "2025-10-24T12:56:01.492Z",
  "items": [
    {
      "title": "Trump Official Warns California Against Arresting Federal Agents",
      "url": "https://www.nytimes.com/2025/10/24/us/federal-ice-agents-arrests-california-pelosi.html",
      "summary": "Deputy U.S. Attorney General Todd Blanche told top California leaders that they would be prosecuted if they arrested federal agents performing immigration raids."
    },
    {
      "title": "Federal Workers Have Started Missing Paychecks During the Shutdown",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/federal-workers-missing-paychecks-shutdown.html",
      "summary": "Thousands missed their first paychecks this week, with no end in sight to the government shutdown that began on Oct. 1."
    },
    {
      "title": "Letitia James to Appear in Court as Battle Over Trump-Urged Prosecution Begins",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/letitia-james-court.html",
      "summary": "The New York attorney general, indicted by President Trump’s handpicked prosecutor in the Eastern District of Virginia, is expected to plead not guilty in her arraignment on Friday."
    },
    {
      "title": "How San Francisco Mayor Daniel Lurie Avoided Trump’s Enforcement Surge",
      "url": "https://www.nytimes.com/2025/10/24/us/daniel-lurie-trump-san-francisco.html",
      "summary": "Daniel Lurie, the San Francisco mayor, relied on powerful tech executives and his own low-key approach to help his liberal city escape a rush of federal agents."
    },
    {
      "title": "How Does the U.S. Decide Which Boats to Target? Here’s What We Know.",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/boat-strikes-us-intelligence.html",
      "summary": "Officials say intercepted communications are the core of the intelligence collected on the boats."
    },
    {
      "title": "The Peril of a White House That Flaunts Its Indifference to the Law",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/white-house-boats-law.html",
      "summary": "The White House has made no legal argument explaining its bald claim that the president has wartime power to summarily kill people suspected of smuggling drugs."
    },
    {
      "title": "Trump accuses Canada of attempting to influence US supreme court with anti-tariff advertising campaign – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news",
      "summary": "&lt;p&gt;The US president announced he ended talks in retaliation to an ad featuring Ronald Reagan speaking negatively about tariffs&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/world/2025/oct/24/trump-says-all-canada-trade-talks-terminated-over-ad-criticising-tariffs\"&gt;Trump says all Canada trade talks ‘terminated’ over ad criticizing tariffs&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;The US secretary of state has confirmed Donald Trump’s announcement that all trade negotiations with Canada have been suspended.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Marco Rubio spoke during a visit to a civil-military coordination centre in southern Israel.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "First Thing: Trump backs down on sending federal troops to San Francisco",
      "url": "https://www.theguardian.com/us-news/2025/oct/24/first-thing-trump-backs-down-on-sending-federal-troops-to-san-francisco",
      "summary": "&lt;p&gt;Protesters flood streets in show of resistance. Plus, our architecture critic on Trump’s bulletproof ballroom bling&lt;/p&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;Donald Trump has &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/23/san-francisco-federal-immigration-operation\"&gt;canceled plans for a deployment of federal troops to San Francisco&lt;/a&gt; that had sparked widespread condemnation from California leaders and sent protesters flooding into the streets.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What did Trump say about his change of mind?&lt;/strong&gt; Trump confirmed he had a conversation with mayor, Daniel Lurie, writing on social media: “I spoke to Mayor Lurie last night and he asked, very nicely, that I give him a chance to see if he can turn it around.”&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What are current tariffs on goods from Canada?&lt;/strong&gt; Washington originally &lt;a href=\"https://www.theguardian.com/world/2025/apr/03/canada-trump-tariffs-exemption\"&gt;imposed a 25% tariff&lt;/a&gt; on imports of goods including timber, steel, aluminum and cars in the spring, prompting retaliatory action from Ottawa. The rate was &lt;a href=\"https://www.theguardian.com/us-news/2025/jul/31/trump-canada-tariffs-order\"&gt;raised to 35% by Trump&lt;/a&gt; in August.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;How did Carney respond to Trump’s fusillade?&lt;/strong&gt; His office didn’t immediately respond to a request for comment last night. The prime minister was set to leave on Friday morning for a summit in Asia, while Trump is set to do the same on Friday evening.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/24/first-thing-trump-backs-down-on-sending-federal-troops-to-san-francisco\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}