{
  "updatedAt": "2025-11-09T12:49:30.212Z",
  "items": [
    {
      "title": "Where Democrats Will Duel Next for the Party’s Future",
      "url": "https://www.nytimes.com/2025/11/09/us/politics/democrats-midterms-senate-house.html",
      "summary": "In Michigan, Maine and many other states, primary candidates will decide the party’s direction on a host of policy issues, and ultimately whether it has a center-left or left-wing vision."
    },
    {
      "title": "Trump Loyalists Push ‘Grand Conspiracy’ as New Subpoenas Land",
      "url": "https://www.nytimes.com/2025/11/09/us/politics/trump-conspiracy-probe-subpoenas.html",
      "summary": "The Justice Department moved an inquiry that appeared initially focused on John O. Brennan to South Florida and is beginning to recruit line prosecutors."
    },
    {
      "title": "A Two-Headed Coin That Always Comes Up ‘Trump’",
      "url": "https://www.nytimes.com/2025/11/09/us/trump-commemorative-coin.html",
      "summary": "Would a proposed coin featuring the president on both sides commemorate America’s founding, or undercut its founding principles?"
    },
    {
      "title": "The Celebrated Chef Who Robbed Banks",
      "url": "https://www.nytimes.com/2025/11/09/us/chef-bank-robber.html",
      "summary": "Valentino Luchin, 62, once owned an acclaimed Italian restaurant. Now he sits in a Bay Area jail."
    },
    {
      "title": "New SF Clinic Helps People Facing Health Breakdowns in Public",
      "url": "https://www.nytimes.com/2025/11/09/us/san-francisco-drug-mental-health-clinic-lurie.html",
      "summary": "A former Goodwill thrift store now houses an urgent care clinic for people experiencing mental health breakdowns in public."
    },
    {
      "title": "The MAHA-Fueled Rise of Natural Family Planning",
      "url": "https://www.nytimes.com/2025/11/09/us/politics/maha-natural-family-planning.html",
      "summary": "A growing coalition of conservatives are speaking out against hormonal birth control, while promoting a more “natural” alternative."
    },
    {
      "title": "‘Too far? I don’t think we’ve gone far enough!’ The founder of Peta on gruesome stunts and her bloody fight for animal rights",
      "url": "https://www.theguardian.com/us-news/2025/nov/09/ingrid-newkirk-peta-interview-animal-rights",
      "summary": "&lt;p&gt;After 45 years as chief fake blood thrower, Ingrid Newkirk is still waging war on everything from leather to cashmere. Is she still relevant?&lt;/p&gt;&lt;p&gt;Ingrid Newkirk was 54 when she thought she was going to die in a plane crash. It was late summer and the founder&lt;strong&gt; &lt;/strong&gt;of &lt;a href=\"https://www.peta.org.uk/\"&gt;People for the Ethical Treatment of Animals&lt;/a&gt; (Peta) was flying from Minneapolis in the US to the company HQ in Norfolk, Virginia when her plane encountered strong wind shear. The pilot attempted an emergency landing, but failed; back up they went.&lt;/p&gt;&lt;p&gt;On the third attempt, with “a teaspoon of fuel” in the tank, he finally got the plane down safely. During those moments, Newkirk, now 76, scribbled a will on a napkin."
    },
    {
      "title": "Trump’s assault on voting intensifies as midterms loom:‘a wholesale attack on free and fair elections’",
      "url": "https://www.theguardian.com/us-news/2025/nov/09/trump-midterm-elections-voting-system",
      "summary": "&lt;p&gt;White House is manipulating voting system, from redistricting to rule changes, to affect midterms&lt;/p&gt;&lt;p&gt;A year out from the 2026 midterms, with &lt;a href=\"https://www.theguardian.com/us-news/republicans\"&gt;Republicans&lt;/a&gt; feeling the blows from a string of losses in this week’s elections, &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; and his allies are mounting a multipronged attack on almost every aspect of voting in the United States and raising what experts say are troubling questions about the future of one of the world’s oldest democracies.&lt;/p&gt;&lt;p&gt;While Democratic leaders continue to invest their hopes in a “&lt;a href=\"https://www.politico.com/news/2025/08/03/democrats-blue-wave-2026-midterms-00489291\"&gt;blue wave&lt;/a&gt;” to overturn Republican majorities in the &lt;a href=\"https://www.theguardian.com/us-news/house-of-representatives\"&gt;House&lt;/a&gt; and &lt;a href=\"https://www.theguardian.com/us-news/us-senate\"&gt;Senate&lt;/a&gt; next year, Trump and some prominent supporters have sought to discredit the possibility that Republicans could lose in a fair fight and are using that premise to justify demands for a drastically different kind of electoral system.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/09/trump-midterm-elections-voting-system\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}