{
  "updatedAt": "2025-09-20T13:05:17.145Z",
  "items": [
    {
      "title": "What to Know About Charlie Kirk’s Funeral: Time, How to Watch and Speakers",
      "url": "https://www.nytimes.com/2025/09/20/us/charlie-kirk-funeral-memorial-time-guests.html",
      "summary": "The conservative activist will be honored in a public program on Sunday, with President Trump and several top administration officials expected to speak."
    },
    {
      "title": "Inside The Times’s Reporting and Judgment Calls on Charlie Kirk’s Assassination",
      "url": "https://www.nytimes.com/2025/09/20/us/charlie-kirk-shooting-news-coverage.html",
      "summary": "We gathered some of the journalists closely involved to discuss how we approached coverage and to answer readers’ questions about it."
    },
    {
      "title": "Inspired by Conservative Tactics, an Obscure Group Seeks Sway for Democrats",
      "url": "https://www.nytimes.com/2025/09/20/us/politics/pipeline-fund-democrats-local-elections.html",
      "summary": "A liberal group that was spun off from a network funded by George Soros is looking to build off 2024 victories in Florida to help elect candidates to school boards and other local offices."
    },
    {
      "title": "He Wrote a Biting Post About Charlie Kirk. The Fury Came Fast.",
      "url": "https://www.nytimes.com/2025/09/20/us/florida-charlie-kirk-free-speech.html",
      "summary": "Residents of Palmetto Bay, Fla., have demanded the resignation of Councilman Stephen Cody, who wrote a post mocking Charlie Kirk’s support for gun rights."
    },
    {
      "title": "U.S. Is Losing Race to Return to Moon, Critics Say, Pointing at SpaceX",
      "url": "https://www.nytimes.com/2025/09/20/us/politics/spacex-us-moon-race.html",
      "summary": "The company’s Starship rocket, which has suffered a series of recent test explosions, is still years away from being ready for the mission, former NASA executives say."
    },
    {
      "title": "States Grapple With Fundamental Change in Food Stamps",
      "url": "https://www.nytimes.com/2025/09/20/us/politics/food-stamps-snap.html",
      "summary": "Whether states can find the money in their budgets — billions of dollars in some cases — will have wide-ranging, and likely uneven, consequences for some 42 million recipients."
    },
    {
      "title": "On the street and in your feed: the joyful genius of Zohran Mamdani’s viral videos",
      "url": "https://www.theguardian.com/us-news/2025/sep/20/zohran-mamdani-social-media-viral-videos",
      "summary": "&lt;p&gt;The frontrunner for New York mayor has won social media with clips that are always fun – and resolutely on-message&lt;/p&gt;&lt;p&gt;Zohran Mamdani’s &lt;a href=\"https://maristpoll.marist.edu/polls/nyc-mayoralty-september-2025/\"&gt;commanding lead&lt;/a&gt; in the New York City mayoral election owes much to his ability to tap into the concerns of New Yorkers – putting affordability and housing at the center of his campaign.&lt;/p&gt;&lt;p&gt;But he’s been helped, too, by a superstar social media presence. The charismatic 33-year-old regularly beams out slick videos on TikTok and Instagram that have helped raise his profile and attract a swathe of voters and volunteers.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/20/zohran-mamdani-social-media-viral-videos\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Black women are being hit hard by the Trump layoffs and firings: ‘It chips away at morale and self-worth’",
      "url": "https://www.theguardian.com/us-news/2025/sep/20/black-women-trump-federal-layoffs",
      "summary": "&lt;p&gt;Though they make up just over 6% of the total workforce, Black women account for more than 12% of federal workers&lt;/p&gt;&lt;p&gt;On 30 May 2025, Dr Ravon Alford received an email from leadership at her job that the federal government had chosen to revoke the organization’s active federal grants. At the time, Alford, who’s 33, had been working as a senior policy analyst at a criminal justice reform non-profit organization in Detroit. As a result of the budget cuts, all work related to projects that were funded by these grants were ceased. Organization-wide layoffs followed, affecting Alford and 75% of the staff.&lt;/p&gt;&lt;p&gt;Alford is among the &lt;a href=\"https://www.bls.gov/news.release/empsit.t02.htm\"&gt;nearly 300,000 Black women&lt;/a&gt; who exited the US labor force in just three months – a shift tied directly to federal policy decisions. The most immediate cause has been sweeping cuts across public-sector agencies, historically one of the few reliable pathways to &lt;a href=\"https://nwlc.org/press-release/new-report-exposes-trump-federal-government-cuts-target-working-women-and-people-of-color/\"&gt;middle-class stability for Black women&lt;/a&gt;."
    }
  ]
}