{
  "updatedAt": "2025-09-13T18:40:06.232Z",
  "items": [
    {
      "title": "Wrestling Over Charlie Kirk’s Legacy and the Divide in America",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/charlie-kirk-legacy-trump.html",
      "summary": "Historians say the lessons of this particular time will depend on Americans themselves, and what kind of a nation they want it to be."
    },
    {
      "title": "Trump Escalates Attacks on Political Opponents After Charlie Kirk’s Killing",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/trump-kirk-political-opponents.html",
      "summary": "President Trump has promised to bring the killer to justice while using the moment to blame the left — and only the left — more broadly."
    },
    {
      "title": "Rubio Heads to a Defiant Israel After Qatar Strike",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/rubio-israel-natanyahu.html",
      "summary": "The diplomat will consult with Israeli officials about their coming military offensive in Gaza City, as President Trump’s efforts to end the Gaza war appear stalled."
    },
    {
      "title": "Trump Says He Will Impose More Sanctions on Russia if NATO Does",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/trump-sanctions-russia-ukraine.html",
      "summary": "It was the latest in a series of new conditions that President Trump had announced on punitive action against Russia for its war against Ukraine."
    },
    {
      "title": "The Police Found Messages After Kirk’s Killing. What They Mean Is Unclear.",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/tyler-robinson-messages-bullets-charlie-kirk.html",
      "summary": "The messages relied on an enigmatic, coded communication style used by the habitually online."
    },
    {
      "title": "Kirk Assassination Puts America’s Political Spotlight on Campuses Again",
      "url": "https://www.nytimes.com/2025/09/13/us/charlie-kirk-college-campuses-american-political-battles.html",
      "summary": "Colleges are often the setting, and the target, of the nation’s most heated politics. Charlie Kirk’s work on campuses was one factor."
    },
    {
      "title": "Questions linger about alleged shooter’s motivation for killing Charlie Kirk",
      "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-killing-alleged-shooter-motivation",
      "summary": "&lt;p&gt;After a connection to ‘trans ideology’ was retracted, suspect’s background and politics are being pored over&lt;/p&gt;&lt;p&gt;Though the suspect in the &lt;a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"&gt;killing of conservative activist Charlie Kirk&lt;/a&gt; was revealed by authorities on Friday, questions surrounding his identity and motivations have exacerbated intense US political debates in the aftermath of the shooting.&lt;/p&gt;&lt;p&gt;Authorities revealed Kirk’s suspected killer to be Tyler Robinson, a 22-year-old man who grew up in Washington, &lt;a href=\"https://www.theguardian.com/us-news/utah\"&gt;Utah&lt;/a&gt;, along the state’s south-western border.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-killing-alleged-shooter-motivation\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Charlie Kirk’s US campus tour will continue despite his death, widow says – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/13/charlie-kirk-suspect-tyler-robinson-erika-kirk-us-politics-latest-news-donald-trump",
      "summary": "&lt;p&gt;Erika Kirk said ‘my husband’s voice will remain’ despite his death&lt;/p&gt;&lt;p&gt;Images coming out of the far-right ‘Unite the Kingdom’ march in central London on Saturday show framed photographs of Charlie Kirk being held aloft as protesters gather.&lt;/p&gt;&lt;p&gt;The far-right activist and political commentator, who was fatally shot this week in Utah, galvanized young conservatives through &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/12/charlie-kirk-young-conservatives-social-media\"&gt;online antics and inflammatory views&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/13/charlie-kirk-suspect-tyler-robinson-erika-kirk-us-politics-latest-news-donald-trump\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}