{
  "updatedAt": "2025-12-03T06:42:05.965Z",
  "items": [
    {
      "title": "Federal Judge Bars Some Warrantless Immigration Arrests in D.C.",
      "url": "https://www.nytimes.com/2025/12/03/us/politics/warrantless-immigration-arrests-dc.html",
      "summary": "The judge found that immigration agents were likely acting illegally when making arrests without a warrant."
    },
    {
      "title": "Trump to Close Voice of America’s Overseas Offices and Radio Stations",
      "url": "https://www.nytimes.com/2025/12/02/us/politics/trump-voice-of-america-overseas-offices.html",
      "summary": "The push to close the offices appears to contradict a federal judge’s order from April, which required Trump officials to resume operations at V.O.A."
    },
    {
      "title": "Matt Van Epps Wins Tennessee House Race After a Trump-Led Rescue Mission",
      "url": "https://www.nytimes.com/2025/12/02/us/politics/tennessee-special-election-winner-matt-van-epps.html",
      "summary": "Matt Van Epps fended off a Democrat to protect Republicans’ slim House majority, but the relatively close margin in a red district sent the party a warning shot before the 2026 midterms."
    },
    {
      "title": "U. of Alabama Suspends Black and Female Student Magazines, Citing D.E.I. Guidance",
      "url": "https://www.nytimes.com/2025/12/02/us/u-of-alabama-student-magazines-dei.html",
      "summary": "Officials told staff members at two student-run publications, called Nineteen Fifty-Six and Alice, that they were not compliant with Attorney General Pam Bondi’s memo on diversity programs."
    },
    {
      "title": "Trump’s Shift on Afghan Immigrants",
      "url": "https://www.nytimes.com/video/us/politics/100000010557371/trumps-shift-on-afghan-immigrants.html",
      "summary": "Zolan Kanno-Youngs, a White House correspondent, describes how President Trump’s latest immigration restrictions, after the shooting of two National Guard members by a man whom the authorities described as an Afghan national, affect a community that traditionally has been considered an exceptional case."
    },
    {
      "title": "Trump Appears to Fight Sleep During Cabinet Meeting",
      "url": "https://www.nytimes.com/2025/12/02/us/politics/trump-sleep-cabinet-meeting.html",
      "summary": "President Trump began the meeting by criticizing media coverage about him showing signs of fatigue. Last month, he appeared to doze off during a meeting in the Oval Office."
    },
    {
      "title": "Pete Hegseth says he ‘didn’t stick around’ to watch second strike on alleged drug boat as Democrats slam administration over attacks – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/02/donald-trump-pete-hegseth-boat-venezuela-maduro-tennessee-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Defense secretary says he ‘moved on to my next meeting’ as sensitive military operation was under way; top Democrat calls Hegseth ‘spineless’ and ‘a national embarrassment’. This blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/dec/02/us-admiral-to-brief-lawmakers-as-bipartisan-scrutiny-grows-over-boat-strike\"&gt;White House ‘selling out’ admiral to shield Hegseth over strikes, officials say&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/dec/02/trump-threatens-strikes-drugs-venezuela\"&gt;Trump threatens strikes on any country he claims makes drugs for US&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;em&gt;Joseph Gedeon is a politics breaking news reporter based in Washington&lt;/em&gt;&lt;/p&gt;&lt;p&gt;The &lt;a href=\"https://www.theguardian.com/us-news/fbi\"&gt;FBI&lt;/a&gt; director, &lt;strong&gt;Kash Patel&lt;/strong&gt;, is “in over his head” and leading a “chronically under-performing” agency paralyzed by fear and plummeting morale, according to a scathing 115-page report compiled by a national alliance of retired and active-duty FBI special agents and analysts.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/02/donald-trump-pete-hegseth-boat-venezuela-maduro-tennessee-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Republican Matt Van Epps wins US House special election in Tennessee",
      "url": "https://www.theguardian.com/us-news/2025/dec/02/tennessee-special-election",
      "summary": "&lt;p&gt;Van Epps defeats Aftyn Behn in congressional election closely watched for signs of Republican weakness&lt;/p&gt;&lt;p&gt;Republican Matt Van Epps defeated Democrat Aftyn Behn in a &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/01/tennessee-democrats-congressional-race\"&gt;congressional special election&lt;/a&gt; in the western Nashville suburbs, which was being closely watched for signs of Republican weakness going into congressional midterms next year.&lt;/p&gt;&lt;p&gt;The Associated Press called the race at 9.47 EST with Van Epps holding a 52% to 46% lead.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/02/tennessee-special-election\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}