{
  "updatedAt": "2025-11-08T18:34:07.121Z",
  "items": [
    {
      "title": "Man Dies After Slipping and Falling in Grand Canyon West",
      "url": "https://www.nytimes.com/2025/11/08/us/grand-canyon-fall-death.html",
      "summary": "The body of a 65-year-old man, who fell 130 feet, was recovered on Thursday, officials said."
    },
    {
      "title": "Black South Carolina Residents Say Re-Routed Penn Center Parade Feels Like Erasure",
      "url": "https://www.nytimes.com/2025/11/08/us/penn-center-parade-south-carolina-gullah-geechee.html",
      "summary": "The annual Penn Center Heritage Day Parade in South Carolina draws hundreds to celebrate the Gullah Geechee people. But a new route has Black residents feeling as if their legacy is vanishing."
    },
    {
      "title": "Supreme Court Ruling on SNAP Benefits Leaves Families in Limbo",
      "url": "https://www.nytimes.com/2025/11/08/us/politics/families-food-stamps-supreme-court-order.html",
      "summary": "In many states, it remained unclear how the Supreme Court’s Friday night order might immediately affect low-income residents."
    },
    {
      "title": "At Least 4 Dead After Driver Slams Into Crowd Outside a Tampa Bar, Police Say",
      "url": "https://www.nytimes.com/2025/11/08/us/car-crash-tampa-florida.html",
      "summary": "The crash left 11 people injured. The police said they chased the vehicle after trying to pull over a reckless driver, who sped off and then lost control."
    },
    {
      "title": "Who Can Collect Food Stamps? Fact-Checking Claims About SNAP Eligibility and Spending.",
      "url": "https://www.nytimes.com/2025/11/08/us/politics/snap-food-stamps-eligibility-fact-check.html",
      "summary": "We examined falsehoods about SNAP eligibility and costs and the number of unauthorized immigrants receiving benefits."
    },
    {
      "title": "What We Know About Flight Cancellations and Air Travel During the Shutdown",
      "url": "https://www.nytimes.com/2025/11/08/us/flight-cancellations-delays-airports-shutdown.html",
      "summary": "The Federal Aviation Administration has required airlines to cut flights to reduce the strain on air traffic controllers, who have gone weeks without a paycheck."
    },
    {
      "title": "DHS head reportedly authorized purchase of 10 engineless Spirit Airlines planes that airline didn’t own",
      "url": "https://www.theguardian.com/us-news/2025/nov/08/kristi-noem-spirit-airlines-planes",
      "summary": "&lt;p&gt;Wall Street Journal reports Kristi Noem arranged purchase to expand deportation flights and for personal travel&lt;/p&gt;&lt;p&gt;The secretary of the US Department of Homeland Security (DHS), &lt;a href=\"https://www.theguardian.com/us-news/kristi-noem\"&gt;Kristi Noem&lt;/a&gt;, reportedly authorized the purchase of Spirit Airlines jets before discovering the airline didn’t actually own the planes – and that the aircraft lacked engines.&lt;/p&gt;&lt;p&gt;The bizarre anecdote was contained in a &lt;a href=\"https://www.wsj.com/politics/policy/department-homeland-security-deportation-disfunction-976a0e9b?\"&gt;Wall Street Journal&lt;/a&gt; report released on Friday, which recounted how Noem and Corey Lewandowski – who managed &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt;’s first winning presidential campaign – had recently arranged to buy 10 Boeing 737 aircraft from Spirit Airlines. People familiar with the situation told the paper that the two intended to use the jets to expand deportation flights – and for personal travel.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/08/kristi-noem-spirit-airlines-planes\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Driver livestreams herself on TikTok as she apparently hits and kills man in Chicago",
      "url": "https://www.theguardian.com/us-news/2025/nov/08/tiktok-live-stream-fatal-crash-chicago",
      "summary": "&lt;p&gt;TikTok video shows woman speaking into camera and reacting to a loud thud before she says ‘I just hit somebody’&lt;/p&gt;&lt;p&gt;Authorities are investigating a newly surfaced video that suggests a woman who hit and killed a man while driving in the &lt;a href=\"https://www.theguardian.com/us-news/chicago\"&gt;Chicago&lt;/a&gt; suburb of Zion, Illinois, on Monday night was livestreaming on TikTok at the time of the crash.&lt;/p&gt;&lt;p&gt;The video in question was reportedly taken by a user in Zion, and it shows a woman behind the wheel of a car reacting to a loud thud by saying, “Fuck, fuck, fuck … I just hit somebody.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/08/tiktok-live-stream-fatal-crash-chicago\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}