{
  "updatedAt": "2025-11-02T06:36:52.794Z",
  "items": [
    {
      "title": "War Powers Law Does Not Apply to Trump’s Boat Strikes, Administration Says",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/trump-boat-attacks-war-powers.html",
      "summary": "The move deepened the idea that a Vietnam-era law, which says congressionally unauthorized deployments into “hostilities” must end after 60 days, does not apply to airstrike campaigns."
    },
    {
      "title": "Explosion at Harvard Medical School Was ‘Intentional,’ Officials Say",
      "url": "https://www.nytimes.com/2025/11/01/us/harvard-medical-school-explosion.html",
      "summary": "Two people were seen running from the building afterward, the school said. No injuries were reported, the school police said."
    },
    {
      "title": "Trump Administration Must Make Food Stamp Payments Within Days, Judge Says",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/trump-food-stamp-payments.html",
      "summary": "The written order came one day after a court told the Trump administration it must pay benefits in the program known as SNAP during the shutdown."
    },
    {
      "title": "Trump’s Team Offers to Keep Some Ballroom Donors Incognito",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/trumps-team-offers-to-keep-some-ballroom-donors-incognito.html",
      "summary": "Many corporate interests that have donated to the president’s pet project have business before his administration."
    },
    {
      "title": "Fed Governor Defends Call for Big Rate Cuts",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/steven-miran-interview-transcript.html",
      "summary": "In a wide-ranging interview, Stephen I. Miran discussed why he thinks concerns about inflation are overblown and his worries about the economy if the Federal Reserve does not rapidly lower interest rates. Here is a full transcript."
    },
    {
      "title": "Shutdowns, Obamacare and the Risks of Bargaining for Policy Wins in a Crisis",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/shutdowns-obamacare-republicans-democrats.html",
      "summary": "A 2013 attempt to leverage minority power in a health care fight blew up on Republicans. Can today be different for Democrats?"
    },
    {
      "title": "Three killed in US military strike on alleged drug vessel in the Caribbean",
      "url": "https://www.theguardian.com/us-news/2025/nov/02/three-killed-in-us-military-strike-on-alleged-drug-vessel-in-the-caribbean",
      "summary": "&lt;p&gt;Defense secretary announces a new strike on alleged drug smugglers in the Caribbean Sea, bringing total killed in US strikes to at least 64 people&lt;/p&gt;&lt;p&gt;The US military has carried out another lethal strike on alleged drug smugglers in the Caribbean Sea, US defense secretary Pete Hegseth said.&lt;/p&gt;&lt;p&gt;Hegseth said on Saturday the vessel was operated by a US-designated terrorist organization but did not name which group was targeted. He said three people were killed in the strike.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/02/three-killed-in-us-military-strike-on-alleged-drug-vessel-in-the-caribbean\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: president threatens military action in Nigeria over alleged killings of Christians",
      "url": "https://www.theguardian.com/us-news/2025/nov/02/trump-administration-news-updates-today",
      "summary": "&lt;p&gt;President says he has instructed the newly named department of war to “prepare for possible action” in the West African country. Key US politics stories from Saturday 1 November at a glance&lt;/p&gt;&lt;p&gt;In describing his foreign policy agenda, Donald Trump has proclaimed an “America First” policy.&lt;/p&gt;&lt;p&gt;But on Saturday the US president threatened to launch attacks in Nigeria in response to alleged violence against Christians, saying he had instructed his newly named department of war to “prepare for possible action”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/02/trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}