{
  "updatedAt": "2025-10-02T12:51:28.192Z",
  "items": [
    {
      "title": "Here’s the latest.",
      "url": "https://www.nytimes.com/live/2025/10/02/us/trump-government-shutdown/here-is-the-latest",
      "summary": ""
    },
    {
      "title": "After Michigan Church Shooting, One Man Raised $200,000 for the Suspect’s Family",
      "url": "https://www.nytimes.com/2025/10/02/us/lds-church-michigan-grand-blanc-township.html",
      "summary": "A member of the Latter-day Saints church was worried about the road to recovery that the family of the Michigan gunman faced. So he started a donation page for them."
    },
    {
      "title": "Times/Siena Survey: Americans Worry Divisions Cannot Be Overcome",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/times-siena-poll-political-polarization.html",
      "summary": "A new Times/Siena survey shows a significant shift among voters, as their concerns about the health of the political system overtake other issues."
    },
    {
      "title": "Ophelia Disappeared: A Wall Street Analyst and a Deadly Shootout",
      "url": "https://www.nytimes.com/2025/10/02/us/zizians.html",
      "summary": "The group was passionately vegan, mostly transgender and highly educated. Seven of them are now in jail. This is the story of one who did not survive."
    },
    {
      "title": "Trump Administration Asks Colleges to Sign ‘Compact’ to Get Funding Preference",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/trump-college-funding.html",
      "summary": "Demands sent to nine top schools included pledging to freeze tuition for five years and to commit to strict definitions of gender."
    },
    {
      "title": "NTSB Faults Philadelphia Transit Agency Over Train Fires",
      "url": "https://www.nytimes.com/2025/10/01/us/ntsb-philadelphia-septa-train-cars.html",
      "summary": "The National Transportation Safety Board said hundreds of aging rail cars should be taken out of service until they can be replaced or retrofitted."
    },
    {
      "title": "Trump to meet with Project 2025 architect on cutting ‘Democrat agendas’ amid government shutdown – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
      "summary": "&lt;p&gt;Trump touts meeting with Russ Vought ‘of Project 2025 fame’ to determine where cuts can be made as the federal government remains shut for second day&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/02/government-shutdown-regular-people-effect\"&gt;Here’s what the shutdown means for travel, national parks and housing&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Donald Trump is up and truthing as the White House presses on with seizing the opportunity provided by the shutdown to axe federal jobs and Democratic spending priorities. “&lt;strong&gt;I can’t believe the Radical Left Democrats gave me this unprecedented opportunity&lt;/strong&gt;,” Trump writes this morning.&lt;/p&gt;&lt;p&gt;He said he has a meeting today with &lt;strong&gt;Russell Vought&lt;/strong&gt;, “of Project 2025 fame” who is now the head of the office for management and budget, “&lt;strong&gt;to determine which of the many Democrat Agencies&lt;/strong&gt;, &lt;strong&gt;most of which are a political SCAM&lt;/strong&gt;, &lt;strong&gt;he recommends to be cut&lt;/strong&gt;, &lt;strong&gt;and whether or not those cuts will be&lt;/strong&gt; &lt;strong&gt;temporary or permanent&lt;/strong&gt;”.&lt;/p&gt;&lt;p&gt;I have a meeting today with Russ Vought, he of PROJECT 2025 Fame, to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent. I can’t believe the Radical Left Democrats gave me this unprecedented opportunity. They are not stupid people, so maybe this is their way of wanting to, quietly and quickly, MAKE AMERICA GREAT AGAIN! President DJT&lt;/p&gt;&lt;p&gt;&lt;em&gt;Republicans must use this opportunity of Democrat forced closure to clear out dead wood, waste, and fraud."
    },
    {
      "title": "Husband of judge who blocked ‘Alligator Alcatraz’ shutdown has ties to DeSantis",
      "url": "https://www.theguardian.com/us-news/2025/oct/02/alligator-alcatraz-ron-desantis-paul-huck",
      "summary": "&lt;p&gt;Barbara Lagoa’s husband, Paul Huck, is an attorney whose law firm has business with the Florida government&lt;/p&gt;&lt;p&gt;An appeals court judge who &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/04/alligator-alcatraz-appeals-court\"&gt;blocked the closure&lt;/a&gt; of Ron DeSantis’s controversial “Alligator Alcatraz” immigration jail is married to a powerful conservative attorney whose law firm has raked in millions of dollars from the Republican Florida governor’s administration, it has been revealed.&lt;/p&gt;&lt;p&gt;Barbara Lagoa authored the 11th circuit court of appeal’s &lt;a href=\"https://biologicaldiversity.org/docs/regions/Florida-and-Caribbean/2025.09.04-Order-granting-Motions-to-Stay-08.21.25-detention-center-injunction.pdf\"&gt;2-1 ruling&lt;/a&gt; last month that paused the Miami district judge Kathleen Williams’s earlier order that the harsh detention facility in the Florida Everglades &lt;a href=\"https://www.theguardian.com/us-news/2025/aug/21/trump-alligator-alcatraz-judge-ruling\"&gt;must be wound down&lt;/a&gt; within 60 days.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/02/alligator-alcatraz-ron-desantis-paul-huck\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}