{
  "updatedAt": "2025-09-27T06:32:39.277Z",
  "items": [
    {
      "title": "Justice Dept. Agents to Protect ICE Facilities, Bondi Says",
      "url": "https://www.nytimes.com/2025/09/26/us/doj-agents-ice-facilities.html",
      "summary": "Pam Bondi, the attorney general, announced the deployment two days after a gunman opened fire at an ICE facility in Dallas, killing one detainee and injuring two others."
    },
    {
      "title": "Trump Administration Asks Supreme Court to Allow End of Birthright Citizenship",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/supreme-court-birthright-citizenship.html",
      "summary": "Government lawyers asked the justices to clear the way for the president’s executive order ending birthright citizenship."
    },
    {
      "title": "Trump’s Targeting of Soros Foundations Sparks Fear and Defiance on Left",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/trump-soros-foundations-donors.html",
      "summary": "Facing a nascent administration investigation, Alex Soros privately pledged that the Open Society Foundations would back down only “over my dead body.”"
    },
    {
      "title": "Examining James Comey’s 2020 Testimony at the Heart of His Indictment",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/james-comey-testimony-trump.html",
      "summary": "The charges against the former F.B.I. director center on an appearance he made before a Senate committee in September 2020. Here’s a closer look."
    },
    {
      "title": "Police Kill Man Who Shot at Cars Outside Georgia Elementary School",
      "url": "https://www.nytimes.com/2025/09/26/us/valdosta-georgia-school-shooting.html",
      "summary": "The gunman, a 25-year-old who lived near the campus, was shot dead as he approached the front of the school, officials said."
    },
    {
      "title": "Justice Dept. Seeks Information on Fani Willis, Georgia D.A. Who Prosecuted Trump",
      "url": "https://www.nytimes.com/2025/09/26/us/justice-department-fani-willis-trump.html",
      "summary": "Federal investigators have subpoenaed records related to travel they believe Fani Willis took around the time of last year’s election, but it was not immediately clear why."
    },
    {
      "title": "US revokes visa for Colombian president Gustavo Petro after ‘reckless’ actions in New York",
      "url": "https://www.theguardian.com/us-news/2025/sep/27/us-revokes-visa-for-colombian-president-gustavo-petro-after-reckless-actions-in-new-york",
      "summary": "&lt;p&gt;At a pro-Palestine protest, Petro urged US soldiers to ‘disobey Trump’s order’ and ‘not point their rifles at humanity’&lt;/p&gt;&lt;p&gt;The US state department said on Friday it would revoke the visa of &lt;a href=\"https://www.theguardian.com/world/colombia\"&gt;Colombian&lt;/a&gt; leftist president Gustavo Petro for his “incendiary actions” during a pro-Palestinian street protest in New York.&lt;/p&gt;&lt;p&gt;“Earlier today, Colombian president @petrogustavo stood on a NYC street and urged US soldiers to disobey orders and incite violence,” the state department said on X.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/27/us-revokes-visa-for-colombian-president-gustavo-petro-after-reckless-actions-in-new-york\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump urges Microsoft to fire lawyer who ran investigation into attempt to overturn 2020 US election – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
      "summary": "&lt;p&gt;This blog is closed. Read more &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/26/james-comey-indictment-reaction\"&gt;here&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Well, the president is awake.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Donald Trump has posted the following on his Truth Social social media network:&lt;/p&gt;&lt;p&gt;JAMES COMEY IS A DIRTY COP. MAKE AMERICA GREAT AGAIN!&lt;/p&gt;&lt;p&gt;Whether you like Corrupt James Comey or not, and I can’t imagine too many people liking him, HE LIED! It is not a complex lie, it’s a very simple, but IMPORTANT one. There is no way he can explain his way out of it."
    }
  ]
}