{
  "updatedAt": "2025-09-27T18:32:07.616Z",
  "items": [
    {
      "title": "Trump Says He Has Ordered Troops to Portland, Oregon, to Protect ICE Facilities",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/trump-portland-troops.html",
      "summary": "The president characterized Immigration and Customs Enforcement facilities as being under siege from domestic terrorists."
    },
    {
      "title": "FBI Fires Agents Seen Kneeling During 2020 Racial Justice Protests",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/kash-patel-fbi-firing.html",
      "summary": "Agents group says the latest dismissals are part of a “dangerous pattern” of weakening the nation’s top law enforcement agency."
    },
    {
      "title": "Trump’s Repeated Attacks May Undercut Case Against Comey",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/trump-comey-vindictive-prosecution.html",
      "summary": "The president’s voluble vitriol could provide defense lawyers with an avenue to protect the very people he most wants to punish."
    },
    {
      "title": "Trump Displays Little Interest in Fostering Unity Amid Political Violence",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/political-violence-kirk-trump.html",
      "summary": "After an assassination attempt, Gov. George Wallace, the segregationist, got a surprise visitor: Shirley Chisholm, the first Black woman elected to Congress. Could this happen today?"
    },
    {
      "title": "Iowa Matters Less Than Ever for Democrats, but They Can’t Quit It",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/iowa-democrats-president.html",
      "summary": "The state no longer goes first for the party’s presidential nomination process, but ambitious politicians with an eye toward 2028 keep showing up. It’s “the gravitational pull,” as one Iowa Democrat put it."
    },
    {
      "title": "Jeanne Shaheen Wants to Make Foreign Policy Bipartisan Again",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/jeanne-shaheen-foreign-policy.html",
      "summary": "The Democrat from New Hampshire has worked to find common ground with the Trump administration on foreign affairs."
    },
    {
      "title": "FBI arrest man who allegedly threatened to shoot people at Texas Pride parade",
      "url": "https://www.theguardian.com/us-news/2025/sep/27/fbi-arrest-man-texas-pride-parade",
      "summary": "&lt;p&gt;Suspect Joshua Cole allegedly used a Facebook account to threaten revenge for murder of Charlie Kirk&lt;/p&gt;&lt;p&gt;Federal authorities in Texas have arrested a man for allegedly threatening to shoot people at a pro-LGBTQ+ parade, to avenge the murder of &lt;a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"&gt;Charlie Kirk&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;According to court documents viewed by the Guardian, on 18 September, the FBI’s field office in Dallas was notified by Abilene, Texas, police about online threats from a local resident.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/27/fbi-arrest-man-texas-pride-parade\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Donald Trump says he is deploying troops to Portland, Oregon",
      "url": "https://www.theguardian.com/us-news/2025/sep/27/portland-oregon-us-military-trump",
      "summary": "&lt;p&gt;Apparently misled by hyperbolic reporting from conservative outlets on a single small protest, president described peaceful city as ‘war ravaged’&lt;/p&gt;&lt;p&gt;Donald Trump said on Saturday he is deploying troops to Portland, Oregon, “authorizing Full Force, if necessary”, ignoring pleas from local officials and the state’s congressional delegation, who suggested that the president was misinformed or lying about the nature and scale of a single, small protest outside one federal immigration enforcement office.&lt;/p&gt;&lt;p&gt;Trump made the announcement on social media, using references to antifascists and US Immigration and Customs Enforcement (Ice). He claimed that the deployment was necessary “to protect War ravaged Portland, and any of our (immigration and customs enforcement) Facilities under siege from attack by Antifa, and other domestic terrorists”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/27/portland-oregon-us-military-trump\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}