{
  "updatedAt": "2025-10-31T18:37:50.251Z",
  "items": [
    {
      "title": "Staffing Issues Cause Another Day of Air Travel Delays",
      "url": "https://www.nytimes.com/2025/10/31/us/airport-travel-delays.html",
      "summary": "Insufficient numbers of air traffic controllers, a byproduct of the government shutdown, were affecting travel hubs across the country."
    },
    {
      "title": "Democrats Confident in Final Days of California Proposition 50 Redistricting Election",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/california-redistricting-proposition-50-trump.html",
      "summary": "Proponents say voters are motivated by stopping President Trump. Republicans have already begun pointing fingers over lackluster fund-raising and coordination."
    },
    {
      "title": "Virginia Advances Redistricting Plan Toward New Congressional Maps",
      "url": "https://www.nytimes.com/2025/10/31/us/virginia-redistricting.html",
      "summary": "The Democrat-controlled legislature approved an amendment that would allow redistricting next year, but the process will take months."
    },
    {
      "title": "Republicans in Congress Show Signs of Angst Over Trump’s Trade War",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/trump-republicans-congress-trade.html",
      "summary": "Senators opposed the president’s plan to import beef from Argentina and voted three times this week to end his power to enforce sweeping tariffs."
    },
    {
      "title": "As Government Shutdown Slows Air Traffic Training, These Schools Are Stepping In",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/air-traffic-control-training-shutdown.html",
      "summary": "New programs cannot turn out the numbers needed to make up for the controller shortfall. But they hope to have a higher success rate than the Federal Aviation Agency’s official academy."
    },
    {
      "title": "An Old Debate Meets a New Solution for N.C.’s Confederate Statues",
      "url": "https://www.nytimes.com/2025/10/31/us/north-carolina-confederate-statues.html",
      "summary": "Three Confederate statues that were removed from communities around the state are back on view for the public — this time on private land."
    },
    {
      "title": "Judge blocks suspension of Snap food aid during shutdown – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
      "summary": "&lt;p&gt;Federal court ruling comes hours before more than 40 million Americans could lose food stamps benefits &lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/31/trump-republicans-senate-filibuster-shutdown\"&gt;Trump calls on Republicans to abolish the Senate filibuster rule&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/31/trump-filibuster-explainer-government-shutdown\"&gt;What is the filibuster and why is Trump against it?&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/30/us-government-shutdown-snap-health-insurance\"&gt;How will shutdown affect your access to food or health insurance&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;US House Speaker Mike Johnson reiterated this morning that he will not bring the chamber back into session until the government shutdown ends.&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://bsky.app/profile/atrupar.com/post/3m4iico77ou2p\"&gt;Speaking &lt;/a&gt;to Fox News on Friday, Johnson said: “We are anxious to get the house back to regular legislative session, but we have to get the lights turned back on. Chuck Schumer and the Democrats in the Senate have got to reopen the government. Again, it’s the most fundamental responsibility of congress is to have the government operate and work for the people. That’s the number one priority right now and we cannot deviate from that.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US electricity bills increased by 11% in Trump’s second term, data shows",
      "url": "https://www.theguardian.com/us-news/2025/oct/31/us-electricity-bills-increased-trump",
      "summary": "&lt;p&gt;New analysis prompts letter to Trump from Elizabeth Warren: ‘Your administration has no answers for families hit by high energy costs’&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; promised to slash US electricity bills, but they have increased by 11% since he retook the White House, new data shows.&lt;/p&gt;&lt;p&gt;Democratic lawmakers highlighted the figures in a letter sent to Donald Trump on Friday. “Your administration has no explanations for its failures and no answers for American families that are hit hard by high energy costs, and it continues to actively pursue policies to make this cost crisis worse,” reads the missive, led by &lt;a href=\"https://www.theguardian.com/us-news/elizabeth-warren\"&gt;Elizabeth Warren&lt;/a&gt;, the Massachusetts senator.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/31/us-electricity-bills-increased-trump\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}