{
  "updatedAt": "2025-10-31T06:39:03.127Z",
  "items": [
    {
      "title": "Trump Calls on Republicans to End Filibuster in Shutdown Fight",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/trump-filibuster-shutdown.html",
      "summary": "The president said it was time for G.O.P. leaders to get rid of the longstanding rule requiring most Senate legislation to have 60 votes to pass."
    },
    {
      "title": "Air Traffic Controller Staff Shortage Causes Delays in Orlando and at Other Airports",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/orlando-air-traffic-control-airports-shutdown.html",
      "summary": "The F.A.A. warned that a lack of certified air traffic controllers in Orlando could cause delays throughout the East Coast."
    },
    {
      "title": "Enslaved Potter’s Art, Displayed at Boston Museum, Returns to Heirs at Last",
      "url": "https://www.nytimes.com/2025/10/30/us/mfa-boston-david-drake-pottery.html",
      "summary": "The Museum of Fine Arts, Boston, said David Drake, the artist, had been “deprived of his creations involuntarily and without compensation.”"
    },
    {
      "title": "Ohio Republicans Gain Ground in Push for More Seats in Congress",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/ohio-redistricting-deal.html",
      "summary": "The map, which is expected to be approved on Friday morning by the state’s redistricting commission, improves Republicans’ odds of picking up two more seats."
    },
    {
      "title": "Trump Returns to White House in Time to Greet Trick-or-Treaters",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/trump-halloween-candy-white-house.html",
      "summary": "President Trump, who did not wear a costume, and the first lady handed out candy at the annual Halloween celebration at the White House."
    },
    {
      "title": "A Top Trump Official Had to Sell His Stock. He May Have Saved Millions.",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/frank-bisignano-fiserv-stock-price.html",
      "summary": "Frank Bisignano, who holds top jobs at the Social Security Administration and the I.R.S., sold his stake in Fiserv before the company’s stock cratered this week."
    },
    {
      "title": "Two found dead in flooded basements as New York hit by rainstorm",
      "url": "https://www.theguardian.com/us-news/2025/oct/30/new-york-floods",
      "summary": "&lt;p&gt;Separate incidents see bodies pulled from basements in Brooklyn and Manhattan as heavy rain closes roads and causes delays &lt;/p&gt;&lt;p&gt;Two people died in flooded New York City basements Thursday during a rainstorm that shut down roadways and caused airport delays, authorities said.&lt;/p&gt;&lt;p&gt;A scuba team recovered the body of a 39-year-old man after firefighters received a call of a person trapped in the flooded basement of a townhouse in Brooklyn at about 4.30pm, police said. A video posted online showed firefighters carrying the victim away through calf-deep water on the street.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/30/new-york-floods\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "More than half of Americans disapprove of Trump demolishing East Wing – poll",
      "url": "https://www.theguardian.com/us-news/2025/oct/30/americans-disapprove-trump-east-wing-poll",
      "summary": "&lt;p&gt;Survey, in which one-third respondents voted for the president, found 56% disagree with move&lt;/p&gt;&lt;p&gt;More than half of Americans disapprove of Trump’s demolition of the White House’s East Wing and the construction of a new ballroom, &lt;a href=\"https://www.washingtonpost.com/documents/1d305cca-df33-44a8-ba8d-c98790a67f99.pdf?itid=lk_inline_manual_2\"&gt;according to a new poll&lt;/a&gt; from the Washington Post, ABC News and Ipsos.&lt;/p&gt;&lt;p&gt;The survey was conducted between 24 and 28 October and indicates 56% of the respondents disagree with Trump’s recent move while 28% are in favor of it. Most of the survey’s respondents were white, one-third of them voted for Donald Trump and another third for Kamala Harris in the 2024 election.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/30/americans-disapprove-trump-east-wing-poll\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}