{
  "updatedAt": "2025-10-21T06:38:15.179Z",
  "items": [
    {
      "title": "G.O.P. Senators Oppose Trump Watchdog Nominee After Report of Racist Texts",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/paul-ingrassia-trump-senate.html",
      "summary": "At least four Republican senators, including the Senate majority leader, signaled their opposition to Paul Ingrassia, the president’s pick to lead the Office of Special Counsel."
    },
    {
      "title": "Biden Completes a Course of Radiation Therapy for Prostate Cancer",
      "url": "https://www.nytimes.com/2025/10/20/us/politics/biden-cancer-treatment-radiation-therapy.html",
      "summary": "Former President Joseph R. Biden Jr. began radiation therapy last month for an aggressive form of prostate cancer. It is unclear if his treatment has ended."
    },
    {
      "title": "Some States With Democratic Governors Are Posting Partisan Shutdown Messages on Official Websites",
      "url": "https://www.nytimes.com/2025/10/20/us/politics/shutdown-messages-state-websites.html",
      "summary": "The messages follow a pattern set by the Trump administration, but use notably milder language."
    },
    {
      "title": "Illinois Officials Ask Supreme Court to Keep Block on Trump’s Chicago Troop Deployment",
      "url": "https://www.nytimes.com/2025/10/20/us/politics/trump-national-guard-chicago.html",
      "summary": "A Supreme Court ruling, while technically temporary, could set the ground rules for National Guard deployments elsewhere in the country."
    },
    {
      "title": "Congressional Democrats Investigate Arrests of Americans During Raids",
      "url": "https://www.nytimes.com/2025/10/20/us/investigation-arrests-of-americans-ice-raids.html",
      "summary": "Representative Robert Garcia and Senator Richard Blumenthal started an inquiry to examine reports of misconduct by immigration agents, focusing on the arrests of citizens."
    },
    {
      "title": "All but 2 Universities Decline a Trump Offer of Preferential Funding",
      "url": "https://www.nytimes.com/2025/10/20/us/politics/universities-funding-compact.html",
      "summary": "One of the two, Vanderbilt University, signaled it had reservations."
    },
    {
      "title": "University of Arizona becomes seventh US college to reject Trump’s ‘compact’",
      "url": "https://www.theguardian.com/us-news/2025/oct/20/university-of-arizona-rejects-trump-compact",
      "summary": "&lt;p&gt;Administration has pushed nine universities to sign a deal that seeks to make changes in line with conservative ideas &lt;/p&gt;&lt;p&gt;The University of Arizona has become the seventh US university to reject a Trump administration proposal that would grant schools funding priority if they agreed to support the administration’s conservative agenda.&lt;/p&gt;&lt;p&gt;The decision follows the administration’s push for nine universities to sign a “Compact for Academic Excellence in Higher Education,” which seeks to make sweeping changes to campus culture, hiring and admissions practices and foreign student enrollment. Demands from the Trump administration’s 10-point compact include reforms to the way race or ethnicity are used in admission and hiring practices, as well as a commitment to strict definitions of gender, among others.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/20/university-of-arizona-rejects-trump-compact\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Body of missing woman found buried behind abandoned Philadelphia school",
      "url": "https://www.theguardian.com/us-news/2025/oct/20/philadelphia-missing-woman-body-kada-scott",
      "summary": "&lt;p&gt;Kada Scott was missing for two weeks before anonymous tip led police to wooded area with remains in shallow grave&lt;/p&gt;&lt;p&gt;Remains found buried in a wooded area behind an abandoned school are those of Kada Scott, a 23-year-old woman who had been missing for about two weeks, prosecutors in Philadelphia said on Monday.&lt;/p&gt;&lt;p&gt;Authorities said an anonymous tip led police back to the area they previously searched and they found the remains in a shallow grave. DNA tests confirmed her identity.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/20/philadelphia-missing-woman-body-kada-scott\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}