{
  "updatedAt": "2025-11-21T18:34:45.823Z",
  "items": [
    {
      "title": "Florida Sheriff’s Deputy Is Killed While Serving Eviction Notice",
      "url": "https://www.nytimes.com/2025/11/21/us/florida-deputy-shooting-vero-beach-bermuda-club.html",
      "summary": "A second deputy, a locksmith and the suspect were also shot in an exchange of gunfire, the authorities said."
    },
    {
      "title": "Trump and Saudi Crown Prince Had ‘Disturbing’ Call After Khashoggi’s Murder, Lawmaker Says",
      "url": "https://www.nytimes.com/2025/11/21/us/politics/trump-saudi-crown-prince-khashoggi.html",
      "summary": "Representative Eugene Vindman of Virginia said he reviewed a classified transcript of the 2019 conversation that would “shock” Americans."
    },
    {
      "title": "Trump to Hold Two Fund-Raisers for His Super PAC Next Year",
      "url": "https://www.nytimes.com/2025/11/21/us/politics/trump-super-pac-fundraisers.html",
      "summary": "A ticket will cost $1 million at each event."
    },
    {
      "title": "Jury Acquits Ohio Police Officer in Fatal Shooting of Pregnant Woman",
      "url": "https://www.nytimes.com/2025/11/21/us/connor-grubb-trial-pregnant-woman-killed.html",
      "summary": "Officer Connor Grubb was charged with murder and other offenses after he fired through the windshield of a moving car, killing Ta’Kiyah Young, 21, in August 2023."
    },
    {
      "title": "L.A. Charges Companies to Keep Names on Arenas for Olympics",
      "url": "https://www.nytimes.com/2025/11/21/us/los-angles-olympics-naming-rights.html",
      "summary": "Olympic organizers usually strip naming rights from host venues. Los Angeles is pioneering a new business model for the 2028 Games by charging sponsors extra fees instead."
    },
    {
      "title": "Trump’s All-but-Forgotten Border Wall Reaches an Angry Laredo, Texas",
      "url": "https://www.nytimes.com/2025/11/21/us/politics/trump-border-wall-laredo-texas.html",
      "summary": "Once the symbol of the president’s immigration policies, the wall has been eclipsed by his deportation efforts, but with $46.5 billion from Congress, construction is ramping up on the Rio Grande."
    },
    {
      "title": "Trump claims he’s ‘not threatening death’ for Democrats but says ‘they’re in serious trouble’ as he prepares to meet Mamdani – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/21/donald-trump-democrats-republicans-zohran-mamdani-us-politics-latest-news-updates",
      "summary": "&lt;p&gt;Chuck Schumer says Trump’s remarks amount to calls for ‘execution of elected officials’ as president also says he and Zohran Mamdani will ‘get along fine’ in meeting&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Robert Garcia&lt;/strong&gt;, the ranking member on the House oversight committee, has &lt;a href=\"https://oversightdemocrats.house.gov/sites/evo-subsites/democrats-oversight.house.gov/files/evo-media-document/2025-11-21.garcia-to-doj-re-epstein-subpoena-vs-act.pdf\"&gt;sent a letter&lt;/a&gt; to the US attorney general, &lt;strong&gt;Pam Bondi&lt;/strong&gt;, urging the justice department to release the complete trove of files related to Jeffrey Epstein, despite the newly launched investigation into several Democrats’ ties to the late sex offender.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;“There is already a concern President Trump will attempt, on dubious legal grounds, to exploit a provision which allows DoJ to withhold information relevant to ongoing investigations,”&lt;/strong&gt; Garcia wrote.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/21/donald-trump-democrats-republicans-zohran-mamdani-us-politics-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "New Mexico now offers free childcare for all. Here’s how parents and teachers made it happen",
      "url": "https://www.theguardian.com/us-news/2025/nov/21/new-mexico-universal-free-childcare-campaign",
      "summary": "&lt;p&gt;From marches and petitions to a constitutional amendment, a years-long campaign led to New Mexico becoming the first state in the US to offer universal childcare&lt;/p&gt;&lt;p&gt;One crisp morning in 2018, Sandra Ibarra pulled on a pair of gloves to ward off the winter chill and picked up the first cardboard sign she had designed for a protest.&lt;/p&gt;&lt;p&gt;As a recent immigrant to the United States, Ibarra was wary of attending a demonstration. But since arriving in the United States from Mexico she had had to change careers – it was difficult to recertify her licensing as an accountant in a new country and easier to begin working in childcare – and was shocked by the poor pay. Although she taught, cooked, cleaned and did the books for a small childcare center, she was earning minimum wage. A classmate at the local community college had suggested Ibarra attend the rally, and stick around afterward for a meal with Olé, a grassroots non-profit committed to organizing working-class families.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/21/new-mexico-universal-free-childcare-campaign\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}