{
  "updatedAt": "2025-09-24T18:46:41.889Z",
  "items": [
    {
      "title": "The D.C. Region Has Faced an Outsized Toll From Trump’s Policies",
      "url": "https://www.nytimes.com/2025/09/24/us/politics/trump-cuts-washington-dc.html",
      "summary": "With the mass layoffs and cancellations of thousands of federal grants and contracts, the region has taken a disproportionate hit."
    },
    {
      "title": "Wednesday’s shooting was the second at a Texas ICE facility this year.",
      "url": "https://www.nytimes.com/live/2025/09/24/us/dallas-ice-shooting/wednesdays-shooting-is-the-second-at-a-texas-ice-facility-this-year",
      "summary": "A police officer was shot in July outside a detention center in what prosecutors called an ambush."
    },
    {
      "title": "Agriculture Department Picks Ben Carson to Be a Policy Adviser",
      "url": "https://www.nytimes.com/2025/09/24/us/politics/ben-carson-policy-adviser.html",
      "summary": "He has endorsed the MAHA movement’s goals and agreeing with a policy allowing states to stop people from using food stamps for certain junk foods and soda."
    },
    {
      "title": "‘It was one shot after another after another after another.’",
      "url": "https://www.nytimes.com/2025/09/24/us/it-was-one-shot-after-another-after-another-after-another.html",
      "summary": ""
    },
    {
      "title": "Shutdown Crisis Tests Trump’s Go-It-Alone Approach to Democrats",
      "url": "https://www.nytimes.com/2025/09/24/us/politics/trump-democrats-government-shutdown.html",
      "summary": "The president has spent his first months in office freezing out Democrats, who have in turn opposed him routinely. Now they need each other to keep the government open."
    },
    {
      "title": "A Federal Shutdown May Be Imminent. How Would It Affect the Economy?",
      "url": "https://www.nytimes.com/2025/09/24/us/politics/government-shutdown-us-economy.html",
      "summary": "Congress and the White House have days to fund the government and avert a disruptive and potentially costly lapse in funding."
    },
    {
      "title": "Officials reportedly identify Dallas Ice facility shooter after two detainees killed – live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Joshua Jahn killed two detainees and severely injured another before taking his own life, NBC News reports, as DHS says another detainee in critical condition&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;Full report – &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/24/dallas-ice-shooting-texas-immigration-center-latest\"&gt;Three people shot at Texas Ice building&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;The Kremlin on Wednesday brushed off a comment by US president Donald Trump describing Russia as a “paper tiger”, and said president Vladimir Putin valued his efforts to resolve the Ukraine conflict.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Kremlin spokesperson Dmitry Peskov said that Russia was a bear, not a tiger, and “there is no such thing as a paper bear”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Rightwing podcasters run rampant with Charlie Kirk conspiracies: ‘It’s craven opportunism’",
      "url": "https://www.theguardian.com/us-news/2025/sep/24/charlie-kirk-conspiracies-rightwing-podcasters",
      "summary": "&lt;p&gt;After the Turning Point USA CEO’s killing, Candace Owens and other far-right stars are trying to persuade listeners of unfounded theories about Israel and federal involvement&lt;/p&gt;&lt;p&gt;Since Charlie Kirk’s killing, the rightwing podcast sphere has been in overdrive: eulogizing, grieving, praying, appointing blame and calling for retribution. Kirk’s podcast, The Charlie Kirk Show, now No 1 on the podcast charts, has had a rotating cast of hosts including Tucker Carlson, Glenn Beck, and JD Vance, who used his appearance to announce a crackdown on “far-left” groups, promising to “dismantle” them in Kirk’s name.&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/media/2025/mar/19/beyond-andrew-tate-the-imitators-who-help-promote-misogyny-online\"&gt;“Manosphere”&lt;/a&gt; mainstay Joe Rogan was initially quiet on the Kirk shooting, releasing pre-recorded episodes while he was away elk hunting. On Tuesday he began &lt;a href=\"https://x.com/triffic_stuff_/status/1970591314103136590\"&gt;challenging the official narrative of the killing&lt;/a&gt;, but has been more focused on the practicalities of the weapon used and the getaway than exploring the motivations of the killer, perhaps because Kirk was too much of an explicit rightwing partisan to chime with Rogan’s libertarianism.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/24/charlie-kirk-conspiracies-rightwing-podcasters\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}