{
  "updatedAt": "2025-09-07T13:03:12.126Z",
  "items": [
    {
      "title": "What We Know About the Hyundai-LG Plant Immigration Raid in Georgia",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/hyundai-plant-immigration-raid-georgia.html",
      "summary": "Several hundred workers, most of them South Korean nationals, were detained at the construction site of a sprawling electric vehicle battery plant on Thursday."
    },
    {
      "title": "Trump Tried to Kill the Infrastructure Law. Now He’s Getting Credit for Its Projects.",
      "url": "https://www.nytimes.com/2025/09/07/us/trump-infrastructure-signs.html",
      "summary": "Signs bearing President Trump’s name have gone up at major construction projects financed by the 2021 law, which he strenuously opposed ahead of its passage."
    },
    {
      "title": "In the Battle for Congress, Working-Class Democrats Try a Hardscrabble Pitch",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/in-the-battle-for-congress-working-class-democrats-try-a-hardscrabble-pitch.html",
      "summary": "A new crop of candidates has turned away from the aspirational “American dream” message of campaigns past and is leaning into how difficult life can be for working people — including them."
    },
    {
      "title": "‘If I Live to 25, I’ve Lived a Good Life’",
      "url": "https://www.nytimes.com/2025/09/07/us/wildfire-firefighter-cancer.html",
      "summary": "He started fighting wildfires as a teenager. After inhaling smoke on the front lines for six seasons, he faced an impossible choice."
    },
    {
      "title": "Trump Tramples Congress’s Power, With Little Challenge From G.O.P.",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/trump-congresss-power.html",
      "summary": "On national security, spending and oversight, the president continues to undercut the legislative branch, and Republicans in charge have done little to stop him."
    },
    {
      "title": "L.A.P.D. Stops Security Services for Kamala Harris",
      "url": "https://www.nytimes.com/2025/09/06/us/lapd-kamala-harris-security.html",
      "summary": "The department had assigned officers to protect the former vice president after her Secret Service detail was terminated. Some criticized the use of the officers."
    },
    {
      "title": "The ‘bizarre’ referral of the US housing finance agency chief to oust Lisa Cook",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/bill-pulte-fhfa-referral-mortgage-fraud-lisa-cook",
      "summary": "&lt;p&gt;Former officials and experts say Bill Pulte’s request for inquiry into Fed governor’s alleged fraud is ‘unusual’&lt;/p&gt;&lt;p&gt;The head of the Federal Housing Finance Agency embraced a highly unusual process to accuse Lisa Cook, a Federal Reserve governor, of committing mortgage fraud, former officials and experts have said. One former high-ranking official called the director’s involvement in a criminal referral “bizarre”.&lt;/p&gt;&lt;p&gt;William Pulte, a businessman and major GOP donor whom Donald Trump appointed to head the powerful housing agency earlier this year, &lt;a href=\"https://www.theguardian.com/us-news/2025/aug/24/trump-lawfare-mortgage-fraud-lisa-cook\"&gt;has accused&lt;/a&gt; Cook of committing mortgage fraud by misrepresenting her homes as a primary residence, potentially securing more favorable mortgage rates. The justice department formally opened a criminal investigation into whether Cook committed fraud and has issued subpoenas related to the transaction. Cook’s lawyers have called the discrepancies a “&lt;a href=\"https://www.theguardian.com/business/2025/sep/04/lisa-cook-federal-reserve-mortgage-investigation\"&gt;clerical error&lt;/a&gt;” and she has denied any wrongdoing.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/07/bill-pulte-fhfa-referral-mortgage-fraud-lisa-cook\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Texas attorney general wants students to pray in school – unless they’re Muslim",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/texas-ken-paxton-christians-muslims",
      "summary": "&lt;p&gt;Ken Paxton, who is running for US Senate, is urging schools to say the Lord’s Prayer as a Republican law goes into effect&lt;/p&gt;&lt;p&gt;Ken Paxton, the Texas attorney general running for US Senate, has long believed in school prayer. Now, he’s prescribing precisely what type of prayer he wants the state’s 6 million public school students to recite.&lt;/p&gt;&lt;p&gt;“In Texas classrooms, we want the Word of God opened, the Ten Commandments displayed, and prayers lifted up,” Paxton said in a &lt;a href=\"https://www.oag.state.tx.us/news/releases/attorney-general-ken-paxton-encourages-texas-schools-begin-legal-process-putting-prayer-back#:~:text=Attorney%20General%20Ken%20Paxton%20encourages%20all%20Texas%20schools%20to%20implement,11%20on%20September%201%2C%202025\"&gt;statement &lt;/a&gt;on Tuesday, encouraging students to say “the Lord’s Prayer, as taught by Jesus Christ”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/07/texas-ken-paxton-christians-muslims\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}