{
  "updatedAt": "2025-10-16T12:56:09.470Z",
  "items": [
    {
      "title": "What to Know About the California Special Election",
      "url": "https://www.nytimes.com/2025/10/16/us/california-election-redistricting-newsom.html",
      "summary": "Some 23 million voters have received mail ballots for the Nov. 4 election. The only statewide measure this fall is a redistricting plan spearheaded by Gov. Gavin Newsom."
    },
    {
      "title": "Chicagoans Resist I.C.E. Agents",
      "url": "https://www.nytimes.com/2025/10/16/us/chicago-ice-raids-ressit.html",
      "summary": "Immigration agents are using aggressive tactics. Residents of the sanctuary city are trying to resist them."
    },
    {
      "title": "Smucker’s Sues Trader Joe’s Over ‘Copycat’ Uncrustables",
      "url": "https://www.nytimes.com/2025/10/16/us/smuckers-sues-trader-joes-uncrustables.html",
      "summary": "It said in a lawsuit that the company was infringing on multiple trademarks it held, including one for a “round pie-like shape with distinct peripheral undulated crimping.”"
    },
    {
      "title": "Faulty Engineering Among Causes of Titan Submersible Implosion, NTSB Concludes",
      "url": "https://www.nytimes.com/2025/10/16/us/titan-submersible-implosion-cause-ntsb-investigation.html",
      "summary": "Federal investigators blamed experimental designs, undetected damage and construction flaws for the death of all five people aboard the submersible headed to the Titanic wreckage."
    },
    {
      "title": "Ten Inmates Escaped From a New Orleans Jail. Derrick Groves Stood Out.",
      "url": "https://www.nytimes.com/2025/10/16/us/new-orleans-prison-escape.html",
      "summary": "In May, 10 inmates escaped from a jail in New Orleans, highlighting the facility’s chronic problems. Derrick Groves was at large for months."
    },
    {
      "title": "A Military Celebration Sparks Another Newsom-Trump Feud",
      "url": "https://www.nytimes.com/2025/10/16/us/politics/newsom-military-celebration-camp-pendleton.html",
      "summary": "Gov. Gavin Newsom had feared that the ceremony would send missiles over Interstate 5, but the Marines later said that its “live-fire” would be contained."
    },
    {
      "title": "Top Senate Republican says he can ‘guarantee’ a vote on key healthcare provision amid shutdown standoff – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
      "summary": "&lt;p&gt;Senate majority leader there will be a vote on Obamacare subsidies, as Democrats have demanded, but ‘can’t guarantee it’s going to pass’&lt;/p&gt;&lt;p&gt;Donald Trump is at the White House today, per his official schedule.&lt;/p&gt;&lt;p&gt;He will receive his intelligence briefing at 11am ET, but &lt;strong&gt;we won’t hear from him until 3pm ET – when he’s set to make an announcement in the Oval Office&lt;/strong&gt;.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Americans say their monthly costs have risen by between $100 and $749, according &lt;a href=\"https://www.theguardian.com/business/2025/oct/16/inflation-economic-pessimism-poll\"&gt;to an exclusive new poll&lt;/a&gt; conducted for the Guardian.&lt;/strong&gt; When asked to estimate how much their regular monthly household costs have increased from last year, 74% of those surveyed said they had seen increases of at least $100, according to the poll.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Vice-president JD Vance&lt;/strong&gt; sought to downplay the revelation that leaders of a group called the Young Republicans exchanged hundreds of racist, sexist text messages. &lt;strong&gt;“The reality is that kids do stupid things, especially young boys,” Vance said in a new episode of the Charlie Kirk Show.&lt;/strong&gt; “They tell edgy, offensive jokes. That’s what kids do.”&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Donald Trump&lt;/strong&gt; suggested on Wednesday that &lt;strong&gt;San Francisco could be the next city he targets with federal troops,&lt;/strong&gt; threatening a deployment that local and state officials have said is &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/15/san-francisco-trump-national-guard-troops\"&gt;unnecessary and unwelcome&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Former Bush adviser charged with amassing top secret files",
      "url": "https://www.theguardian.com/us-news/2025/oct/16/indian-born-former-george-w-bush-adviser-ashley-tellis-accused-of-amassing-top-secret-files",
      "summary": "&lt;p&gt;Indian-born academic Ashley Tellis allegedly obtained military data and passed envelopes to Chinese officials&lt;/p&gt;&lt;p&gt;A prominent Indian-American academic and former US government adviser has been arrested and charged with the unlawful detention of national security information, including thousands of pages of top secret documents that were found at his home.&lt;/p&gt;&lt;p&gt;Ashley Tellis, 64, who served on the national security council of the former US president George W Bush and is credited for helping to negotiate &lt;a href=\"https://www.theguardian.com/world/2006/mar/02/india.usa\"&gt;the US-India nuclear deal&lt;/a&gt;, was arrested and charged over the weekend.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/16/indian-born-former-george-w-bush-adviser-ashley-tellis-accused-of-amassing-top-secret-files\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}