{
  "updatedAt": "2025-11-20T06:38:48.132Z",
  "items": [
    {
      "title": "House Votes to Kill Bill Allowing Senators to Sue Government",
      "url": "https://www.nytimes.com/2025/11/19/us/politics/house-votes-to-kill-bill-allowing-senators-to-sue-government.html",
      "summary": "The measure has prompted a backlash, but the top Senate Republican appeared inclined to preserve it, arguing that it would protect the body against investigatory overreach."
    },
    {
      "title": "Florida Lawmaker Stole FEMA Funds for House Campaign, Prosecutors Say",
      "url": "https://www.nytimes.com/2025/11/19/us/cherfilus-mccormick-fema-florida-indictment.html",
      "summary": "Representative Sheila Cherfilus-McCormick misused $5 million in Covid-related funds during the pandemic in part to finance her campaign, according to the Justice Department."
    },
    {
      "title": "Larry Summers to Stop Teaching at Harvard While It Investigates His Epstein Ties",
      "url": "https://www.nytimes.com/2025/11/19/us/larry-summers-harvard-epstein.html",
      "summary": "The former Harvard president had previously stepped down from other positions following revelations about his longtime connections to Jeffrey Epstein."
    },
    {
      "title": "Why Does Trump, the ‘America First’ President, Keep Looking to Foreign Leaders?",
      "url": "https://www.nytimes.com/2025/11/19/us/politics/trump-america-first-saudi-tariffs.html",
      "summary": "Trump keeps showing he is not as isolationist as many supporters had hoped."
    },
    {
      "title": "Stalled Contempt Inquiry Into Deportation Flights Springs Back to Life",
      "url": "https://www.nytimes.com/2025/11/19/us/politics/contempt-inquiry-deportation-flights.html",
      "summary": "The resurrected inquiry could finally get to the bottom of lingering questions such as: Did top Trump administration officials purposely ignore a court order?"
    },
    {
      "title": "Appeals Court Blocks Limits on Federal Agents’ Use of Force in Chicago Area",
      "url": "https://www.nytimes.com/2025/11/19/us/chicago-immigration-ruling.html",
      "summary": "A judge found that immigration agents were using force in a way that “shocks the conscience.” Appellate judges said the restrictions she imposed went too far."
    },
    {
      "title": "Trump and Mamdani to meet in Oval Office on Friday after months of bickering",
      "url": "https://www.theguardian.com/us-news/2025/nov/20/donald-trump-zohran-mamdani-nyc-mayor-elect-meeting",
      "summary": "&lt;p&gt;President has previously criticised the New York City mayor-elect, labelling him a ‘communist’ and threatening to deport him&lt;/p&gt;&lt;p&gt;Donald Trump has confirmed a long-awaited meeting with New York City mayor-elect Zohran Mamdani will happen in Washington this week, setting up an in-person clash between the political opposites who for months have antagonised each other.&lt;/p&gt;&lt;p&gt;The sit-down, which Trump said on social media would take place on Friday in the Oval Office, could possibly represent a detente of sorts between the Republican president and Democratic rising star.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/20/donald-trump-zohran-mamdani-nyc-mayor-elect-meeting\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump says he signed bill to release Epstein files, then announces meeting with Zohran Mamdani – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/19/us-congress-epstein-files-donald-trump-saudi-arabia-redistricting-latest-news-updates",
      "summary": "&lt;p&gt;This live blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/19/trump-news-at-a-glance-latest-updates-today\"&gt;Trump news at a glance: president signs bill to release more Epstein documents&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;One quick note, &lt;strong&gt;there haven’t been any changes to Donald Trump’s schedule today, per the press pool&lt;/strong&gt;. Which means, as of now, the president doesn’t have any time allotted to sign the bill forcing the justice department to release the full batch of Jeffrey Epstein files.&lt;/p&gt;&lt;p&gt;We’ll keep you updated if things change throughout the day.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/19/us-congress-epstein-files-donald-trump-saudi-arabia-redistricting-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}