{
  "updatedAt": "2025-09-16T18:48:21.898Z",
  "items": [
    {
      "title": "Former C.D.C. Director to Tell Lawmakers She Was ‘Fired for Holding the Line’",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/cdc-monarez-testimony-rfk.html",
      "summary": "Susan Monarez is set to provide her first detailed account of her ouster in testimony before the Senate Health Committee on Wednesday."
    },
    {
      "title": "LimeWire, the Former File-Sharing Service, Is Buying Fyre Festival Brand",
      "url": "https://www.nytimes.com/2025/09/16/us/limewire-crypto-fyre-festival.html",
      "summary": "The streaming service, which became popular in the 2000s, paid $245,000 for the festival naming rights. It’s unclear what exactly it plans to do with the embattled brand."
    },
    {
      "title": "Mary Rose Oakar, 85, First Arab American Woman in Congress, Dies",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/mary-rose-oakar-dead.html",
      "summary": "In her 16 years on Capitol Hill, she emerged as a champion of women’s rights, especially equal pay for comparable work."
    },
    {
      "title": "Johnson Releases Spending Bill, Daring Democrats to Oppose It",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/johnson-government-shutdown.html",
      "summary": "The speaker put forward a stopgap bill to fund the government past Sept. 30, saying there was “zero chance” he would add concessions Democrats have demanded."
    },
    {
      "title": "Man Falsely Confessed to Kirk Shooting to Help Assassin Escape, Police Say",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/false-confession-kirk-shooting-suspect-escape.html",
      "summary": "Moments after Charlie Kirk was killed, a 71-year-old man told an officer, “I shot him,” the police said. It wasn’t true, but it delayed officers’ efforts to find the shooter."
    },
    {
      "title": "‘It was me,’ Discord says the accused Kirk shooter wrote on the network.",
      "url": "https://www.nytimes.com/live/2025/09/16/us/kirk-shooting-suspect-charges/it-was-me-discord-says-accused-kirk-shooter-wrote-on-network",
      "summary": ""
    },
    {
      "title": "Charlie Kirk shooting suspect charged with aggravated murder; prosecutors will seek death penalty – live updates",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live",
      "summary": "&lt;p&gt;Utah attorney details charges against Tyler Robinson, who is accused of fatally shooting Charlie Kirk; suspect will be held without bail as prosecution seeks death penalty&lt;/p&gt;&lt;p&gt;Under-fire FBI director Kash Patel will confront Senate Democrats at a congressional hearing &lt;strong&gt;at 9am ET&lt;/strong&gt;, likely to be dominated by questions about the investigation into the killing of Charlie Kirk, as well as the agency’s role in reviewing the files related to the Epstein case, and recent firings of senior officials who have accused Patel of illegal political retribution.&lt;/p&gt;&lt;p&gt;His appearance before the Senate judiciary committee represents the first oversight hearing of Patel’s young but tumultuous tenure. Most recently &lt;strong&gt;he has faced &lt;a href=\"https://www.nbcnews.com/politics/justice-department/kash-patel-criticized-actions-posts-charlie-kirk-shooting-investigatio-rcna231043\"&gt;criticism&lt;/a&gt; for his actions and social media posts during the Kirk shooting investigation&lt;/strong&gt;, which have raised questions about his experience and judgement, including being seen as “grandstanding” with regards to his own role, and prematurely (and wrongly) announcing on X that the suspect had been caught.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump has fanned the flames of divisive politics around the world, says Sadiq Khan",
      "url": "https://www.theguardian.com/us-news/2025/sep/16/trump-has-fanned-the-flames-of-divisive-politics-around-the-world-says-sadiq-khan",
      "summary": "&lt;p&gt;Exclusive: London mayor says US president has ‘perhaps done the most’ to encourage far right&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/commentisfree/2025/sep/16/far-right-march-londoners-donald-trump-politics\"&gt;Londoners must show Trump we reject his politics of fear | Sadiq Khan&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Donald Trump will arrive in the UK on Tuesday night to a barrage of criticism from Sadiq Khan, the mayor of London, who has accused the US president of doing more than anyone else to encourage the intolerant far right across the globe.&lt;/p&gt;&lt;p&gt;In what will be considered to be a direct challenge to Keir Starmer’s government to take a more robust stance towards Trump, Khan said the president’s use of the military in cities and targeting of minorities was “straight out of the autocrat’s playbook”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/16/trump-has-fanned-the-flames-of-divisive-politics-around-the-world-says-sadiq-khan\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}