{
  "updatedAt": "2025-09-25T18:51:09.671Z",
  "items": [
    {
      "title": "Google Asks Supreme Court to Intervene in Dispute With Fortnite Creator",
      "url": "https://www.nytimes.com/2025/09/25/us/politics/google-supreme-epic-games.html",
      "summary": "The case could rewrite the rules on how businesses make money on Google’s smartphone operating system."
    },
    {
      "title": "Hegseth Is Said to Have Summoned U.S. Military Brass From Around the Globe",
      "url": "https://www.nytimes.com/2025/09/25/us/politics/hegseth-generals-admirals-summoned.html",
      "summary": "The unusual directive, without a stated reason, came after the defense secretary has fired several top officers and ordered a reduction in four-star officers."
    },
    {
      "title": "Sara Jane Moore, Would-Be Assassin of President Ford, Dies at 95",
      "url": "https://www.nytimes.com/2025/09/25/us/sara-jane-moore-dead.html",
      "summary": "A mother of four on the fringes of radical leftist movements, she fired at the president outside a San Francisco hotel in 1975. She had hoped to spark a revolution, she said."
    },
    {
      "title": "Wyden Presses JPMorgan Chief Dimon for Answers on Jeffrey Epstein",
      "url": "https://www.nytimes.com/2025/09/25/us/politics/jpmorgan-jeffrey-epstein-dimon-wyden.html",
      "summary": "Senator Ron Wyden, Democrat of Oregon, sent a list of questions to Jamie Dimon, head of the country’s biggest bank, about its financial relationships with Mr. Epstein, the convicted sex offender."
    },
    {
      "title": "Justice Dept. Official Pushes Prosecutors to Investigate George Soros’s Foundation",
      "url": "https://www.nytimes.com/2025/09/25/us/politics/justice-trump-george-soros-foundation.html",
      "summary": "The directive suggests department leaders are following orders from the president, a major break from decades of past practice meant to insulate the agency from political interference."
    },
    {
      "title": "White House Threat of Federal Layoffs Only Deepens Shutdown Impasse",
      "url": "https://www.nytimes.com/2025/09/25/us/politics/democrats-government-shutdown-layoffs-threats.html",
      "summary": "Democratic leaders said the administration’s plan to fire government workers in the event of a shutdown would not prompt them to drop their demands in their spending standoff with the G.O.P."
    },
    {
      "title": "Trump claims rise in political violence is ‘radical left causing this problem, not the right’ – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
      "summary": "&lt;p&gt;President again jumped to blame political opponents after three detainees were shot in attack on immigration facility &lt;/p&gt;&lt;p&gt;&lt;strong&gt;Dozens of House &lt;a href=\"https://www.theguardian.com/us-news/democrats\"&gt;Democrats&lt;/a&gt; have signed a letter to &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; and secretary of state &lt;a href=\"https://www.theguardian.com/us-news/marco-rubio\"&gt;Marco Rubio&lt;/a&gt;, urging the administration to recognize Palestinian statehood.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The letter, led by &lt;a href=\"https://www.theguardian.com/us-news/california\"&gt;California&lt;/a&gt; Democrat Ro Khanna, has 46 signatures, and lawmakers will send it to the US president on Friday, &lt;strong&gt;according to plans first provided to the Guardian&lt;/strong&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US authorities remove Trump-Epstein statue from National Mall",
      "url": "https://www.theguardian.com/us-news/2025/sep/25/trump-epstein-statue-dc-removed",
      "summary": "&lt;p&gt;Interior department says National Park Service removed statue of pair holding hands because of incorrect permit&lt;/p&gt;&lt;p&gt;An &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/23/national-mall-trump-epstein-statue\"&gt;impromptu statue&lt;/a&gt; of Donald Trump and &lt;a href=\"https://www.theguardian.com/us-news/jeffrey-epstein\"&gt;Jeffrey Epstein&lt;/a&gt; holding hands was unceremoniously removed from the National Mall in Washington just a day after a group of anonymous artists erected it there.&lt;/p&gt;&lt;p&gt;The piece showed the president and the late convicted sex offender, who were friends in the past, looking joyful together, with wide grins and feet kicked back.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/25/trump-epstein-statue-dc-removed\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}