{
  "updatedAt": "2025-11-28T12:56:07.357Z",
  "items": [
    {
      "title": "‘Hey, Lemonade!’: A Backstage Fixture at the Grand Ole Opry",
      "url": "https://www.nytimes.com/2025/11/28/us/politics/hey-lemonade-a-backstage-fixture-at-the-grand-ole-opry.html",
      "summary": "Legions of backstage workers have helped the Grand Ole Opry thrive for a century in Nashville. Diana McBride is known for her lemonade — and much more."
    },
    {
      "title": "National Guard Soldier Dies After Being Shot in Washington",
      "url": "https://www.nytimes.com/2025/11/28/us/national-guard-shooting-washington.html",
      "summary": "Another Guard member was in critical condition. The suspect is an Afghan man who once served in a paramilitary unit that worked with U.S. forces, officials said."
    },
    {
      "title": "Trump Uses National Guard Shooting to Cast Suspicion on Refugees",
      "url": "https://www.nytimes.com/2025/11/27/us/politics/trump-national-guard-shooting.html",
      "summary": "President Trump claimed there were “a lot of problems with Afghans,” without providing evidence, as his administration announced that it was implementing new immigration guidelines."
    },
    {
      "title": "For Shooting Suspect, a Long Path of Conflict From Afghanistan to America",
      "url": "https://www.nytimes.com/2025/11/27/us/guard-shooting-suspect-profile.html",
      "summary": "Rahmanullah Lakanwal was among the Afghans who came to the United States after the Taliban takeover of Afghanistan. Earlier, he served in a paramilitary unit that worked with U.S. forces."
    },
    {
      "title": "Recent Afghan Arrivals Fear Their Futures in the U.S. Are Now in Jeopardy",
      "url": "https://www.nytimes.com/2025/11/27/us/politics/afghans-immigrants-fearful-guard-shooting.html",
      "summary": "Many are anxious after the Trump administration vowed to undertake sweeping reviews of immigrants after the shooting of two National Guard troops."
    },
    {
      "title": "SNAP Helping Families Put Thanksgiving Dinner on the Table",
      "url": "https://www.nytimes.com/2025/11/27/us/politics/snap-benefits-trump-thanksgiving.html",
      "summary": "SNAP benefits helped Leanna Nieves of Haverhill, Mass., buy Thanksgiving dinner for her family, but she used the day to set aside what have been chronic worries about the federal program."
    },
    {
      "title": "First Thing: Trump says he will ‘permanently pause’ migration from ‘third world countries’ after national guard shooting",
      "url": "https://www.theguardian.com/us-news/2025/nov/28/first-thing-trump-says-he-will-permanently-pause-migration-from-third-world-countries-after-national-guard-shooting",
      "summary": "&lt;p&gt;President’s remarks followed the death of Sarah Beckstrom, one of the two guard members shot. Plus, Palestinian-American 16-year-old released after nine months in Israeli jail&lt;/p&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;Donald Trump has said he will &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/28/trump-says-he-will-permanently-pause-migration-from-third-world-countries-after-national-guard-shooting\"&gt;“permanently pause migration from all third world countries”&lt;/a&gt;, a day after two national guard members were shot in Washington DC in an attack that authorities suspect was carried out by an Afghan national.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What do we know about the other guard member?&lt;/strong&gt; Andrew Wolfe, 24, is still fighting for his life, according to the president.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What does Trump mean by &lt;/strong&gt;&lt;strong&gt;‘third world&lt;/strong&gt;&lt;strong&gt;’?&lt;/strong&gt; He did not identify the countries he intended to target or specify what he meant by the phrase.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What has Warren said about Staley?&lt;/strong&gt; She said he allegedly protected Epstein’s access to the banking system while working at JP Morgan in the early 2000s.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/28/first-thing-trump-says-he-will-permanently-pause-migration-from-third-world-countries-after-national-guard-shooting\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "National guard soldier Sarah Beckstrom has died after Washington DC shooting – Trump",
      "url": "https://www.theguardian.com/us-news/2025/nov/28/national-guard-member-sarah-beckstrom-has-died-after-shooting-in-washington-dc-trump-announces",
      "summary": "&lt;p&gt;One other member of the guards, Andrew Wolfe, is still ‘fighting for his life’, according to the president&lt;/p&gt;&lt;p&gt;One of two US national guard soldiers shot in a targeted attack near the White House this week has died, while the second is fighting for his life, Donald Trump has announced.&lt;/p&gt;&lt;p&gt;As part of his Thanksgiving call to US troops late on Thursday, the US president said he had been informed that Sarah Beckstrom, 20, had succumbed to her wounds.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/28/national-guard-member-sarah-beckstrom-has-died-after-shooting-in-washington-dc-trump-announces\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}