{
  "updatedAt": "2025-09-28T18:31:35.766Z",
  "items": [
    {
      "title": "Abrego Garcia Moved to Detention Center in Pennsylvania",
      "url": "https://www.nytimes.com/2025/09/28/us/politics/abrego-garcia-detention-center-pennsylvania.html",
      "summary": "Kilmar Armando Abrego Garcia, the man sent to El Salvador in violation of a court order, was transferred from an immigration facility in Virginia, his lawyers said Friday."
    },
    {
      "title": "Shooting at Mormon Church in Grand Blanc, Michigan, Leaves Multiple Injured",
      "url": "https://www.nytimes.com/live/2025/09/28/us/grand-blanc-shooting-church-michigan/grand-blanc-shooting-fire-mormon-church",
      "summary": "The police said that multiple people had been injured"
    },
    {
      "title": "Trump Plans to Attend Gathering of U.S. Military Officers",
      "url": "https://www.nytimes.com/2025/09/28/us/politics/trump-hegseth-military.html",
      "summary": "Defense Secretary Pete Hegseth summoned hundreds of generals and admirals from around the world for an unusual gathering."
    },
    {
      "title": "Trump to Meet With Congressional Leaders, Aides Say, as Shutdown Deadline Looms",
      "url": "https://www.nytimes.com/2025/09/28/us/politics/schumer-jeffries-trump-shutdown.html",
      "summary": "Lawmakers face a Tuesday deadline to fund the government, which will require them to agree on a spending measure that can win at least 60 votes in the Senate."
    },
    {
      "title": "With Scant Information, Federal Workers Brace for Possible Shutdown",
      "url": "https://www.nytimes.com/2025/09/28/us/politics/federal-government-shutdown-trump.html",
      "summary": "After a tumultuous year of staffing cuts, government employees now face the prospect of going without pay — or facing even more layoffs."
    },
    {
      "title": "N.C. Stabbing Suspect Had Many Interactions With Police and Little Treatment",
      "url": "https://www.nytimes.com/2025/09/28/us/nc-stabbing-suspect-police-mental-health-history.html",
      "summary": "Decarlos Brown Jr. had harbored paranoid delusions for years, yet under state law he was not considered dangerous enough to be treated against his will."
    },
    {
      "title": "Eric Adams drops out of New York City mayoral race",
      "url": "https://www.theguardian.com/us-news/2025/sep/28/eric-adams-drops-out-new-york-mayor-race",
      "summary": "&lt;p&gt;New York City mayor abandons faltering bid to win re-election in social media video set to strains of song My Way&lt;/p&gt;&lt;p&gt;The mayor of New York City, Eric Adams, announced on Sunday that he is abandoning his faltering bid to win re-election, just over a month before election day, delivering the message in &lt;a href=\"https://x.com/ericadamsfornyc/status/1972348511892262962\"&gt;a social media video&lt;/a&gt; set to the strains of My Way.&lt;/p&gt;&lt;p&gt;Adams, who was trailing in the polls, was elected as a &lt;a href=\"https://www.theguardian.com/us-news/democrats\"&gt;Democrat&lt;/a&gt; but ran for re-election as an independent after he was indicted on federal corruption charges, which were &lt;a href=\"https://www.theguardian.com/us-news/2025/apr/02/eric-adams-corruption-case-dismissed\"&gt;then dropped&lt;/a&gt; by the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; in exchange for his cooperation on immigration raids.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/28/eric-adams-drops-out-new-york-mayor-race\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Illinois senator demands to meet with Ice amid clashes at immigration facility",
      "url": "https://www.theguardian.com/us-news/2025/sep/28/dick-durbin-illinois-ice-immigration-meeting",
      "summary": "&lt;p&gt;Dick Durbin renews push to talk to Trump officials as operations and protests escalate at Broadview facility&lt;/p&gt;&lt;p&gt;After days of clashes between federal officers and protesters at an immigration jail in his home state of &lt;a href=\"https://www.theguardian.com/us-news/illinois\"&gt;Illinois&lt;/a&gt;, Democratic US senator Dick Durbin on Sunday renewed demands to meet with &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; immigration officials.&lt;/p&gt;&lt;p&gt;Durbin &lt;a href=\"https://x.com/SenatorDurbin/status/1972297075493851476\"&gt;wrote on X&lt;/a&gt; that Immigration and Customs Enforcement (&lt;a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\"&gt;Ice&lt;/a&gt;) must be “accountable for its actions” amid the administration’s “cruel immigration crackdown”. The post on Sunday morning came after Saturday night protests and arrests at an immigration detention center in Broadview, Illinois.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/28/dick-durbin-illinois-ice-immigration-meeting\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}