{
  "updatedAt": "2025-09-15T18:49:21.267Z",
  "items": [
    {
      "title": "F.B.I. Burns Methamphetamine Near Animal Shelter, Sickening Workers and Pets",
      "url": "https://www.nytimes.com/2025/09/15/us/montana-animal-shelter-fbi-meth-smoke.html",
      "summary": "More than 70 cats and dogs were evacuated and 14 workers at an animal shelter in Montana were treated for smoke inhalation from incinerated methamphetine."
    },
    {
      "title": "2 Men Arrested After Incendiary Device Is Found Under a News Vehicle in Utah",
      "url": "https://www.nytimes.com/2025/09/15/us/utah-explosive-device-threat-fox-13-arrest.html",
      "summary": "The incendiary device, found beneath a Salt Lake City television station’s vehicle, failed to detonate. The two men face terrorism and arson charges."
    },
    {
      "title": "In Giant Deals, U.A.E. Got Chips, and Trump Team Got Crypto Riches",
      "url": "https://www.nytimes.com/2025/09/15/us/politics/trump-uae-chips-witkoff-world-liberty.html",
      "summary": "A lucrative transaction involving the Trump family’s cryptocurrency firm and an agreement giving the Emiratis access to A.I. chips were connected in ways that have not been previously reported."
    },
    {
      "title": "A Times Investigation Into Trump, UAE and 2 Giant Deals: 5 Takeaways",
      "url": "https://www.nytimes.com/2025/09/15/us/politics/trump-uae-chips-witkoff-world-liberty-takeaways.html",
      "summary": "A $2 billion crypto deal and an agreement to sell valuable chips to the United Arab Emirates were intertwined in ways that have not been previously reported."
    },
    {
      "title": "Trump’s D.C. Show of Force Diverts Agents and Prosecutors From Casework",
      "url": "https://www.nytimes.com/2025/09/15/us/politics/trump-dc-crackdown-fbi-prosecutors.html",
      "summary": "While crime falls, the other investigative work of the F.B.I. is being delayed, frustrating law enforcement officials and leading some to quit."
    },
    {
      "title": "FBI Head Says Note and DNA Link Suspect to Charlie Kirk Killing",
      "url": "https://www.nytimes.com/2025/09/15/us/charlie-kirk-patel-dna.html",
      "summary": "In a TV interview, Kash Patel, the director of the F.B.I., said investigators had found physical evidence connecting the suspected gunman with the fatal shooting of Charlie Kirk in Utah."
    },
    {
      "title": "Trump aide Stephen Miller vows to ‘destroy’ what he claims is ‘domestic terror movement’ after Charlie Kirk killing – live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
      "summary": "&lt;p&gt;White House deputy chief of staff joins JD Vance on Kirk’s podcast to threaten retribution for death of rightwing activist as motive for attack remains unclear&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/15/dna-evidence-charlie-kirk-shooter\"&gt;DNA evidence links suspect to killing of Charlie Kirk, FBI director says&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Secretary of state Marco Rubio will travel to Qatar on Tuesday&lt;/strong&gt;, the Washington Post is reporting, after holding talks with Benjamin Netanyahu today in Israel.&lt;/p&gt;&lt;p&gt;As my colleague &lt;strong&gt;Julian Borger&lt;/strong&gt; &lt;a href=\"https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas\"&gt;writes&lt;/a&gt;: “Part of [Rubio’s] mission on this two-day visit is &lt;strong&gt;to&lt;/strong&gt; &lt;strong&gt;convey&lt;/strong&gt; &lt;strong&gt;Donald Trump&lt;/strong&gt;’s &lt;strong&gt;irritation at the Israeli missile strike on Doha&lt;/strong&gt; that was aimed at &lt;a href=\"https://www.theguardian.com/world/hamas\"&gt;Hamas&lt;/a&gt; leadership but killed their aides and a Qatari security officer.&lt;/p&gt;&lt;p&gt;&lt;em&gt;Common sense dictates that drone technology should be harnessed to scan every elevated structure with a line of sight to a target.&lt;/em&gt;&lt;/p&gt;&lt;p&gt;&lt;em&gt;If drones can enable the early detection and prevention of assassination attempts, why not use them? Better to have vigilant eyes in the sky than to remain blind to would-be assassins.&lt;/em&gt;&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Election deniers now hold posts on local US election boards, raising concerns for midterms",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/election-deniers-midterms-board-offices",
      "summary": "&lt;p&gt;‘Election integrity’ activists have found way to positions of power, raising red flags about potential partisan meddling&lt;/p&gt;&lt;p&gt;A number of people who deny the legitimacy of the 2020 election, and often of other elections in which Republicans have not been victorious, have been elevated to positions of power since Donald Trump’s re-election, raising concerns about the potential for partisan meddling in critical parts of the country like Arizona and Georgia.&lt;/p&gt;&lt;p&gt;State by state, activists aligned with the “election integrity” movement have found their way on to local elections boards and elections offices, raising red flags for Democrats who have already started efforts to have them removed.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/15/election-deniers-midterms-board-offices\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}