{
  "updatedAt": "2025-11-05T18:38:02.276Z",
  "items": [
    {
      "title": "Redistricting Battles, Set Off by Trump, Have Few Parallels in U.S. History",
      "url": "https://www.nytimes.com/2025/11/05/us/elections/gerrymandering-redistricting-democrats-republicans.html",
      "summary": "First, Texas redistricted. Other states followed, and now California. Some legal experts say it’s a crisis: “The wheels are coming off the car right now.”"
    },
    {
      "title": "Interior Department Pauses Plans for Layoffs Amid Shutdown",
      "url": "https://www.nytimes.com/2025/11/05/us/politics/interior-department-layoffs-paused-shutdown.html",
      "summary": "The agency had been planning to eliminate more than 2,000 positions before the lapse in federal funding, but a federal judge blocked the move."
    },
    {
      "title": "In the Trump Era, Cheney’s Brand of Conservatism Became Obsolete",
      "url": "https://www.nytimes.com/2025/11/05/us/politics/cheney-trump-brand-conservatism.html",
      "summary": "Dick Cheney was once the face of hard-line conservatism. Then hard-line conservatism changed."
    },
    {
      "title": "Where Things Stand With SNAP Benefits",
      "url": "https://www.nytimes.com/video/us/politics/100000010491315/where-things-stand-with-snap-benefits.html",
      "summary": "Millions of low-income Americans will see staggering cuts and delays to their food stamps this month due to the government shutdown. Tony Romm, an economic policy reporter at The New York Times, walks us through the last several weeks of chaos around SNAP benefits."
    },
    {
      "title": "Jacob Frey Wins Third Term as Minneapolis Mayor",
      "url": "https://www.nytimes.com/2025/11/05/us/jacob-frey-minneapolis-mayor.html",
      "summary": "The race for Minneapolis mayor tested the appeal of democratic socialist policies, drawing comparisons to Zohran Mamdani’s mayoral bid in New York City."
    },
    {
      "title": "Emergency Workers Search Scene of Deadly UPS Crash in Louisville",
      "url": "https://www.nytimes.com/2025/11/05/us/ups-plane-crash-louisville.html",
      "summary": "At least nine people died after a cargo jet plunged to the ground shortly after taking off for a flight to Hawaii. The death toll could rise."
    },
    {
      "title": "‘Tariffs are taxes’: US supreme court hears challenge to Trump levies as justices appear doubtful of White House reasoning – live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/05/zohran-mamdani-new-york-nyc-donald-trump-mayor-election-california-new-jersey-virginia-latest-news-results",
      "summary": "&lt;p&gt;Both conservative and liberal US supreme court justices have voiced skepticism over the Trump administration’s justification for tariffs&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/04/trump-tariffs-supreme-court-oral-arguments\"&gt;US supreme court appears skeptical over legality of Trump tariffs&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Here’s a look at some of the pictures from New York, as Zohran Mamdani was elected the next mayor of the city.&lt;/p&gt;&lt;p&gt;In a short while, we’ll hear from &lt;strong&gt;Donald Trump&lt;/strong&gt; when he hosts a breakfast with Republican senators at the White House. As we noted earlier, the president had choice words about Mamdani’s victory in New York, and other Democratic wins across the country – including the gubernatorial races in Virginia and New Jersey.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/05/zohran-mamdani-new-york-nyc-donald-trump-mayor-election-california-new-jersey-virginia-latest-news-results\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Minneapolis mayor Jacob Frey fends off progressive challengers to win third term",
      "url": "https://www.theguardian.com/us-news/2025/nov/05/minneapolis-mayoral-election-results",
      "summary": "&lt;p&gt;The ranked-choice election went into a second round of tabulations, putting him ahead of state senator Omar Fateh&lt;/p&gt;&lt;p&gt;Minneapolis mayor Jacob Frey fended off progressive challengers on Tuesday to win his third term to lead the city.&lt;/p&gt;&lt;p&gt;The ranked-choice election went into a second round of tabulations after no candidate topped 50% in the first round. Frey gained more second-round votes, putting him ahead of Omar Fateh, a state senator who challenged Frey from the left, &lt;a href=\"https://x.com/VoteMpls/status/1986125347428180150\"&gt;according to&lt;/a&gt; Minneapolis Elections and Voter Services.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/05/minneapolis-mayoral-election-results\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}