{
  "updatedAt": "2025-11-15T12:50:19.933Z",
  "items": [
    {
      "title": "Once He Was ‘Just Asking Questions.’ Now Tucker Carlson Is the Question.",
      "url": "https://www.nytimes.com/2025/11/15/us/politics/tucker-carlson-fuentes.html",
      "summary": "The conservative commentator has further fractured the right with his anti-Israel rhetoric and sympathy for a white nationalist. He’s not in the mood to apologize."
    },
    {
      "title": "Waymo Was on a Roll in San Francisco. Then One of Its Driverless Cars Killed a Cat.",
      "url": "https://www.nytimes.com/2025/11/15/us/waymo-san-francisco-kit-kat.html",
      "summary": "The self-driving taxis have become ubiquitous in the city, but an uproar ensued when one ran over a beloved feline."
    },
    {
      "title": "Maps Show How Latinos Who Shifted Right in 2024 Snapped Back Left in 2025",
      "url": "https://www.nytimes.com/2025/11/15/us/politics/latino-voters-new-jersey.html",
      "summary": "The New Jersey governor’s race was the first significant sign that President Trump’s success with Hispanic voters in 2024 may have been only a temporary shift."
    },
    {
      "title": "Mystery Fuels Unease in Maine Woods: Who Bought Burnt Jacket Mountain?",
      "url": "https://www.nytimes.com/2025/11/15/us/mystery-maine-burnt-jacket-mountain.html",
      "summary": "An anonymous new owner fenced off beloved trails and put up surveillance cameras in a region with a long tradition of allowing public access on private land."
    },
    {
      "title": "Trump Cuts Ties With Marjorie Taylor Greene, Calling Her ‘Wacky’",
      "url": "https://www.nytimes.com/2025/11/14/us/politics/trump-marjorie-taylor-greene-split.html",
      "summary": "The rupture exposed the divides within President Trump’s MAGA base over the Epstein files and more."
    },
    {
      "title": "Officers were hurt in a crash while protecting Vance’s motorcade in Tennessee.",
      "url": "https://www.nytimes.com/live/2025/11/14/us/trump-shutdown-news/vance-motorcade-accident-tennessee",
      "summary": "A police officer who was on a motorcyc"
    },
    {
      "title": "Turmoil and tensions at FDA after dramatic exit of top drug regulator",
      "url": "https://www.theguardian.com/us-news/2025/nov/15/fda-us-healthcare",
      "summary": "&lt;p&gt;Scramble to find replacement for George Tidmarsh shines light on dysfunction at US regulatory agency &lt;/p&gt;&lt;p&gt;After the dramatic ousting of the top drug regulator at the US Food and Drug Administration (FDA) two weeks ago, officials have scrambled to find a replacement in a process that has revealed the agency’s internal cracks and tensions.&lt;/p&gt;&lt;p&gt;It’s troubling news for a regulatory agency that has previously enjoyed a reputation for stability and consistency.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/15/fda-us-healthcare\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Epstein survivor pushes for release of files in wake of new emails: ‘It will bring us closure’",
      "url": "https://www.theguardian.com/us-news/2025/nov/15/jeffrey-epstein-survivor-marina-lacerda",
      "summary": "&lt;p&gt;Marina Lacerda, 37, recounts the abuse she experienced and what inspired her to speak publicly amid new revelations&lt;/p&gt;&lt;p&gt;When Marina Lacerda woke on Wednesday to learn that &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/13/epstein-files-key-takeaways\"&gt;thousands of documents about Jeffrey Epstein&lt;/a&gt; had been released by House Republicans, she braced herself for a spate of new revelations.&lt;/p&gt;&lt;p&gt;Before deciding to waive her anonymity in September, Lacerda was known for years as “Minor Victim-1” – unknown, unheard, another teenager groomed and abused by the paedophile financier.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/15/jeffrey-epstein-survivor-marina-lacerda\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}