{
  "updatedAt": "2025-11-13T18:38:06.053Z",
  "items": [
    {
      "title": "Government Shutdown Ends and Federal Workers Return",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/shutdown-reopen-museums.html",
      "summary": "Government employees were expecting to see paychecks again as early as Nov. 20 after six weeks in limbo."
    },
    {
      "title": "How a 17-Year-Old Girl Became Enmeshed in the Matt Gaetz Scandal",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/in-matt-gaetz-scandal-circumstances-left-girl-vulnerable-to-exploitation.html",
      "summary": "A 17-year-old with a homeless parent wanted money for braces and ended up having sex for money with powerful men. She wants the public to have a fuller understanding of how she was victimized."
    },
    {
      "title": "Dozens Are Hospitalized After Ammonia Leak in Oklahoma",
      "url": "https://www.nytimes.com/2025/11/13/us/weatherford-ok-chemical-spill-ammonia.html",
      "summary": "Authorities said a tanker truck parked outside a hotel in Weatherford, Okla., was leaking ammonia on Wednesday night, prompting evacuations."
    },
    {
      "title": "Epstein’s Emails About Trump",
      "url": "https://www.nytimes.com/video/us/politics/100000010520312/epstein-trump-emails-explained.html",
      "summary": "Our investigative reporter Steve Eder provides context about Jeffrey Epstein’s relationship with President Donald Trump based on information from over 20,000 pages of documents from Epstein’s estate released by the House Oversight Committee on Wednesday."
    },
    {
      "title": "Some South Korean Workers Return to Georgia Factory After U.S. Reissues Visas",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/south-korea-workers-factory-return-georgia.html",
      "summary": "The State Department has reissued visas for many workers detained in a September raid, lawyers said, as the Trump administration tries to undo damage from the operation."
    },
    {
      "title": "What’s Behind the Coming House Vote on Releasing the Epstein Files",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/house-vote-epstein-files.html",
      "summary": "Proponents of fuller transparency used an arcane rule to prod their leaders to act. When it became clear they had succeeded, the speaker agreed to hold a vote."
    },
    {
      "title": "White House calls newly released Epstein emails a distraction and ‘hoax’ as pressure mounts – live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/13/donald-trump-jeffrey-epstein-files-us-government-shutdown-latest-news-updates",
      "summary": "&lt;p&gt;White House press secretary says Jeffrey Epstein emails that mention Trump are part of ‘Democrat + Mainstream Media hoax’; House to hold vote next week&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/13/trump-epstein-files-congress-vote\"&gt;Trump faces prospect of congressional vote on releasing Epstein files&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/13/epstein-files-key-takeaways\"&gt;Epstein emails: key takeaways from 20,000 pages of newly released files&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Democrats appear more enthusiastic than Republicans about voting in next year’s congressional elections following the party’s victories in recent state and local contests, according to a new Reuters/Ipsos poll, which showed Republican President Donald Trump’s approval steady at 40%.&lt;/p&gt;&lt;p&gt;The six-day poll, which closed on Wednesday, showed 44% of registered voters who called themselves Democrats said they were “very enthusiastic” about voting in the November 3, 2026, elections, compared with 26% of Republicans who said the same. Some 79% of Democrats said they would regret it if they didn’t vote in the election, compared to 68% of Republicans.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/13/donald-trump-jeffrey-epstein-files-us-government-shutdown-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Oklahoma inmate’s life spared moments before scheduled lethal injection",
      "url": "https://www.theguardian.com/us-news/2025/nov/13/tremane-wood-clemency-oklahoma",
      "summary": "&lt;p&gt;Republican Kevin Stitt commuted Tremane Wood’s death sentence to life in prison for 2002 murder of Ronnie Wipf&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/12/tremane-wood-execution-oklahoma\"&gt;After a controversial trial, an Oklahoma man makes a final plea to avoid execution&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Tremane Wood, the 46-year-old death row inmate who faced execution on Thursday in &lt;a href=\"https://www.theguardian.com/us-news/oklahoma\"&gt;Oklahoma&lt;/a&gt;, has had his life spared just minutes before he was set to receive a lethal injection.&lt;/p&gt;&lt;p&gt;Kevin Stitt, the state’s Republican governor, accepted the Oklahoma pardon and parole board’s recommendation that Wood’s sentence be commuted to life in prison without parole. It is just the second time during Stitt’s nearly seven years as governor that he has granted clemency.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/13/tremane-wood-clemency-oklahoma\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}