{
  "updatedAt": "2025-09-04T18:47:52.813Z",
  "items": [
    {
      "title": "Researcher Is Feared Dead After Falling Into a Glacial Stream in Alaska",
      "url": "https://www.nytimes.com/2025/09/04/us/alaska-hiker-death-glacier.html",
      "summary": "The water pushed the man into a hole in the ice that suddenly filled with a torrent of water. He hasn’t been seen since."
    },
    {
      "title": "Man Accused of Killing Israeli Embassy Staffers Pleads Not Guilty",
      "url": "https://www.nytimes.com/2025/09/04/us/politics/not-guilty-plea-israeli-embassy.html",
      "summary": "At an arraignment on Thursday, Elias Rodriguez faced federal hate crime and other charges that could result in the death penalty."
    },
    {
      "title": "Justice Dept. Opens Criminal Inquiry Into Lisa Cook, Elevating Trump’s Claims",
      "url": "https://www.nytimes.com/2025/09/04/us/politics/lisa-cook-trump-fed-governor-justice-dept.html",
      "summary": "The move was instigated by Ed Martin, a Trump loyalist who has said it is legitimate for officials to publicly air criminal investigations into people targeted by the president."
    },
    {
      "title": "Northwestern’s President Will Resign After University Faced Republican Pressure",
      "url": "https://www.nytimes.com/2025/09/04/us/northwestern-president-resigns.html",
      "summary": "The president, Michael Schill, will step down after months of turbulence, including Trump administration cuts of $790 million to the university’s research funds."
    },
    {
      "title": "Trump’s L.A. Military Deployment Cost $120 Million So Far, Newsom Says",
      "url": "https://www.nytimes.com/2025/09/04/us/politics/trump-national-guard-military-troops-deployment-california.html",
      "summary": "The figure reflects the cost of the deployment since June 7, when President Trump ordered National Guard soldiers and Marines to Los Angeles to quell immigration protests."
    },
    {
      "title": "D.C. Sues Trump Administration Over Deployment of National Guard",
      "url": "https://www.nytimes.com/2025/09/04/us/dc-trump-national-guard-suit.html",
      "summary": "The city is challenging the federal government’s authority to send troops into the city for what the president has called a “public safety emergency.”"
    },
    {
      "title": "RFK Jr grilled in tense hearing about chaos at federal health agencies and vaccines – live updates",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/04/donald-trump-tariffs-immigration-technology-epstein-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Trump’s health secretary faces tough questions on about department layoffs and budget cuts amid scrutiny over his plans to ‘make America healthy again’&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Health secretary Robert F&lt;/strong&gt;&lt;strong&gt; Kennedy Jr&lt;/strong&gt;&lt;strong&gt; will appear before a congressional committee on Thursday, where he’s expected to face questions about turmoil at federal health agencies.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The US Senate finance committee has called Kennedy to a hearing about his plans to “Make America Healthy Again”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/04/donald-trump-tariffs-immigration-technology-epstein-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "President of Northwestern University quits amid layoffs forced by Trump cuts",
      "url": "https://www.theguardian.com/us-news/2025/sep/04/northwestern-university-president-resigns-trump-cuts",
      "summary": "&lt;p&gt;Michael H Schill led the institution for three years, during which Trump administration slashed nearly $800m&lt;/p&gt;&lt;p&gt;The president of Northwestern University said Thursday that he was stepping down amid a turbulent period marked by clashes with Republican lawmakers and steep federal funding cuts under the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; that forced widespread layoffs.&lt;/p&gt;&lt;p&gt;Michael H Schill, who has led the institution for three years, has been under heavy scrutiny in conservative circles this year. The Trump administration slashed nearly $800m in research funding after sustained criticism from Republicans.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/04/northwestern-university-president-resigns-trump-cuts\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}