{
  "updatedAt": "2025-11-15T18:33:46.071Z",
  "items": [
    {
      "title": "Once He Was ‘Just Asking Questions.’ Now Tucker Carlson Is the Question.",
      "url": "https://www.nytimes.com/2025/11/15/us/politics/tucker-carlson-fuentes.html",
      "summary": "The conservative commentator has further fractured the right with his anti-Israel rhetoric and sympathy for a white nationalist. He’s not in the mood to apologize."
    },
    {
      "title": "Waymo Was Thriving in San Francisco. Then One of Its Driverless Cars Killed a Cat.",
      "url": "https://www.nytimes.com/2025/11/15/us/waymo-san-francisco-kit-kat.html",
      "summary": "The self-driving taxis have become ubiquitous in the city, but an uproar ensued when one ran over a beloved feline."
    },
    {
      "title": "Maps Show How Latinos Who Shifted Right in 2024 Snapped Back Left in 2025",
      "url": "https://www.nytimes.com/2025/11/15/us/politics/latino-voters-new-jersey.html",
      "summary": "The New Jersey governor’s race was the first significant sign that President Trump’s success with Hispanic voters in 2024 may have been only a temporary shift."
    },
    {
      "title": "Mystery Fuels Unease in Maine Woods: Who Bought Burnt Jacket Mountain?",
      "url": "https://www.nytimes.com/2025/11/15/us/mystery-maine-burnt-jacket-mountain.html",
      "summary": "An anonymous new owner fenced off beloved trails and put up surveillance cameras in a region with a long tradition of allowing public access on private land."
    },
    {
      "title": "Trump Cuts Ties With Marjorie Taylor Greene, Calling Her ‘Wacky’",
      "url": "https://www.nytimes.com/2025/11/14/us/politics/trump-marjorie-taylor-greene-split.html",
      "summary": "The rupture comes ahead of a House vote on a measure that would compel the Justice Department to release the Epstein files."
    },
    {
      "title": "Two Officers Injured in a Crash While Protecting JD Vance’s Motorcade",
      "url": "https://www.nytimes.com/2025/11/14/us/politics/jd-vance-motorcade-accident-tennessee.html",
      "summary": "A police officer who was on a motorcyc"
    },
    {
      "title": "‘Trump is inconsistent with Christian principles’: why the Democratic party is seeing a rise of white clergy candidates",
      "url": "https://www.theguardian.com/us-news/2025/nov/15/christian-democrat-candidates-trump-republicans",
      "summary": "&lt;p&gt;From Texas and Iowa to Arkansas, faith leaders are wading into politics to counter the rise of Christian nationalism&lt;/p&gt;&lt;p&gt;He grew up on a farm in Indiana, the son of a factory worker and eldest of five children. He studied at Liberty, a Christian university founded by the conservative pastor and televangelist &lt;a href=\"https://www.theguardian.com/media/2007/may/17/broadcasting.guardianobituaries\"&gt;Jerry Falwell&lt;/a&gt;, and recalls wearing a T-shirt expressing opposition to Democratic presidential candidate John Kerry.&lt;/p&gt;&lt;p&gt;Two decades later, Justin Douglas is running for the US Congress – as a Democrat.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/15/christian-democrat-candidates-trump-republicans\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Questions arise over strikingly similar signatures by Trump on recent pardons",
      "url": "https://www.theguardian.com/us-news/2025/nov/15/trump-signatures-clemency-orders",
      "summary": "&lt;p&gt;Seemingly identical signatures appeared on clemency orders, which White House blamed on technical error&lt;/p&gt;&lt;p&gt;The Trump administration’s clemency drive is coming under scrutiny after the justice department this week replaced pardons posted online that bore strikingly similar copies of Trump’s signature with others that are distinctively variable.&lt;/p&gt;&lt;p&gt;The corrections came after online commenters seized on the similarities in the president’s signature granting “full and unconditional” pardons to seven men, including to former New York Mets player &lt;a href=\"https://apnews.com/television-fc6318ff6f3d4133890956a7576999e6\"&gt;Darryl Strawberry&lt;/a&gt;, former Tennessee House speaker Glen Casada and former New York police sergeant Michael McMahon, on 7 November.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/15/trump-signatures-clemency-orders\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}