{
  "updatedAt": "2025-12-03T13:00:25.552Z",
  "items": [
    {
      "title": "Federal Immigration Operation Starts in New Orleans",
      "url": "https://www.nytimes.com/2025/12/03/us/border-patrol-new-orleans-immigration.html",
      "summary": "It is unclear how long the effort will last in Louisiana, where the Republican governor has welcomed the agents with open arms even as immigrant communities fear what might come."
    },
    {
      "title": "Hegseth Invoked the ‘Fog of War’ in a Boat Strike. What Does That Mean?",
      "url": "https://www.nytimes.com/2025/12/03/us/fog-of-war-hegseth-boat-strike.html",
      "summary": "Defense Secretary Pete Hegseth used the term, which alludes to uncertainty in battle, in reference to a deadly U.S. military attack in the Caribbean."
    },
    {
      "title": "Liberal Group to Air Ads Attacking Democrats for Confirming Trump Judges",
      "url": "https://www.nytimes.com/2025/12/03/us/politics/demand-justice-attacks-senate-democrats.html",
      "summary": "The three being targeted are Senators John Fetterman, Maggie Hassan and Angus King, an independent who caucuses with Democrats. None are up for re-election next year."
    },
    {
      "title": "Fed Pick Puts Pressure on Bessent to Deliver for Trump",
      "url": "https://www.nytimes.com/2025/12/03/us/politics/fed-chair-bessent-hassett.html",
      "summary": "Treasury Secretary Scott Bessent, who is leading the search for the next Federal Reserve chair, could face President Trump’s wrath if the person chosen does not quickly lower interest rates."
    },
    {
      "title": "Why Harvard Has Not Reached a Deal with Trump",
      "url": "https://www.nytimes.com/2025/12/03/us/politics/trump-harvard.html",
      "summary": "President Trump promised a deal last summer. Other universities have agreed to pay millions to settle with the federal government since then, but Harvard, which was asked to pay much more, has not."
    },
    {
      "title": "Police in a Louisiana City Welcome a Federal Crackdown. Immigrants Are in Hiding.",
      "url": "https://www.nytimes.com/2025/12/03/us/kenner-louisiana-border-patrol-immigration.html",
      "summary": "Kenner, a suburb of New Orleans, has been transformed by an infusion of newcomers. Immigrants there have been on edge all year, particularly in recent weeks."
    },
    {
      "title": "‘We stand with you’: Minneapolis mayor supports Somali community after Trump’s xenophobic remarks – live",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/03/donald-trump-somali-immigrants-ice-minnesota-pete-hegseth-caribbean-boats-venezuela-us-politics-live-latest-news-updates",
      "summary": "&lt;p&gt;Minneapolis mayor condemns the plan to target people who just look like they could be from the East African nation after Trump attacks Somalis in White House rant&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/dec/02/trump-somali-immigrants-minnesota?CMP=Share_iOSApp_Other\"&gt;Trump calls Somali immigrants ‘garbage’ as US reportedly targets Minnesota community&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Voters may have elected Republican Matt Van Epps to fill the vacant seat in the state on Tuesday, but the single-digit win is being interpreted by some as a warning sign for the GOP ahead of midterms next year.&lt;/p&gt;&lt;p&gt;Trump won the district by 22 points last year while Van Epps only won by nine points over Democrat Aftyn Behn – a secure lead but viewed as underperforming Behn ran an unapologetically progressive campaign in a seat viewed as safely red.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/03/donald-trump-somali-immigrants-ice-minnesota-pete-hegseth-caribbean-boats-venezuela-us-politics-live-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Family of victim of Trump boat airstrikes files complaint against ‘extrajudicial killing’ | First Thing",
      "url": "https://www.theguardian.com/us-news/2025/dec/03/first-thing-victim-family-trump-drug-boat-strikes-files-complaint-extrajudicial-killing",
      "summary": "&lt;p&gt;Alejandro Carranza Medina’s relatives say he was a fisher, not a drug trafficker. Plus, Putin says Russia ‘ready’ for war with Europe as Ukraine talks stall&lt;/p&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;A family in Colombia has filed a petition with the Washington DC-based Inter-American Commission on Human Rights (IACHR), alleging that the Colombian citizen Alejandro Carranza Medina was &lt;a href=\"https://www.theguardian.com/world/2025/dec/02/trump-caribbean-drug-boat-attack-complaint\"&gt;subject to an “extrajudicial killing”&lt;/a&gt; in a US airstrike.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What is the IACHR?&lt;/strong&gt; A monitoring body designed to “promote and protect human rights in the western hemisphere”. The US is a member, and the state department said in March it was a “strong supporter of the IACHR”.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;H&lt;/strong&gt;&lt;strong&gt;ow has the Trump administration responded?&lt;/strong&gt; A White House spokesperson, Anna Kelly, did not respond directly to questions about the complaint or about Carranza’s death, but wrote in an email that the media were “now running cover for foreign terrorists smuggling deadly narcotics intended to murder Americans”.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What’s the latest on the front&lt;/strong&gt;&lt;strong&gt;lines?&lt;/strong&gt; Buoyed up by recent gains, Putin has indicated in recent weeks that the Russian military was prepared to keep fighting if diplomacy faltered, repeatedly emphasising that his forces remained on the offensive on the battlefield.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/03/first-thing-victim-family-trump-drug-boat-strikes-files-complaint-extrajudicial-killing\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}