{
  "updatedAt": "2025-10-01T18:36:02.506Z",
  "items": [
    {
      "title": "Why Pete Hegseth Summoned Top Military Leaders",
      "url": "https://www.nytimes.com/video/us/politics/100000010431240/why-pete-hegseth-summoned-top-military-leaders.html",
      "summary": "Secretary of Defense Pete Hegseth faced a room of hundreds of generals and admirals whom he had summoned from across the globe, and made his case for shaking up a force that he said had gone soft and “woke.” Greg Jaffe, the Pentagon reporter for The New York Times, discusses Hegseth’s speech."
    },
    {
      "title": "Environmental Protection Agency Employees Working Despite Furloughs Plan",
      "url": "https://www.nytimes.com/2025/10/01/us/politics/government-shutdown-epa-working.html",
      "summary": "E.P.A. employees said that they were working without pay, and that Trump administration officials had not told them how long the funding would last. Union officials said they were “highly confused.”"
    },
    {
      "title": "How Washington Became a Testing Ground for ICE",
      "url": "https://www.nytimes.com/2025/10/01/us/politics/washington-dc-ice.html",
      "summary": "A series of arrests captured on video reveal how immigration officers have worked with other law enforcement agencies to identify migrants during stops for minor infractions."
    },
    {
      "title": "Congress Remains Deadlocked as Shutdown Enters First Day",
      "url": "https://www.nytimes.com/2025/10/01/us/politics/congress-shutdown-deadlock.html",
      "summary": "Dueling proposals to extend government funding both failed for the third time in two weeks, as neither party could muster the bipartisan coalition needed to move forward."
    },
    {
      "title": "How Government Shutdowns Got More Severe and Further Reaching",
      "url": "https://www.nytimes.com/2025/10/01/us/past-government-shutdowns-length.html",
      "summary": "Shutdowns started having significant effects after an attorney general in the 1980s argued that it was illegal for the government to spend money without congressional appropriations."
    },
    {
      "title": "Supreme Court Allows Lisa Cook to Remain at Fed, for Now",
      "url": "https://www.nytimes.com/2025/10/01/us/politics/supreme-court-lisa-cook-fed.html",
      "summary": "The justices deferred a decision on the president’s efforts to oust Ms. Cook and instead set oral arguments in the case for January."
    },
    {
      "title": "US government shutdown live: White House says ‘layoffs are imminent’ as JD Vance uses false claims to blame Democrats for shutdown",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
      "summary": "&lt;p&gt;Vice-president falsely claims that Democrats want to fund healthcare for ‘illegal aliens’ as press secretary says shutdown will affect federal workers&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/01/us-government-shuts-down\"&gt;US government shuts down&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/sep/30/us-senate-government-funding-votes\"&gt;Tracker: how each US senator voted&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;This shutdown is expected to be worse than previous ones. The impact on federal workers could be even more severe.&lt;/p&gt;&lt;p&gt;Before Trump’s most recent threat of mass layoffs on Tuesday, a memo released last week by the White House’s office of management and budget told agencies not just to prepare for temporary furloughs &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/25/trump-administration-government-shutdown\"&gt;but for permanent layoffs&lt;/a&gt; in the event of a shutdown.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Democrats liken Trump to Putin after call to use US cities for military training",
      "url": "https://www.theguardian.com/us-news/2025/oct/01/democrats-jb-pritzker-trump-putin-immigration",
      "summary": "&lt;p&gt;Illinois governor JB Pritzker and others condemn the US president for suggesting cities be used as military training grounds&lt;/p&gt;&lt;p&gt;A leading &lt;a href=\"https://www.theguardian.com/us-news/democrats\"&gt;Democrat&lt;/a&gt; has compared Donald Trump to Russian dictator Vladimir Putin after the US president &lt;a href=\"https://zpstrategies.us21.list-manage.com/track/click?u=abfa3589981adf5348ff20f1c&amp;amp;id=b25801bfe3&amp;amp;e=223fc5f871\"&gt;told&lt;/a&gt; military leaders on Tuesday that the armed forces should use US cities as “training grounds”.&lt;/p&gt;&lt;p&gt;JB Pritzker, the governor of Illinois, which is bracing for Trump to deploy national guard troops to his state, questioned the president’s mental health and accused him of behaving like an autocrat.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/01/democrats-jb-pritzker-trump-putin-immigration\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}