{
  "updatedAt": "2025-09-17T06:51:18.490Z",
  "items": [
    {
      "title": "After Kirk’s Killing, Obama Says the Nation Is in a ‘Political Crisis’",
      "url": "https://www.nytimes.com/2025/09/17/us/politics/obama-trump-kirk-unity.html",
      "summary": "Speaking at an educational summit, former President Barack Obama criticized his successor’s attacks on his political rivals in the wake of Charlie Kirk’s assassination."
    },
    {
      "title": "San Francisco Politician Recalled Over the Great Highway’s Closure",
      "url": "https://www.nytimes.com/2025/09/17/us/joel-engardio-san-francisco.html",
      "summary": "Supervisor Joel Engardio was ousted by voters who were angry that he helped turn a thoroughfare into a park."
    },
    {
      "title": "Hiker Found Dead in Cascade Mountains of Washington State After Apparent Fall",
      "url": "https://www.nytimes.com/2025/09/16/us/hiker-death-enchantments-washington.html",
      "summary": "The Long Island man, 37, was hiking near Dragontail Peak, a rugged region of the Alpine Lakes Wilderness."
    },
    {
      "title": "Democrat Wins Seat of Slain Minnesota Lawmaker, Leaving State House Evenly Split",
      "url": "https://www.nytimes.com/2025/09/16/us/minnesota-election-slain-lawmaker.html",
      "summary": "Xp Lee, a former City Council member, won a special election to replace his political mentor, former Minnesota House Speaker Melissa Hortman, who was assassinated in June."
    },
    {
      "title": "Trump Invokes Kirk’s Killing in Seeking to Silence Opponents on Left",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/trump-kirk-free-speech-hate-speech-left.html",
      "summary": "In the wake of Charlie Kirk’s killing, President Trump and his allies have laid out a broad plan to target liberal groups, monitor speech, revoke visas and designate certain groups as domestic terrorists."
    },
    {
      "title": "Patel Plays the Familiar Role of Pugilist at a Senate Hearing",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/kash-patel-senate-hearing-fbi.html",
      "summary": "The F.B.I. director has come under withering attack in recent days, but with Republicans backing him, the proceedings fell into a familiar partisan groove that appeared to play to his strengths."
    },
    {
      "title": "Four arrested after images of Trump and Epstein projected on to Windsor Castle ahead of president’s visit",
      "url": "https://www.theguardian.com/us-news/2025/sep/17/four-arrested-after-image-of-trump-and-epstein-projected-onto-windsor-castle-ahead-of-presidents-visit",
      "summary": "&lt;p&gt;Trump arrived in Britain late on Tuesday for an unprecedented second state visit in which he will be hosted by King Charles&lt;/p&gt;&lt;p&gt;Four people have been arrested after images of Donald Trump alongside deceased sex offender Jeffrey Epstein were projected on to Windsor Castle, where the US president is set to be hosted by King Charles during his state visit to Britain.&lt;/p&gt;&lt;p&gt;Trump &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/16/donald-trump-lands-in-uk-for-second-state-visit-as-protesters-gather-in-windsor\"&gt;arrived in Britain late on Tuesday&lt;/a&gt; for an unprecedented second state visit, and will be greeted by Charles on Wednesday for a day of pomp at Windsor Castle, about 25 miles west of London.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/17/four-arrested-after-image-of-trump-and-epstein-projected-onto-windsor-castle-ahead-of-presidents-visit\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Minneapolis police say more than a dozen hurt in homeless encampment shootings",
      "url": "https://www.theguardian.com/us-news/2025/sep/16/minneapolis-police-homeless-encampment-shootings",
      "summary": "&lt;p&gt;Police chief says ‘here we are again in the aftermath of a mass shooting’ after incidents in two separate locations&lt;/p&gt;&lt;p&gt;Minneapolis police have said over a dozen people have been hurt in two separate shootings at homeless encampments across the city on the same day.&lt;/p&gt;&lt;p&gt;The first shooting at a transit station wounded five people, and happened in an area that had seen &lt;a href=\"https://kstp.com/kstp-news/top-news/minneapolis-police-investigating-monday-morning-shooting/\"&gt;two prior shootings in the past month&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/16/minneapolis-police-homeless-encampment-shootings\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}