{
  "updatedAt": "2025-11-26T12:59:16.790Z",
  "items": [
    {
      "title": "Detroit Has Its Own Thanksgiving Parade. The City Gets Bigheaded About It.",
      "url": "https://www.nytimes.com/2025/11/26/us/detroit-michigan-thanksgiving-parade.html",
      "summary": "The march down Woodward Avenue, which endured through the city’s hardest years, features papier-mâché caricatures that are uniquely Detroit."
    },
    {
      "title": "Fact Check: Is Trump Right About Affordability?",
      "url": "https://www.nytimes.com/video/us/politics/100000010540099/fact-check-is-trump-right-about-affordability.html",
      "summary": "President Trump has made misleading statements about the cost of a Thanksgiving meal, turkey and gasoline."
    },
    {
      "title": "SNAP Recipients Plan Thanksgiving, Down to Their Last Cent",
      "url": "https://www.nytimes.com/2025/11/26/us/politics/snap-trump-thanksgiving.html",
      "summary": "Mary Schiely relies on SNAP benefits, as do many customers at the small grocery store where she works. The nation’s day of feasting is not the easiest for them."
    },
    {
      "title": "What the Pentagon’s Attack Videos Reveal About the Boat Strikes at Sea",
      "url": "https://www.nytimes.com/2025/11/26/us/what-the-pentagons-attack-videos-reveal-about-the-boat-strikes-at-sea.html",
      "summary": "The military has released 21 video clips of U.S. attacks on vessels it says are trafficking drugs. But they tell only part of the story."
    },
    {
      "title": "Donors to Trump’s Transition Revealed a Year Later",
      "url": "https://www.nytimes.com/2025/11/26/us/politics/trump-transition-donors.html",
      "summary": "A 46-person list includes billionaires and people he went on to appoint to positions of power."
    },
    {
      "title": "Robert L. Dear Jr., Who Killed 3 at Colorado Planned Parenthood, Dies in Prison",
      "url": "https://www.nytimes.com/2025/11/25/us/robert-dear-planned-parenthood-dead.html",
      "summary": "Four police officers were among those wounded by Mr. Dear in his 2015 rampage when he targeted the clinic in Colorado Springs."
    },
    {
      "title": "Departing Marjorie Taylor Greene ‘the canary in the coal mine’ for Republicans, says former House speaker – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/26/us-politics-latest-news-pete-hegseth-donald-trump-marjorie-taylor-greene-mark-kelly",
      "summary": "&lt;p&gt;Kevin McCarthy says exit of the Trump loyalist turned critic is a sign of broader trouble for Republicans&lt;/p&gt;&lt;p&gt;The Kremlin this morning has confirmed that Witkoff is due in Moscow again next week – expected given the progress reported on a peace deal between Ukrainian and US negotiators earlier this week.&lt;/p&gt;&lt;p&gt;But hanging over that is a report that has emerged of a leaked recording of Witkoff advising Yuri Ushakov, Putin’s foreign affairs adviser, last month on how he should pitch to Trump on the peace plan.&lt;/p&gt;&lt;p&gt;&lt;em&gt;“He’s got to sell this to Ukraine. He’s got to sell Ukraine to Russia,” &lt;/em&gt;he said. &lt;em&gt;“That’s what a dealmaker does.”&lt;/em&gt;&lt;/p&gt;&lt;p&gt;“And this is something inside Congress, they’d better wake up, because they are going to get a lot of people retiring, and they’ve got to focus.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/26/us-politics-latest-news-pete-hegseth-donald-trump-marjorie-taylor-greene-mark-kelly\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump push for new congressional maps meets resistance – from both parties",
      "url": "https://www.theguardian.com/us-news/2025/nov/26/us-politics-redistricting-trump-maps",
      "summary": "&lt;p&gt;White House pressure campaign has not found willing participants in all states – including Republican-led ones&lt;/p&gt;&lt;p&gt;The unprecedented push to create new congressional districts mid-decade is hitting roadblocks in the form of local elected officials from both parties.&lt;/p&gt;&lt;p&gt;Republicans face headwinds in the 2026 midterms: the party in power often loses ground in the election after a presidential win, and Trump’s agenda isn’t going over well. The 2025 off-year elections showed voters favoring Democrats at higher-than-expected margins. Trump wants to keep the House in Republican control by redrawing congressional maps to create more Republican-friendly districts. He first pressured Texas, which responded by drawing five additional red districts, which led California to advance a now-approved ballot measure to create five more Democrat-friendly districts to offset Texas’s maps.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/26/us-politics-redistricting-trump-maps\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}