{
  "updatedAt": "2025-09-09T06:52:14.311Z",
  "items": [
    {
      "title": "12th Grade Reading Skills Hit a New Low",
      "url": "https://www.nytimes.com/2025/09/09/us/12th-grade-reading-skills-low-naep.html",
      "summary": "High school seniors had the worst reading scores since 1992 on a national test, a loss probably related to increases in screen time and the pandemic. Their math scores fell as well."
    },
    {
      "title": "Firefighters Race to Save a Treasured Sequoia Grove in California",
      "url": "https://www.nytimes.com/2025/09/08/us/sequoia-mckinley-grove-california.html",
      "summary": "Giant sequoias can live for thousands of years, but wildfires have killed staggering numbers of the trees in recent years."
    },
    {
      "title": "Thune Moves to Speed Trump Nominees Past Democratic Blockade",
      "url": "https://www.nytimes.com/2025/09/08/us/politics/senate-nominations-nuclear-option-trump.html",
      "summary": "Republicans said the maneuver to change the Senate’s rules, the latest step that would weaken the filibuster, was necessary to overcome Democratic obstruction of President Trump’s nominees."
    },
    {
      "title": "Trump’s Treasury Secretary Threatens to Punch Housing Official in the Face",
      "url": "https://www.nytimes.com/2025/09/08/us/politics/trump-treasury-bessent-pulte-threat.html",
      "summary": "The dust-up, at a members-only club in Georgetown, was not the first time Scott Bessent has shown a hot temper."
    },
    {
      "title": "Ukrainian Refugee Stabbing in North Carolina Ignites a Firestorm on the Right",
      "url": "https://www.nytimes.com/2025/09/08/us/charlotte-murder-conservatives-crime.html",
      "summary": "Security footage capturing the unprovoked stabbing in Charlotte became an accelerant for conservative arguments about the perceived failings of Democratic policies."
    },
    {
      "title": "Trump Denies Epstein Birthday Drawing, but Signature Matches Personal Letters",
      "url": "https://www.nytimes.com/2025/09/08/us/politics/trump-signature-epstein-letter.html",
      "summary": "Donald Trump’s signature has evolved over the years, but when signing just his first name, he often includes the same flourish at the end."
    },
    {
      "title": "House committee releases image of entire Epstein birthday album, including letter signed by Trump – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
      "summary": "&lt;p&gt;This blog is now closed. You can read more on the album and letter here: &lt;br&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/08/trump-epstein-birthday-letter\"&gt;House Democrats share screenshot of apparent Trump birthday note to Epstein&lt;/a&gt;&lt;/p&gt;&lt;p&gt;Intent on vindication after spending four months in prison last year, &lt;strong&gt;Peter Navarro&lt;/strong&gt; asked a federal appeals court on Sunday night to force &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump’s&lt;/a&gt; justice department to explain why it would not defend his 2022 conviction for defying a &lt;a href=\"https://www.theguardian.com/us-news/us-capitol-breach\"&gt;January 6&lt;/a&gt; committee subpoena.&lt;/p&gt;&lt;p&gt;The request to the US court of appeals for the DC circuit is fraught for the department as it would have to confront the appearance that it &lt;a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cadc.40540/gov.uscourts.cadc.40540.2132720.0.pdf\"&gt;quietly dropped the case&lt;/a&gt; in order to shield Navarro after he was tapped as a senior adviser to the president.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: Epstein case haunts Trump as alleged birthday letter released",
      "url": "https://www.theguardian.com/us-news/2025/sep/09/president-trump-administration-news-updates-today",
      "summary": "&lt;p&gt;Letter contains purported message from Trump to Epstein in which the president says, ‘May every day be another wonderful secret’. Key US politics stories from 8 September at a glance&lt;/p&gt;&lt;p&gt;Questions over his friendship with convicted sex offender, Jeffery Epstein, continue to haunt Donald Trump, this time with the release of a birthday letter that Trump had previously denied writing.&lt;/p&gt;&lt;p&gt;An image of the birthday letter, the existence of which was first reported by the Wall Street Journal in July, was released by House Democrats after the House oversight committee received the 2003 “birthday book” from Epstein’s lawyers. It is dated three years before allegations of sex abuse by Epstein became public in 2006.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/09/president-trump-administration-news-updates-today\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}