{
  "updatedAt": "2025-11-24T12:58:13.810Z",
  "items": [
    {
      "title": "A Stand Against Coal Could Push Oakland Toward Bankruptcy",
      "url": "https://www.nytimes.com/2025/11/24/us/oakland-coal-port-budget-bankruptcy.html",
      "summary": "After Oakland, Calif., reneged on a contract allowing coal shipments, a Kentucky company went under. Courts say the city must now pay hundreds of millions of dollars."
    },
    {
      "title": "Why a Man With U.S. Ties Fought for Russia in Ukraine",
      "url": "https://www.nytimes.com/2025/11/24/us/politics/russian-soldier-war.html",
      "summary": "Col. Andrei Demurenko’s war story began at Fort Leavenworth, Kan., at a moment of hope and peace. It ended with a mortar blast in Ukraine."
    },
    {
      "title": "The Best Baseball Team Behind Bars",
      "url": "https://www.nytimes.com/2025/11/24/us/san-quentin-prison-baseball-team.html",
      "summary": "The San Quentin Giants’ opponents are impressed. But what about the parole board that decides the players’ fate?"
    },
    {
      "title": "Billionaires Have a Bigger Role in Higher Education Under President Trump",
      "url": "https://www.nytimes.com/2025/11/24/us/billionaires-influence-universities-trump.html",
      "summary": "A new set of billionaires with an interest in higher education has helped oust college presidents and even assisted the Trump administration in its effort to overhaul the industry."
    },
    {
      "title": "X Displays Users’ Locations, Fueling Scrutiny Over Political Accounts",
      "url": "https://www.nytimes.com/2025/11/24/us/politics/x-twitter-location-maga-controversy.html",
      "summary": "Online sleuths quickly found that some accounts posting about U.S. politics, including those in support of the MAGA movement, appeared not to be based in the United States."
    },
    {
      "title": "Jamil Abdullah Al-Amin, Black Power Activist Known as H. Rap Brown, Dies at 82",
      "url": "https://www.nytimes.com/2025/11/23/us/h-rap-brown-dead.html",
      "summary": "A charismatic orator in the 1960s, he called for armed resistance to white oppression. As a Muslim cleric, he was convicted of murder in 2000 and died in detention."
    },
    {
      "title": "US senators call for investigation of scam ads on Facebook and Instagram",
      "url": "https://www.theguardian.com/us-news/2025/nov/24/investigation-scam-ads-facebook-instagram",
      "summary": "&lt;p&gt;Senators cited Reuters reporting that Meta itself estimated its platforms were involved in a third of all scams in the US&lt;/p&gt;&lt;p&gt;US senators Josh Hawley and Richard Blumenthal have asked the heads of the Federal Trade Commission (FTC) and the Securities and Exchange Commission (SEC) to investigate revenue from ads on &lt;a href=\"https://www.theguardian.com/technology/facebook\"&gt;Facebook&lt;/a&gt; and &lt;a href=\"https://www.theguardian.com/technology/instagram\"&gt;Instagram&lt;/a&gt; that promote scams and banned goods.&lt;/p&gt;&lt;p&gt;“The FTC and SEC should immediately open investigations and, if the reporting is accurate, pursue vigorous enforcement action where appropriate” to force Meta to disgorge profits, pay penalties and agree to cease running such advertisements, Hawley and Blumenthal wrote in a letter to the federal agencies.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/24/investigation-scam-ads-facebook-instagram\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US reportedly ready for next phase of Venezuela military operations – live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates",
      "summary": "&lt;p&gt;Trump administration labels Maduro as member of foreign terrorist organization and could impose fresh sanctions on country&lt;/p&gt;&lt;p&gt;Trump has also posted positively about the negotiations in his usual spray of morning missives on his &lt;a href=\"https://truthsocial.com/@realDonaldTrump\"&gt;Truth Social&lt;/a&gt; account:&lt;/p&gt;&lt;p&gt;&lt;em&gt;“Is it really possible that big progress is being made in Peace Talks between Russia and Ukraine??? Don’t believe it until you see it, but something good just may be happening. GOD BLESS AMERICA!”&lt;/em&gt;&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}