{
  "updatedAt": "2025-10-24T18:34:58.338Z",
  "items": [
    {
      "title": "Trump Officials Float New Plan for Abrego Garcia: Send Him to Liberia",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/trump-abrego-garcia-liberia.html",
      "summary": "The proposal was the latest twist in a byzantine saga that has transformed the Salvadoran migrant into one of the best-known symbols of President Trump’s aggressive deportation agenda."
    },
    {
      "title": "Amid the Rubble of the East Wing, Lessons in How Trump Exercises Power",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/east-wing-trump-power.html",
      "summary": "From the first day of his second term, President Trump has taken an ends-justify-the-means approach to his presidency."
    },
    {
      "title": "Republicans Who Have Rarely Opposed Trump Raise Questions About His Drug War",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/republicans-trump-drug-war.html",
      "summary": "The president said he wouldn’t seek congressional approval for his expanding military offensive against cartels, but some in his party believe Congress should weigh in."
    },
    {
      "title": "2 People Shot at Protest Site Outside Coast Guard Base in California",
      "url": "https://www.nytimes.com/2025/10/24/us/coast-guard-shots-fired-protest.html",
      "summary": "Coast Guard police fired rounds at a moving van that accelerated toward the base in reverse and did not follow commands to stop, the authorities say."
    },
    {
      "title": "A Restaurant Run by Teens in a Town Overrun by Guns",
      "url": "https://www.nytimes.com/2025/10/24/us/montgomery-thats-my-dog-jr-gun-violence.html",
      "summary": "Shootings have long plagued the city of Montgomery, Ala., where poverty levels are high and good jobs are scarce. That’s My Dog Jr. offers teenagers a moneymaking opportunity — and $3.99 hot dogs."
    },
    {
      "title": "U.S. Deploys Aircraft Carrier to Latin America as Drug Operation Expands",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/caribbean-sea-boat-strike-us-venezuela.html",
      "summary": "The Trump administration has acknowledged 10 strikes on suspected drug-smuggling boats from South America, which have killed 43 people."
    },
    {
      "title": "Schumer says Democrats will force vote to overturn Canada tariffs as Carney says nation ‘stands ready’ to continue US trade talks – live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news",
      "summary": "&lt;p&gt;Democratic leader calls Canada tariffs ‘damaging’ and vows effort to overturn them; Canadian prime minister says he wants to see progress on trade negotiations&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-canada-trade-negotations-ontario-tariffs\"&gt;US and Canada spar over anti-Trump tariff ad that suspended trade talks&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;The US secretary of state has confirmed Donald Trump’s announcement that all trade negotiations with Canada have been suspended.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Marco Rubio spoke during a visit to a civil-military coordination centre in southern Israel.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US airstrike on ‘drug boat’ kills six as aircraft carrier sent to South America",
      "url": "https://www.theguardian.com/us-news/2025/oct/24/us-military-strike-alleged-drug-boat-caribbean",
      "summary": "&lt;p&gt;Pete Hegseth claims six ‘narco-terrorists’ killed in Caribbean as US military conducts 10th strike &lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news\"&gt;US politics live – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The United States has carried out another military strike against a boat it claims was carrying illegal drugs in the Caribbean, killing six people onboard, the Pentagon chief, Pete Hegseth, said on Friday morning.&lt;/p&gt;&lt;p&gt;Later on Friday, the Pentagon &lt;a href=\"https://x.com/SeanParnellASW/status/1981759934539985132\"&gt;said&lt;/a&gt; that an aircraft carrier was being moved to waters off South America, as part of the administration’s stated campaign to combat drug trafficking.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/24/us-military-strike-alleged-drug-boat-caribbean\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}