{
  "updatedAt": "2025-11-01T12:49:18.328Z",
  "items": [
    {
      "title": "Trump’s Team Offers to Keep Some Ballroom Donors Incognito",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/trumps-team-offers-to-keep-some-ballroom-donors-incognito.html",
      "summary": "Many corporate interests that have donated to the president’s pet project have business before his administration."
    },
    {
      "title": "Fed Governor Defends Call for Big Rate Cuts",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/steven-miran-interview-transcript.html",
      "summary": "In a wide-ranging interview, Stephen I. Miran discussed why he thinks concerns about inflation are overblown and his worries about the economy if the Federal Reserve does not rapidly lower interest rates. Here is a full transcript."
    },
    {
      "title": "Shutdowns, Obamacare and the Risks of Bargaining for Policy Wins in a Crisis",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/shutdowns-obamacare-republicans-democrats.html",
      "summary": "A 2013 attempt to leverage minority power in a health care fight blew up on Republicans. Can today be different for Democrats?"
    },
    {
      "title": "Miami Has a Mayoral Election. Bring On the Drama.",
      "url": "https://www.nytimes.com/2025/11/01/us/miami-mayor-election.html",
      "summary": "In a city of often-zany elections, this year’s mayoral race is especially rich in personal stories and longstanding feuds."
    },
    {
      "title": "Under Trump, Becoming a U.S. Citizen Gets Harder",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/trump-citizenship.html",
      "summary": "Federal officials say overhauling the process is necessary to ensure that only fully qualified immigrants become citizens."
    },
    {
      "title": "California Promised Insurance Relief, But Delivered Loopholes",
      "url": "https://www.nytimes.com/2025/11/01/us/los-angeles-california-fire-insurance-regulations.html",
      "summary": "New regulations were supposed to ensure that homeowners in fire zones would have coverage available. But companies can still avoid serving many high-risk areas, a Times investigation found."
    },
    {
      "title": "DeSantis accused of playing politics as Florida shatters executions record",
      "url": "https://www.theguardian.com/us-news/2025/nov/01/florida-death-penalty-ron-desantis",
      "summary": "&lt;p&gt;The state has killed 15 people this year with two more scheduled this month as death penalty in decline across US&lt;/p&gt;&lt;p&gt;Death penalty opponents have decried an unprecedented surge in executions ordered by Florida’s Republican governor, Ron DeSantis, after the state maintained a record pace with last week’s killing of a military veteran.&lt;/p&gt;&lt;p&gt;Norman Mearle Grim, who was convicted of the 1998 murder and rape of a neighbor, became the &lt;a href=\"https://www.alligator.org/article/2025/10/florida-man-executed-for-1998-murder-and-sexual-battery-of-next-door-neighbor\"&gt;15th person put to death&lt;/a&gt; this year, by lethal injection, at the Florida state prison in Starke on Wednesday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/01/florida-death-penalty-ron-desantis\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "What the New York mayor’s race will reveal about the Democratic party",
      "url": "https://www.theguardian.com/us-news/2025/nov/01/new-york-mayoral-race-democratic-party",
      "summary": "&lt;p&gt;The political differences between the two main candidates could have major implications for next year’s midterms&lt;/p&gt;&lt;p&gt;New Yorkers will find out the identity of their next mayor on Tuesday, in a race that will decide who will run, and defend, the US’s largest city at a time when &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; has threatened to send military troops there.&lt;/p&gt;&lt;p&gt;Against that backdrop, New York has seen a mayoral election that has pitted two very different Democrats against one another. The race has become an increasingly bitter face-off, laced with alleged racism and Islamophobia, but it is the political differences between the two main candidates that could have major implications for how the Democratic party performs in next year’s midterm elections.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/01/new-york-mayoral-race-democratic-party\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}