{
  "updatedAt": "2025-09-26T18:33:49.027Z",
  "items": [
    {
      "title": "Federal Forces Set to Arrive in Memphis Next Week, Governor Says",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/memphis-national-guard-crime.html",
      "summary": "The deployment will eventually include more than a dozen federal agencies, Gov. Bill Lee of Tennessee said, as well as the National Guard."
    },
    {
      "title": "Trump Predicts More Indictments and Claims It’s Not Revenge",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/trump-comey-revenge.html",
      "summary": "The president has cast the indictment as “justice” rather than revenge, but his own words and actions cast doubt on that assertion."
    },
    {
      "title": "Gunman Who Attacked Midtown Office Building Had C.T.E.",
      "url": "https://www.nytimes.com/2025/09/26/us/cte-football-tamura-gunman.html",
      "summary": "Shane Tamura, a former high school football player, shot himself and left behind a note that said his motive was anger at the N.F.L."
    },
    {
      "title": "Brief Comey Indictment Prompts Questions and Criticism",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/comey-indictment-legal-reaction.html",
      "summary": "The two-page indictment of James B. Comey, the former F.B.I. director, offered little indication of the evidence that would be presented at a trial. Some legal experts called it flimsy and dangerous."
    },
    {
      "title": "Close National Parks if Government Shuts Down, Former Superintendents Plead",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/national-parks-open-government-shutdown.html",
      "summary": "More than 35 former park superintendents wrote a letter to the Trump administration, saying the lands could be damaged under limited staffing."
    },
    {
      "title": "James Comey and Donald Trump’s Relationship: A Timeline",
      "url": "https://www.nytimes.com/2025/09/26/us/trump-comey-relationship-timeline.html",
      "summary": "James B. Comey, the former F.B.I. director now under indictment, has long been a target of President Trump’s ire."
    },
    {
      "title": "Assata Shakur, an icon of Black liberation who was exiled to Cuba, dies aged 78",
      "url": "https://www.theguardian.com/us-news/2025/sep/26/assata-shakur-dies-aged-78",
      "summary": "&lt;p&gt;Shakur spent decades exiled after she was convicted of killing a state trooper in 1977 and escaped from prison&lt;/p&gt;&lt;p&gt;On 25 September, Assata Shakur, a former member of the Black Liberation Army, died aged 78 in Havana, Cuba, according to &lt;a href=\"https://cubaminrex.cu/es/nota-de-prensa-del-ministerio-relaciones-exteriores\"&gt;Cuba’s Ministry of Foreign Affairs&lt;/a&gt;. Cuban officials cited the reason for her death as old age and health conditions. Shakur, a longstranding symbol of resistance and Black liberation, spent several decades exiled in Cuba after she was convicted of killing a New Jersey state trooper in 1977 and escaped from prison.&lt;/p&gt;&lt;p&gt;“At approximately 1:15pm on September 25th, my mother, Assata Shakur, took her last earthly breath,” her daughter Kakuya Shakur wrote on &lt;a href=\"https://www.facebook.com/kakuya/posts/pfbid02fi1n9xdApUzVmycCQF4HizBEhL4twDXZdxY5v7ii7v1JJUr6sdFBKvoJ1Ci71yEql\"&gt;Facebook&lt;/a&gt;. “Words cannot describe the depth of loss that I’m feeling at this time.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/26/assata-shakur-dies-aged-78\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Ice officer ‘relieved of duties’ after video shows him manhandling woman at New York immigration court",
      "url": "https://www.theguardian.com/us-news/2025/sep/26/ice-officer-video-relieved-of-duties",
      "summary": "&lt;p&gt;Monica Moreta-Galarza was pleading with officer to release her detained husband when he pushed her to the ground&lt;/p&gt;&lt;p&gt;A federal officer for Immigration and Customs Enforcement (&lt;a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\"&gt;Ice&lt;/a&gt;) has been “relieved of his duties” after a video showing him pushing a woman to the floor at an immigration &lt;a href=\"https://www.theguardian.com/us-news/gallery/2025/sep/19/arrests-immigration-court-new-york-in-pictures\"&gt;court&lt;/a&gt; in New York City spread quickly &lt;a href=\"https://x.com/propublica/status/1971387520400425057?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1971387520400425057%7Ctwgr%5E6f4e5cd301f4b662af6075460e2c891e4967a603%7Ctwcon%5Es1_&amp;amp;ref_url=https%3A%2F%2Fwww.theguardian.com%2Fus-news%2Flive%2F2025%2Fsep%2F26%2Fjames-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live%3Fpage%3Dwith3Ablock-68d6c3ad8f081f77e6af3de5\"&gt;on social media&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;Tricia McLaughlin, assistant secretary for public affairs at the Department of Homeland Security, said that the officer’s actions were “unacceptable and beneath the men and women of Ice”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/26/ice-officer-video-relieved-of-duties\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}