{
  "updatedAt": "2025-10-26T06:36:16.186Z",
  "items": [
    {
      "title": "Honduran Man Struck and Killed On a Virginia Highway While Fleeing ICE",
      "url": "https://www.nytimes.com/2025/10/25/us/ice-honduran-killed-virginia.html",
      "summary": "ICE officers were in the process of detaining Josue Castro-Rivera, 24, of Honduras, before he ran onto a busy highway in Norfolk and was struck by a pickup truck, officials said."
    },
    {
      "title": "Ex-L.A.P.D. Officer Indicted in On-Duty Shooting of Unarmed Homeless Man",
      "url": "https://www.nytimes.com/2025/10/25/us/lapd-homeless-shooting-murder-charge.html",
      "summary": "Clifford Proctor, 60, was charged with second-degree murder in the 2015 killing of Brendon Glenn during an attempted arrest."
    },
    {
      "title": "Navy Begins Evacuating Families From Guantánamo Bay Ahead of Hurricane Melissa",
      "url": "https://www.nytimes.com/2025/10/25/us/politics/guantanamo-bay-hurricane-melissa-evacuations.html",
      "summary": "The base commander on Saturday expanded a previous evacuation order to include “non-mission-essential U.S. citizens.”"
    },
    {
      "title": "Arthur Waskow, 92, Influential Rabbi and Activist for Social Justice, Dies",
      "url": "https://www.nytimes.com/2025/10/25/us/arthur-waskow-dead.html",
      "summary": "Through more than two dozen books and two organizations he helped start, he had a profound impact on the intellectual and political life of Jewish congregations in the United States."
    },
    {
      "title": "Kamala Harris Suggests She Is Considering Another Presidential Run",
      "url": "https://www.nytimes.com/2025/10/25/us/politics/kamala-harris-presidential-race.html",
      "summary": "Ms. Harris, in an interview with the BBC, gave her strongest indication yet that she was thinking about making another bid for the Oval Office."
    },
    {
      "title": "Timothy Mellon Is Donor Who Gave $130 Million to Pay Troops During Shutdown",
      "url": "https://www.nytimes.com/2025/10/25/us/politics/timothy-mellon-donation-troops.html",
      "summary": "Timothy Mellon is a billionaire and a major financial backer of President Trump."
    },
    {
      "title": "Trump oversees Thailand-Cambodia ceasefire signing as Asia tour gets under way",
      "url": "https://www.theguardian.com/us-news/2025/oct/26/trump-oversees-thailand-cambodia-ceasefire-signing-as-asia-tour-gets-under-way",
      "summary": "&lt;p&gt;Trump has begun a five-day trip to Malaysia, Japan and South Korea, his first visit to the region since taking office in January&lt;/p&gt;&lt;p&gt;The leaders of Thailand and Cambodia signed an enhanced ceasefire deal on Sunday in the presence of Donald Trump, who in July helped to bring an end to their &lt;a href=\"https://www.theguardian.com/world/2025/jul/24/why-thailand-cambodia-border-clash-conflict\"&gt;deadly five-day border conflict&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;The US president watched as the Cambodian prime minister, Hun Manet, and the Thai prime minister, Anutin Charnvirakul, signed the expanded ceasefire at the annual summit of the Association of Southeast Asian Nations (Asean) in Malaysia, soon after Trump’s arrival.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/26/trump-oversees-thailand-cambodia-ceasefire-signing-as-asia-tour-gets-under-way\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: President raises tariffs on Canada as he attends Asean summit with Carney",
      "url": "https://www.theguardian.com/us-news/2025/oct/26/trump-administration-news-updates-today-latest",
      "summary": "&lt;p&gt;Donald Trump makes announcement in response to anti-tariff ad sponsored by Ontario government. Key US politics stories from Saturday 25 October at a glance&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; announced on Saturday that he will raise US tariffs on Canada by 10% in retaliation for &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-canada-trade-negotations-ontario-tariffs\"&gt;an anti-tariff advertisement&lt;/a&gt; sponsored by the Ontario government, which has further strained one of the world’s largest trade partnerships.&lt;/p&gt;&lt;p&gt;The statement, posted on Trump’s Truth Social account, came after several days of public disputes over the ad, which referenced Ronald Reagan’s support for free trade and provoked the US president’s anger.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/26/trump-administration-news-updates-today-latest\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}