{
  "updatedAt": "2025-12-05T06:42:12.090Z",
  "items": [
    {
      "title": "As Trump Covets Nobel Peace Prize, FIFA Cozies Up to Him With Its Own Award",
      "url": "https://www.nytimes.com/2025/12/05/us/politics/trump-fifa-peace-prize-world-cup-infantino.html",
      "summary": "Gianni Infantino, head of soccer’s governing body, has been ingratiating himself with the president to help ensure a successful 2026 World Cup."
    },
    {
      "title": "Human Remains Found Buried at San Diego Home",
      "url": "https://www.nytimes.com/2025/12/04/us/human-remains-investigation-san-diego-home.html",
      "summary": "Prosecutors are looking at potential connections to a former resident, who faces a murder charge in another case."
    },
    {
      "title": "Second Strike Scrutiny Obscures Larger Question About Trump’s Boat Attacks",
      "url": "https://www.nytimes.com/2025/12/04/us/politics/trump-boat-attacks-killings.html",
      "summary": "Congress is focusing on two deaths in one strike. But nine other people died in that same attack, and the United States has killed 87 in all. Were any of those killings legal?"
    },
    {
      "title": "Judge Dismisses Harvard Antisemitism Lawsuit by a Former Student",
      "url": "https://www.nytimes.com/2025/12/04/us/harvard-antisemitism-lawsuit.html",
      "summary": "Yoav Segev said he was harassed “for being Jewish and Israeli” during a campus protest in October 2023, an episode that had drawn the attention of Republicans in Washington."
    },
    {
      "title": "Trump Trumpets Peace in Africa Amid War on Drug Boats, in Day of Dissonance",
      "url": "https://www.nytimes.com/2025/12/04/us/politics/trump-congo-rwanda-boat-strikes.html",
      "summary": "President Trump presided over a Congo-Rwanda peace deal on the same day his administration was being questioned about potential war crimes."
    },
    {
      "title": "Trump Returns Coast Guard Helicopter to Oregon Fishing Town After Uproar",
      "url": "https://www.nytimes.com/2025/12/04/us/trump-coast-guard-helicopter-oregon.html",
      "summary": "Some residents in Newport, Ore., believed that the Trump administration had removed its Coast Guard rescue helicopter to make way for an immigration detention site."
    },
    {
      "title": "Supreme court allows Texas to use new congressional map favoring Republicans in 2026 elections – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/04/us-politics-live-donald-trump-latest-news-updates-democrats-republicans",
      "summary": "&lt;p&gt;This live blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/dec/04/trump-administration-news-update-today\"&gt;Trump news at a glance: US supreme court gives Texas win in national redistricting battle&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Among the beneficiaries of &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt;’s pardons and commutations, there is a group that legal experts and political scientists see as some of the clearest evidence of how such actions undermine the rule of law: those who were released from prison and again arrested for different alleged crimes&lt;/strong&gt;.&lt;/p&gt;&lt;p&gt;During his first term, Trump issued 237 acts of clemency – including to someone who was a predatory lender and drug smuggler and to another who ran a Ponzi scheme. Since taking office again, Trump has issued more than 1,600, most for people involved in the &lt;a href=\"https://www.theguardian.com/us-news/2025/jan/20/trump-executive-orders-jan-6-pardons\"&gt;January 6 attack&lt;/a&gt; on Congress.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/04/us-politics-live-donald-trump-latest-news-updates-democrats-republicans\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Pentagon announces it has killed four men in another boat strike in Pacific",
      "url": "https://www.theguardian.com/us-news/2025/dec/04/pentagon-boat-strike-pacific",
      "summary": "&lt;p&gt;Strike comes amid congressional turmoil over legality of US attacks on suspected drug smugglers&lt;/p&gt;&lt;p&gt;The Pentagon announced on Thursday that the US military had conducted another deadly strike on a boat suspected of carrying illegal narcotics, killing four men in the eastern Pacific, as questions mount over the legality of the attacks.&lt;/p&gt;&lt;p&gt;Video of the new strike was &lt;a href=\"https://x.com/Southcom/status/1996726797086457886\"&gt;posted on social media&lt;/a&gt; by the US southern command, based in Florida, with a statement saying that, at the direction of &lt;a href=\"https://www.theguardian.com/us-news/pete-hegseth\"&gt;Pete Hegseth&lt;/a&gt;, the defense secretary, “Joint Task Force Southern Spear conducted a lethal kinetic strike on a vessel in international waters operated by a Designated Terrorist Organization”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/04/pentagon-boat-strike-pacific\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}