{
  "updatedAt": "2025-09-28T12:47:39.563Z",
  "items": [
    {
      "title": "With Scant Information, Federal Workers Brace for Possible Shutdown",
      "url": "https://www.nytimes.com/2025/09/28/us/politics/federal-government-shutdown-trump.html",
      "summary": "After a tumultuous year of staffing cuts, government employees now face the prospect of going without pay — or facing even more layoffs."
    },
    {
      "title": "N.C. Stabbing Suspect Had Many Interactions With Police and Little Treatment",
      "url": "https://www.nytimes.com/2025/09/28/us/nc-stabbing-suspect-police-mental-health-history.html",
      "summary": "Decarlos Brown Jr. had harbored paranoid delusions for years, yet under state law he was not considered dangerous enough to be treated against his will."
    },
    {
      "title": "Greene, Straying From Trump, Reflects an Emerging MAGA Split",
      "url": "https://www.nytimes.com/2025/09/28/us/politics/marjorie-taylor-greene-maga-split.html",
      "summary": "The right-wing Republican congresswoman from Georgia has grown disillusioned with her own party and with President Trump, and increasingly willing to say so."
    },
    {
      "title": "A Stranger Shattered Their Lives. At First, They Didn’t Know Why.",
      "url": "https://www.nytimes.com/2025/09/28/us/phillip-adams-cte.html",
      "summary": "A family reckons with the devastation left behind after a former N.F.L. player showed up on their property."
    },
    {
      "title": "Gunman Fires on Riverside Bar in North Carolina From Boat, Killing 3",
      "url": "https://www.nytimes.com/2025/09/28/us/north-carolina-boat-shooting.html",
      "summary": "Eight others were injured in the attack on the bar in Southport, N.C., the authorities said. The Coast Guard later detained a person matching a description of the shooter."
    },
    {
      "title": "A Man Is Linked to the Brutal ‘Yogurt Shop Murders’ 34 Years Ago",
      "url": "https://www.nytimes.com/2025/09/27/us/yogurt-shop-murders-dna-serial-killer.html",
      "summary": "Police said they used DNA to identify a suspect in the Austin killings known as the yogurt shop murders. The case has haunted the city for decades."
    },
    {
      "title": "US Latinos mobilize to monitor – and improve – local air quality: ‘We have to fix it’",
      "url": "https://www.theguardian.com/us-news/2025/sep/28/latino-communites-air-quality",
      "summary": "&lt;p&gt;As Latino communities ramp up air quality monitoring, Trump’s EPA moves to weaken pollution regulations&lt;/p&gt;&lt;p&gt;On a tree-lined street in a quiet suburb known by some as “Arbor City”, Eileen Miranda often watched her grandson race around the yard, trusting – like most – that the air they were breathing was clean. But data from an air quality sensor she recently installed outside her home showed otherwise. Now she wonders if it was the air that contributed to her eldest son’s childhood struggle with asthma.&lt;/p&gt;&lt;p&gt;“It overwhelmed me,” Miranda said. “I thought the numbers would be low. This community is nice, but lo and behold”&lt;/p&gt;&lt;p&gt;Eileen Miranda outside her home in La Mirada, California, in March."
    },
    {
      "title": "Children left short of clean water and sleep amid ‘prolonged’ detention by Ice, watchdog groups allege",
      "url": "https://www.theguardian.com/us-news/2025/sep/28/ice-detention-texas-children",
      "summary": "&lt;p&gt;Legal experts speak of ‘cruel’ and harmful deprivations for families held in Texas immigration facility&lt;/p&gt;&lt;p&gt;Children, including the very young, have been spending weeks or months in an Immigration and Customs Enforcement (Ice) detention facility in a remote part of Texas where outside monitors have heard accounts of shortages of clean drinking water, chronic sleep deprivation and kids struggling for hygiene supplies and prompt medical attention, as revealed in a stark new court filing.&lt;/p&gt;&lt;p&gt;Legal experts able to witness conditions made a barrage of allegations about deprivations, violations of legally agreed basic detention standards and humanitarian concerns at the only known &lt;a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\"&gt;Ice&lt;/a&gt; center currently holding families. At the facility in Dilley, a small town an hour south-west of San Antonio, kids and their parents described a “prison-like environment” where the guards reportedly call them “inmates” despite them not being criminals, and said they live in “cell-like trailers”.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;prolonged, vaguely&lt;/strong&gt;&lt;strong&gt; explained detention&lt;/strong&gt;&lt;strong&gt;: &lt;/strong&gt;This goes beyond the general &lt;a href=\"https://www.americanimmigrationcouncil.org/fact-sheet/immigration-detention-united-states-agency/\"&gt;legal limit&lt;/a&gt; of 20 days for children, with accounts of children held for two or three months and a family detained for 45 days, released, then quickly re-detained.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;lack of access to drinkable water&lt;/strong&gt;&lt;strong&gt;:&lt;/strong&gt; Families have not wanted to consume “dirty” water that smells “so horrible”, but drinkable water is often unavailable unless they buy it.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;sleep deprivation&lt;/strong&gt;&lt;strong&gt;:&lt;/strong&gt; Children, especially, are suffering sleeplessness because the lights are never switched off, while officials slam doors, walk in and out frequently and speak loudly on walkie-talkies all night.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;inadequate medical care&lt;/strong&gt;&lt;strong&gt;:&lt;/strong&gt; One boy complained of “acute stomach pain” for six hours before he vomited and ended up being rushed to the hospital for emergency surgery for appendicitis. Monitors observed “children with diseases like leukemia [or] on the autism spectrum … suffering immensely from missing needed therapies and the harsh conditions”.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;lack of hygiene products&lt;/strong&gt;&lt;strong&gt;:&lt;/strong&gt; Apart from liquid hand soap, which reportedly can cause rashes and hives, shampoo and body soap must be paid for.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;emotional abuse&lt;/strong&gt;&lt;strong&gt;:&lt;/strong&gt; Mothers gave accounts such as “I am not allowed to hold my husband’s hand anywhere … there is no place where we can … speak privately”.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;poor education&lt;/strong&gt;&lt;strong&gt;:&lt;/strong&gt; School takes place just one hour daily for each age group and typically constitutes drawing, painting and worksheets, but little real teaching.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;self-harm&lt;/strong&gt;&lt;strong&gt;:&lt;/strong&gt; One parent said his son’s exhaustion, distress and anxiety over continued detention led him to start “throwing himself against the floor and getting bruises”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/28/ice-detention-texas-children\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}