{
  "updatedAt": "2025-10-26T18:34:40.309Z",
  "items": [
    {
      "title": "Trump, Long Erratic on the World Stage, Reaches a New Level",
      "url": "https://www.nytimes.com/2025/10/26/us/politics/trump-erratic-foreign-policy.html",
      "summary": "Whether because of his increasingly mercurial approach or despite it, President Trump has won some foreign policy victories in his second term. The question now is whether he can build on his record."
    },
    {
      "title": "Newsom Says He Will Consider a 2028 Presidential Run After the Midterms",
      "url": "https://www.nytimes.com/2025/10/26/us/politics/gavin-newsom-2028-race.html",
      "summary": "The California governor acknowledged in an interview Sunday on CBS that he would give the question serious thought after the 2026 elections."
    },
    {
      "title": "‘No Idea How Long People Can Hold Out’: Federal Workers Feel Brunt of Shutdown",
      "url": "https://www.nytimes.com/2025/10/26/us/politics/federal-workers-shutdown-pay.html",
      "summary": "As more than one million government employees go without pay, many are turning to side jobs and food banks to make ends meet."
    },
    {
      "title": "Trump and Xi Could ‘Consummate’ TikTok Deal This Week, Bessent Says",
      "url": "https://www.nytimes.com/2025/10/26/us/politics/trump-xi-tiktok-deal-bessent.html",
      "summary": "Treasury Secretary Scott Bessent said on “Face the Nation” on Sunday that China and the United States had reached “a final deal on TikTok,” but offered few details."
    },
    {
      "title": "Halloween Season Is Here. Bring on the Horror.",
      "url": "https://www.nytimes.com/2025/10/26/us/halloween-season-is-here-bring-on-the-horror.html",
      "summary": "Why are scary movies doing so well right now?"
    },
    {
      "title": "What Voters Think of Trump’s White House Ball",
      "url": "https://www.nytimes.com/2025/10/26/us/politics/trump-white-house-ballroom-voters-reaction.html",
      "summary": "There is outrage. But also optimism. And then there is the question: Given everything else going on, why now?"
    },
    {
      "title": "One killed and six injured after shooting at Pennsylvania’s Lincoln University",
      "url": "https://www.theguardian.com/us-news/2025/oct/26/pennsylvania-lincoln-university-shooting",
      "summary": "&lt;p&gt;One armed person detained as historically Black school shooting comes amid rising violence at homecoming events&lt;/p&gt;&lt;p&gt;At least one person was killed and six others wounded in a shooting at Lincoln University in &lt;a href=\"https://www.theguardian.com/us-news/pennsylvania\"&gt;Pennsylvania&lt;/a&gt; late on Saturday, as students and alumni celebrated homecoming at outdoor festivities at the historically Black university, authorities said.&lt;/p&gt;&lt;p&gt;A person who had a firearm was detained, and officials are investigating the possibility that there was more than one shooter but don’t believe there is any active threat to the campus, Chester county’s district attorney, Christopher de Barrena-Sarobe, said during a brief news conference early on Sunday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/26/pennsylvania-lincoln-university-shooting\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Gavin Newsom confirms he is considering 2028 presidential run",
      "url": "https://www.theguardian.com/us-news/2025/oct/26/gavin-newsom-2028-presidential-race",
      "summary": "&lt;p&gt;Democratic California governor and high-profile Trump critic plans to make decision after 2026 midterms&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/gavin-newsom\"&gt;Gavin Newsom&lt;/a&gt;, &lt;a href=\"https://www.theguardian.com/us-news/california\"&gt;California&lt;/a&gt;’s Democratic governor, &lt;a href=\"https://www.cbsnews.com/news/newsom-says-he-will-consider-white-house-run-after-2026-elections/?linkId=872056531\"&gt;told &lt;/a&gt;CBS News Sunday Morning he plans to make a decision on whether to run for president in 2028 once the 2026 midterm elections are over.&lt;/p&gt;&lt;p&gt;“Yeah, I’d be lying otherwise,” Newsom said in response to a question on whether he would give serious thought to a White House bid after the 2026 elections. “I’d just be lying. And I’m not – I can’t do that.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/26/gavin-newsom-2028-presidential-race\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}