{
  "updatedAt": "2025-09-22T13:37:10.685Z",
  "items": [
    {
      "title": "Dominican Republic Says It Recovered Cocaine From Boat Struck by U.S.",
      "url": "https://www.nytimes.com/2025/09/22/us/dominican-republic-cocaine-speedboat-us-navy.html",
      "summary": "The Dominican Republic said it was the first time it had carried out a joint operation against “narcoterrorism” in the Caribbean with the United States."
    },
    {
      "title": "Hillary Clinton Sees a Dangerous Moment for Women’s Rights, and Democracy",
      "url": "https://www.nytimes.com/2025/09/22/us/politics/hillary-clinton-womens-rights-trump.html",
      "summary": "With her rallying cry for gender equality turning 30 this year, Mrs. Clinton says President Trump and autocratic leaders abroad are steadily dismantling decades of progress."
    },
    {
      "title": "4 Takeaways From the Charlie Kirk Memorial",
      "url": "https://www.nytimes.com/2025/09/22/us/charlie-kirk-memorial-takeaways.html",
      "summary": "High-profile conservative speakers, including President Trump, addressed a packed stadium in Arizona. Erika Kirk forgave her husband’s killer."
    },
    {
      "title": "Behind Charlie Kirk’s Spiritual Journey That Fused Christianity and Politics",
      "url": "https://www.nytimes.com/2025/09/22/us/charlie-kirk-christian-faith-politics.html",
      "summary": "Sunday’s memorial showcased how Mr. Kirk’s experience dovetailed with the broader story of American evangelicalism over the past decade."
    },
    {
      "title": "Republican Redistricting Is Sowing Chaos in Houston",
      "url": "https://www.nytimes.com/2025/09/22/us/politics/texas-redistricting-houston.html",
      "summary": "Texas Republicans redrew the lines for House races in 2026. For one Houston district, that means two elections in the next few months using two different maps, with a generational fight to come."
    },
    {
      "title": "12 Emotional Hours: A Spectator’s Full Day at the Kirk Memorial (Without Caffeine)",
      "url": "https://www.nytimes.com/2025/09/21/us/politics/spectator-long-day.html",
      "summary": "Attending the event involved lots of standing, worrying and waiting. But for one Colorado Springs woman, it was all worth it."
    },
    {
      "title": "Trump hails Charlie Kirk as ‘a martyr for America’s freedom’ at memorial – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
      "summary": "&lt;p&gt;President’s message that he ‘hates’ his opponents contrasts with Erika Kirk’s forgiveness of the man charged with killing her husband&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/21/thousands-gather-at-charlie-kirk-memorial-in-arizona-where-trump-to-pay-tribute-to-slain-organizer\"&gt;Trump says he hates his opponents at Charlie Kirk’s memorial&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Per my last post, it’s important to underscore that &lt;strong&gt;autism has been a focus for Kennedy&lt;/strong&gt;. Earlier this month, the Wall Street Journal &lt;a href=\"https://www.wsj.com/health/healthcare/rfk-jr-hhs-to-link-autism-to-tylenol-use-in-pregnancy-and-folate-deficiencies-e3acbb4c?gaa_at=eafs&amp;amp;gaa_n=ASWzDAhwJUrTkQQKbf3fCPdx7a164OXbN3bA3HHVYMK1BmPXirXKdNsVALYTST5ieD8%3D&amp;amp;gaa_ts=68d146ed&amp;amp;gaa_sig=1YrB1_HneQxFDdL6Iz82R1yFPTDUITrQ991UFvw7hlf3GcuaXlh6Tq2SIVnB6tq-dwU4LO2n-laPq65v0IBmQA%3D%3D\"&gt;reported&lt;/a&gt; that Kennedy planned to announce that use of Tylenol by pregnant women was potentially linked to &lt;a href=\"https://www.theguardian.com/society/autism\"&gt;autism&lt;/a&gt; spectrum disorder. Kennedy has claimed that the US is in the grip of an “autism epidemic” fuelled by “environmental toxins”.&lt;/p&gt;&lt;p&gt;A reminder that the &lt;strong&gt;American &lt;/strong&gt;&lt;strong&gt;College of Obstetrics and Gynecology &lt;/strong&gt;(ACOG) says there’s “no clear evidence” linking “prudent” use of acetaminophen to issues with fetal development.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Documents offer rare insight on Ice’s close relationship with Palantir",
      "url": "https://www.theguardian.com/us-news/ng-interactive/2025/sep/22/ice-palantir-data",
      "summary": "&lt;p&gt;For years, little was known about the multibillion-dollar company that handles data for the US immigration enforcement agency. Now, a cache of emails, training documents and reports sheds light on how Palantir helps Ice with investigations and on-the-ground enforcement &lt;/p&gt;&lt;p&gt;Over the past decade, the US Immigration and Customs Enforcement agency (&lt;a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\"&gt;Ice&lt;/a&gt;) has amassed millions of data points that it uses to identify and track its targets – from social media posts to location history and, most recently, tax information.&lt;/p&gt;&lt;p&gt;And there’s been one, multibillion-dollar tech company particularly instrumental in enabling Ice to put all that data to work: &lt;a href=\"https://www.theguardian.com/technology/palantir\"&gt;Palantir&lt;/a&gt;, the data analytics firm co-founded by &lt;a href=\"https://www.theguardian.com/technology/peter-thiel\"&gt;Peter Thiel&lt;/a&gt;, the rightwing mega-donor and tech investor.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/sep/22/ice-palantir-data\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}