{
  "updatedAt": "2025-10-31T12:55:16.199Z",
  "items": [
    {
      "title": "Some of Trump’s Favorite Things on Asia Trip: A Crown and ‘Vicious’ Weapons",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/trump-south-korea-china-trade.html",
      "summary": "President Trump traveled to Asia to be a statesman, a showman and a traveling salesman, depending on the audience."
    },
    {
      "title": "A Legal Blizzard in Texas Targets Democrats and Promotes Ken Paxton",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/ken-paxton.html",
      "summary": "The Texas attorney general has escalated the pace of high-profile legal actions, raising concern that his Senate campaign is influencing his law enforcement work."
    },
    {
      "title": "The Debate Dividing the Supreme Court’s Liberal Justices",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/supreme-court-kagan-jackson-liberal-justices.html",
      "summary": "Outnumbered and facing vast stakes, Justices Kagan and Jackson are split over the best approach: investing in diplomacy inside the court or sounding the alarm outside."
    },
    {
      "title": "Trump Calls on Republicans to End Filibuster in Shutdown Fight",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/trump-filibuster-shutdown.html",
      "summary": "The president said it was time for G.O.P. leaders to get rid of the longstanding rule that means most Senate legislation needs 60 votes to pass."
    },
    {
      "title": "Air Traffic Controller Staff Shortage Causes Delays in Orlando and at Other Airports",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/orlando-air-traffic-control-airports-shutdown.html",
      "summary": "The F.A.A. warned that a lack of certified air traffic controllers in Orlando could cause delays throughout the East Coast."
    },
    {
      "title": "Enslaved Potter’s Art, Displayed at Boston Museum, Returns to Heirs at Last",
      "url": "https://www.nytimes.com/2025/10/30/us/mfa-boston-david-drake-pottery.html",
      "summary": "The Museum of Fine Arts, Boston, said David Drake, the artist, had been “deprived of his creations involuntarily and without compensation.”"
    },
    {
      "title": "Trump calls for Senate to scrap filibuster in order to force end to month-long government shutdown – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
      "summary": "&lt;p&gt;Snap food benefits are set to run out this weekend as shutdown comes close to matching the record of 2018-2019&lt;/p&gt;&lt;p&gt;House Republicans are increasingly expressing frustration with the chamber’s moribund activity and the legislative backlog piling up as speaker Mike Johnson of Louisiana keeps Congress out of session during the government shutdown.&lt;/p&gt;&lt;p&gt;Rep. Marjorie Taylor Greene (R-Ga.) confronted speaker the speaker during a House GOP conference call to criticize his tactics to negotiate the shutdown, according to a piece in &lt;a href=\"https://thehill.com/homenews/house/5582283-republicans-house-shutdown-recess-johnson/\"&gt;The Hill&lt;/a&gt; today.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Kristi Noem denies request to halt immigration crackdown for Halloween",
      "url": "https://www.theguardian.com/us-news/2025/oct/31/kristi-noem-halloween-immigration-illinois",
      "summary": "&lt;p&gt;Illinois governor had asked for pause after border patrol agents reportedly used teargas to disrupt Halloween parade&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates\"&gt;US politics live – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/kristi-noem\"&gt;Kristi Noem&lt;/a&gt;, secretary of the Department of Homeland Security, has said she will not suspend the government’s aggressive immigration crackdown in Illinois over Halloween, denying a request from the state’s governor to enjoy the holiday “without fear”.&lt;/p&gt;&lt;p&gt;JB Pritzker, the Illinois governor, &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/30/illinois-ice-halloween-jb-pritzker\"&gt;wrote to Noem&lt;/a&gt; earlier this week, asking for a pause after border patrol agents reportedly used teargas &lt;a href=\"https://abcnews.go.com/US/border-patrol-agents-fire-allegedly-disrupting-childrens-halloween/story?id=126900354\"&gt;to disrupt a Halloween parade&lt;/a&gt; last Saturday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/31/kristi-noem-halloween-immigration-illinois\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}