{
  "updatedAt": "2025-09-09T13:42:02.011Z",
  "items": [
    {
      "title": "Missouri House Set to Vote on Map That Boosts Republicans",
      "url": "https://www.nytimes.com/2025/09/09/us/missouri-congressional-redistricting-kansas-city.html",
      "summary": "Republicans want to redraw congressional districts and increase their party’s chances of flipping a seat long held by a Democrat in the Kansas City area."
    },
    {
      "title": "James Talarico Joins Senate Campaign in Texas",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/talarico-texas-senate.html",
      "summary": "State Representative James Talarico, who is studying to become a Presbyterian pastor, has sparred with Fox News hosts and bantered with Joe Rogan. Now he wants Senator John Cornyn’s seat."
    },
    {
      "title": "Get to Know Chicago’s Immigrant Community, Target of Trump’s Crackdown",
      "url": "https://www.nytimes.com/2025/09/09/us/chicago-immigrant-population-trump-ice.html",
      "summary": "Almost 40 percent of immigrants living in Chicago are from Mexico. More than 800,000 of the city’s 2.7 million residents identify as Hispanic or Latino."
    },
    {
      "title": "Trump Administration Quietly Seeks to Build National Voter Roll Using State Data",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/trump-voter-registration-data.html",
      "summary": "In a quest to bolster a long-running claim from President Trump concerning undocumented immigrants illegally voting, the Justice Department is seeking detailed voter roll data from over 30 states."
    },
    {
      "title": "How New York Police Officers Avoid Drunk Driving Charges",
      "url": "https://www.nytimes.com/2025/09/09/us/new-york-state-police-drunk-driving.html",
      "summary": "Officers in New York State crashed their official vehicles, hit other motorists and arrived to work reeking of alcohol. And yet, they sometimes evaded criminal punishment, an investigation found."
    },
    {
      "title": "How We Obtained 10,000 Police Disciplinary Records",
      "url": "https://www.nytimes.com/2025/09/09/us/new-york-state-police-records.html",
      "summary": "The New York Times and New York Focus gathered thousands of files from around half of New York State’s nearly 500 law enforcement agencies."
    },
    {
      "title": "Birthday note apparently from Trump to Epstein branded ‘sickening’ – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news",
      "summary": "&lt;p&gt;White House officials seek to discredit note and claim Donald Trump signature is false&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/08/trump-epstein-birthday-letter\"&gt;House committee release picture of apparent Trump birthday note to Epstein&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;My colleague, &lt;strong&gt;Oliver Holmes&lt;/strong&gt;, has been &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/09/epstein-50th-birthday-book-who-is-in-it-and-what-did-they-say-donald-trump-bill-clinton-peter-mandelson\"&gt;going through the Jeffrey Epstein 50th birthday album&lt;/a&gt; that House Democrats on the oversight committee released on Monday, after they subpoenaed Epstein’s estate.&lt;/p&gt;&lt;p&gt;As Oliver notes, much of the book seems to be a collection of flattering and celebratory letters – often highly sexualised – from people who knew Epstein. They include photos of him embracing women in bikinis whose faces were redacted, and others showing scenes featuring wild animals having sex.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Bill Clinton&lt;/strong&gt;, who had left the US presidency a couple years before the publication of the book, is listed in the “friends” section.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Peter Mandelson&lt;/strong&gt;, the current UK ambassador to the United States, called Epstein his “best pal”. There are also photographs in the book which show Mandelson in shorts gazing from a balcony and in a white dressing gown laughing with Epstein.&lt;/p&gt;&lt;p&gt;One of the most striking images in the collection is a drawing of Epstein handing young girls balloons and a lollipop in 1983, alongside another drawing of him 20 years later, receiving a massage from topless women in 2003.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US drug dealer afforded clemency by Trump found guilty of parole violation",
      "url": "https://www.theguardian.com/us-news/2025/sep/09/new-york-drug-dealer-trump",
      "summary": "&lt;p&gt;Jonathan Braun of New York faces up to five years after he was arrested and charged in connection to recent crimes&lt;/p&gt;&lt;p&gt;A convicted &lt;a href=\"https://www.theguardian.com/us-news/new-york\"&gt;New York&lt;/a&gt; drug dealer whose federal prison sentence was &lt;a href=\"https://www.theguardian.com/us-news/2021/jan/20/trump-pardons-and-commutations-the-full-list\"&gt;commuted&lt;/a&gt; by &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; during Trump’s first presidency has been found guilty of violating the terms of his release after being arrested and charged in connection with several recent crimes.&lt;/p&gt;&lt;p&gt;Jonathan Braun now faces up to five years in prison during a sentencing hearing tentatively scheduled for 9 October.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/09/new-york-drug-dealer-trump\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}