{
  "updatedAt": "2025-10-11T06:33:53.758Z",
  "items": [
    {
      "title": "Trump Administration Lays Off Dozens of C.D.C. Officials",
      "url": "https://www.nytimes.com/2025/10/11/us/politics/trump-administration-cdc-layoffs.html",
      "summary": "“Disease detectives,” high-ranking scientists, the entire Washington office and the staff of a weekly public health journal were among those who learned late Friday that they would lose their jobs."
    },
    {
      "title": "Judge Signals She Is Likely to Order Abrego Garcia’s Release Soon",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/abrego-garcia-hearing.html",
      "summary": "The judge expressed frequent frustrations with the Trump administration, saying it had presented a “totally inconsistent” case to keep the Maryland man in immigration detention."
    },
    {
      "title": "Bucksnort, Tenn., is a tight-knit community where neighbors help one another.",
      "url": "https://www.nytimes.com/live/2025/10/10/us/explosion-tennessee/bucksnort-tenn-is-a-tight-knit-community-where-neighbors-help-one-another",
      "summary": ""
    },
    {
      "title": "The Trump Split Screen: A Peacemaker Abroad, a Retribution Campaign at Home",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/trump-peace-retribution.html",
      "summary": "President Trump’s dueling personas were on display this week, providing endless ammunition to his allies and his enemies alike."
    },
    {
      "title": "Boston Prosecutors Invoke Law Used Against Anarchists to Charge Protesters",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/boston-protesters-anarchists-national-guard.html",
      "summary": "The charges are an indication that Boston’s mayor and Police Department are telegraphing to President Trump that they’re going to come down hard on civil unrest."
    },
    {
      "title": "Here are some other factory explosions in American history.",
      "url": "https://www.nytimes.com/live/2025/10/10/us/explosion-tennessee/here-are-some-other-factory-explosions-in-american-history",
      "summary": ""
    },
    {
      "title": "After uproar, Pete Hegseth clarifies Qatari air force facility in Idaho is not a foreign base – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Earlier, Pentagon chief shared that location would host ‘contingent of Qatari F-15s and pilots’. This blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/10/federal-workers-pay-government-shutdown\"&gt;White House announces federal worker layoffs as government shutdown nears third week&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;As the shutdown enters its 10th day, and both chambers are out of session today, House speaker &lt;strong&gt;Mike Johnson&lt;/strong&gt; has defended not passing a separate bill that would keep members of the military paid throughout the shutdown.&lt;/p&gt;&lt;p&gt;“Republicans have voted to OPEN the government and get our troops, Border Patrol, TSA, and veterans PAID,” Johnson said, before blaming Democratic leadership for refusing to pass the House-passed continuing resolution. “Chuck Schumer is terrified of a challenge from the Marxist left – so he and the Democrats voted to CLOSE the government-and to STOP PAYCHECKS from being issued.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump completes ‘semiannual’ physical before traveling to Middle East",
      "url": "https://www.theguardian.com/us-news/2025/oct/10/trump-physical-walter-reed",
      "summary": "&lt;p&gt;White House had described doctor visit as ‘routine yearly checkup’ although president had annual physical in April&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; – the oldest person ever to be elected US president – had what he has described as a “semiannual physical” at the Walter Reed national military medical center on Friday.&lt;/p&gt;&lt;p&gt;The visit, which the White House announced earlier this week, comes as Trump is preparing to travel to the Middle East on the heels of a ceasefire deal in the &lt;a href=\"https://www.theguardian.com/world/israel-hamas-war\"&gt;Israel-Hamas war&lt;/a&gt;. The White House press secretary, Karoline Leavitt, described it as a “routine yearly checkup”, although the president had his annual physical in April.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/10/trump-physical-walter-reed\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}