{
  "updatedAt": "2025-10-03T06:36:10.390Z",
  "items": [
    {
      "title": "Large Fire Burns at Chevron Refinery in El Segundo",
      "url": "https://www.nytimes.com/2025/10/03/us/el-segundo-refinery-fire-chevron.html",
      "summary": "It was not immediately clear what caused the blast. But the blaze, near Los Angeles, could be seen from miles away."
    },
    {
      "title": "Apple Takes Down ICE Tracking Apps Amid Trump Pressure Campaign",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/apple-iceblock-app-store-trump.html",
      "summary": "Trump administration officials have issued several legal threats over ICEBlock, a popular app that allows users to alert others to the presence of nearby immigration agents."
    },
    {
      "title": "Trump Escalates Attacks on Democrats in a Government Shutdown Like No Other",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/shutdown-trump-clinton-gingrich.html",
      "summary": "Shutdowns are always unpleasant affairs. But President Trump has used his power in aggressive and strikingly personal ways."
    },
    {
      "title": "What Women Heard in Hegseth’s Remarks About Physical Standards",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/women-military-hegseth-physical-standards.html",
      "summary": "The defense secretary raised the issue suggesting women were getting into combat not because they met high standards, but because they were given a pass."
    },
    {
      "title": "Trump Asked Universities to Sign a Compact. Some See a Trap.",
      "url": "https://www.nytimes.com/2025/10/02/us/trump-universities-compact-funding.html",
      "summary": "Trump officials want universities to sign on to conservative priorities to get special treatment. Some in higher education say agreeing would end academic freedom."
    },
    {
      "title": "Trump Name-Checks Project 2025 as He Threatens to Dismantle Agencies",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/trump-project-2025-vought.html",
      "summary": "President Trump, who once insisted he had “nothing to do with Project 2025,” has implemented many of the proposals from the right-wing policy document."
    },
    {
      "title": "Large fire breaks out at el Segundo refinery in Los Angeles – reports",
      "url": "https://www.theguardian.com/us-news/2025/oct/03/large-fire-breaks-out-at-el-segundo-refinery-in-los-angeles",
      "summary": "&lt;p&gt;Emergency services attending scenes after receiving multiple reports of an explosion, according to US media&lt;/p&gt;&lt;p&gt;A large fire has broken out at Chevron’s El Segundo refinery in Los Angeles county in California, according to US media reports.&lt;/p&gt;&lt;p&gt;The blaze began on Thursday night, after emergency services received reports of an explosion at the site, according to CBS news. The cause is unclear.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/03/large-fire-breaks-out-at-el-segundo-refinery-in-los-angeles\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "My travels through Chicago: tear gas, resistance and Trump’s big immigration crackdown",
      "url": "https://www.theguardian.com/us-news/2025/oct/03/my-travels-through-chicago-tear-gas-resistance-and-trumps-big-immigration-crackdown",
      "summary": "&lt;p&gt;Donald Trump recently launched ‘Operation Midway Blitz’ in the city and threatened to send in the National Guard. The mood is febrile, with fears things could get worse&lt;/p&gt;&lt;p&gt;At 5am on a warm September morning a small crowd of protesters assembles in the dark. They are gathering outside the Broadview immigration processing centre, a two-storey brick structure in the Chicago suburbs that has the ambience of a US outpost in a foreign war. Windows are boarded with plywood. Fences are lined with razor wire and black cloth."
    }
  ]
}