{
  "updatedAt": "2025-10-27T18:37:48.438Z",
  "items": [
    {
      "title": "Trump’s China Deal May Avert a Crisis of His Own Making",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/trump-china-trade-deal-talks.html",
      "summary": "The Trump administration is hailing a potential deal that may return the U.S.-China relationship to where it was before the president began a trade war against Beijing."
    },
    {
      "title": "Trump Gives Mexico More Time to Change Trade Policies and Avoid Tariffs",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/trump-mexico-trade-tariff-negotiations.html",
      "summary": "Taxes on goods from Mexico had been set to go into effect at the end of the week."
    },
    {
      "title": "A West Texas Children’s Clinic Where Vaccine Suspicion Is Encouraged",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/antivax-clinic-texas.html",
      "summary": "Parents who come to Pia Habersang’s practice in Amarillo shun vaccinations, with the encouragement of the clinic’s nurse practitioner; the health secretary, Robert F. Kennedy Jr.; and President Trump."
    },
    {
      "title": "Virginia Democrats to Begin Redistricting Votes in Latest Battle for Congress",
      "url": "https://www.nytimes.com/2025/10/27/us/virginia-redistricting-vote.html",
      "summary": "State lawmakers are convening to take a vote that would allow redistricting before next year’s midterms, though the process would take months."
    },
    {
      "title": "Trump Says a Recent M.R.I. Scan Was ‘Perfect,’ and He’d ‘Love’ a Third Term",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/trump-mri-third-term.html",
      "summary": "President Trump made the comments on the second day of his trip to Asia. The Constitution limits presidents to two terms, but Mr. Trump has suggested he might try to circumvent it."
    },
    {
      "title": "Carney of Canada Says He’ll Meet Xi of China",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/carney-xi-meeting-china-canada.html",
      "summary": "The meeting between Prime Minister Mark Carney of Canada and Xi Jinping, China’s top leader, scheduled for later this week, appeared to signal a pivot to Asia after decades of poor relations between his country and Beijing."
    },
    {
      "title": "Trump comments about a third term spark concern – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/27/donald-trump-japan-sanae-takaichi-asia-canada-trade-news-updates-us-politics-live",
      "summary": "&lt;p&gt;US president’s musings about an unconstitutional third term in office draw criticism from Democratic congresswoman&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/oct/27/donald-trump-third-term-vice-president\"&gt;Trump ‘would love’ unconstitutional third term but rules out running for VP&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;As Republican states launch more redistricting efforts, Democrats in blue states are still deciding how or if they will respond.&lt;/p&gt;&lt;p&gt;House minority leader &lt;strong&gt;Hakeem Jeffries is said to be headed to Illinois today&lt;/strong&gt; to meet with local leaders about redrawing the congressional maps. &lt;a href=\"https://punchbowl.news/article/campaigns/jeffries-ill-push/\"&gt;Punchbowl reports&lt;/a&gt; that Jeffries will meet with the Illinois Legislative Black caucus and Black members of Congress, a nod to the fact that Black lawmakers will be needed to pass a new map.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/27/donald-trump-japan-sanae-takaichi-asia-canada-trade-news-updates-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Republican Indiana governor calls special session to redraw congressional maps",
      "url": "https://www.theguardian.com/us-news/2025/oct/27/indiana-congressional-maps-redisctricting-governor",
      "summary": "&lt;p&gt;GOP-led state is latest that Trump administration has put pressure on to undertake redistricting to favor Republicans&lt;/p&gt;&lt;p&gt;The &lt;a href=\"https://www.theguardian.com/us-news/indiana\"&gt;Indiana&lt;/a&gt; governor, Mike Braun, announced on Monday that he is calling a special session to consider redrawing congressional districts in the state, the latest state to work on its maps ahead of 2026.&lt;/p&gt;&lt;p&gt;Indiana is one of several Republican-led states that the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; has put pressure on to undertake mid-decade redistricting to favor Republicans, which began with a push in Texas to redraw lines to add Republican seats.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/27/indiana-congressional-maps-redisctricting-governor\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}