{
  "updatedAt": "2025-11-10T18:37:42.217Z",
  "items": [
    {
      "title": "Jeanne Shaheen Faces Shutdown Blowback From Her Daughter",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/jeanne-shaheen-stefany-shutdown-deal.html",
      "summary": "Senator Jeanne Shaheen of New Hampshire voted to move to end the shutdown. But her daughter Stefany Shaheen, a congressional candidate in their state, sharply criticized the deal."
    },
    {
      "title": "Supreme Court to Hear Major Challenge to Mail-In Ballot Laws",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/supreme-court-mail-ballots-mississippi.html",
      "summary": "The justices agreed to hear a challenge to Mississippi’s law, a case that could upend similar measures in dozens of states before the 2026 election."
    },
    {
      "title": "Supreme Court Denies Request to Revisit Same-Sex Marriage Decision",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/supreme-court-same-sex-marriage.html",
      "summary": "Kim Davis, a Kentucky county clerk who refused to issue same-sex marriage licenses, had asked the court to reconsider its landmark 2015 opinion."
    },
    {
      "title": "Bernie Sanders Endorses Peggy Flanagan for Senate in Minnesota",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/bernie-sanders-peggy-flanagan-michigan-senate-endorsement.html",
      "summary": "Senator Bernie Sanders is backing Lt. Gov. Peggy Flanagan in her state’s Democratic primary race for Senate, his latest attempt to pull the party to the left."
    },
    {
      "title": "U.S. Military Kills 6 in Strikes on Suspected Drug Boats, Hegseth Says",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/us-boat-strike-deaths-hegseth.html",
      "summary": "The latest strikes raised the death toll in the campaign to 76 people in 19 attacks in the Pacific and the Caribbean Sea since early September."
    },
    {
      "title": "Appeals Court Blocks Trump’s Attempt to Withhold Full SNAP Funding",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/appeals-court-trump-snap-funding-shutdown.html",
      "summary": "But the administration indicated it might not be necessary, as Congress inched toward a deal to fund the government."
    },
    {
      "title": "Senate Democrats defend breaking ranks to end shutdown as Mike Johnson signals speedy House return - US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/10/us-government-shutdown-record-donald-trump-syria-president-ahmed-al-sharaa-rudy-giuliani-pardon-politics-live-news-updates",
      "summary": "&lt;p&gt;Decision to advance bill that would reopen government has sparked furor from party and base; House speaker says he will call lawmakers back as soon as Senate holds final vote&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/10/senate-democrats-government-shutdown-vote\"&gt;Senate Democrats who defected in shutdown vote: ‘This was the only deal’&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The eight Democratic and Independent senators who broke ranks with the party to advance a bill that would end the government shutdown –&amp;nbsp;the longest in US history – have defended their decisions amid furor from their party and base.&lt;/p&gt;&lt;p&gt;“What happened tonight is not the closing of a chapter. It’s the opening of an opportunity. What the chapter does close is the damaging shutdown that is only getting worse, that is only going to impact more and more people,”&lt;em&gt; &lt;/em&gt;said &lt;strong&gt;Angus King&lt;/strong&gt;, the Independent lawmaker from Maine who caucuses with Democrats.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/10/us-government-shutdown-record-donald-trump-syria-president-ahmed-al-sharaa-rudy-giuliani-pardon-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "‘We need this food’: Las Vegas teens on hunger and anxiety amid Snap cuts",
      "url": "https://www.theguardian.com/us-news/2025/nov/10/food-stamps-snap-benefits-teens-las-vegas",
      "summary": "&lt;p&gt;Children may not understand politics of shutdown, but fear of future hunger can affect young brains, research reveals&lt;/p&gt;&lt;p&gt;On Halloween, neighbors in the downtown &lt;a href=\"https://www.theguardian.com/us-news/las-vegas\"&gt;Las Vegas&lt;/a&gt; area of Huntridge gave out bags of nonperishable meal bags along with the usual trick-or-treat candy. The bag contained ingredients to make a quick chickpea curry: cans of garbanzo beans, coconut milk, crushed tomatoes, chicken, Thai seasoning and jasmine rice. Child-friendly bags held shelf-stable milk, cereals, cheese and crackers, cups of mac and cheese and meat sticks. A fancied-up ramen bag came with tinned BBQ pork, stir-fry vegetables and crunchy chow mein noodles. There were six different dinners in all.&lt;/p&gt;&lt;p&gt;The neighbors knew that shelf-stable food wouldn’t replace Supplemental Nutrition Assistance Program (&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/10/snap-workers-trump-administration-funding\"&gt;Snap&lt;/a&gt;) benefits, commonly known as food stamps, or &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/01/food-banks-stock-resources-snap-lapse\"&gt;food bank&lt;/a&gt; supplies.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/10/food-stamps-snap-benefits-teens-las-vegas\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}