{
  "updatedAt": "2025-11-29T06:38:00.331Z",
  "items": [
    {
      "title": "State Department Boosts Resources to Process Business Visas for South Koreans",
      "url": "https://www.nytimes.com/2025/11/29/us/politics/state-dept-south-korea-visas.html",
      "summary": "The Trump administration has been trying to repair the damage from the detention of hundreds of South Koreans in an immigration raid in Georgia."
    },
    {
      "title": "Northwestern Agrees to Deal With Trump Administration",
      "url": "https://www.nytimes.com/2025/11/28/us/politics/northwestern-deal-trump-administration.html",
      "summary": "The university will pay $75 million to regain its research funding and end investigations, the second highest payment by a school facing pressure from the administration."
    },
    {
      "title": "Two West Virginia Communities Bound Together by Grief",
      "url": "https://www.nytimes.com/2025/11/28/us/national-guard-shooting-west-virginia.html",
      "summary": "Red ribbons adorned one city, while blue ribbons hung in another town — all to honor the National Guard members who were attacked in Washington this week."
    },
    {
      "title": "Trump Pauses All Asylum Applications and Halts Visas for Afghans",
      "url": "https://www.nytimes.com/2025/11/28/us/politics/trump-affirmative-asylum.html",
      "summary": "They were the latest restrictive changes to the immigration system after this week’s shooting of two National Guard members."
    },
    {
      "title": "Trump Spoke by Phone Last Week With Maduro, Venezuela’s Leader",
      "url": "https://www.nytimes.com/2025/11/28/us/politics/trump-spoke-by-phone-last-week-with-maduro-venezuelas-leader.html",
      "summary": "They discussed a possible meeting between the two of them, but nothing has been scheduled, and the administration continues to increase the military pressure on Venezuela."
    },
    {
      "title": "Trump’s Response to Shooting Shows Intensified Anti-Migrant Stance",
      "url": "https://www.nytimes.com/2025/11/28/us/politics/trumps-response-to-shooting-shows-intensified-anti-migrant-stance.html",
      "summary": "The president is furiously demanding limits on migration and attacking ethnic groups as he steps up his efforts to equate immigration with crime and economic distress."
    },
    {
      "title": "US halts all asylum decisions after National Guard shooting",
      "url": "https://www.theguardian.com/us-news/2025/nov/29/us-halts-all-asylum-decisions-after-national-guard-shooting",
      "summary": "&lt;p&gt;Trump administration says decisions paused until government can ensure ‘every alien is vetted and screened to the maximum degree possible’&lt;/p&gt;&lt;p&gt;The Trump administration has announced it is halting all asylum decisions in the wake of the National Guard &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/26/national-guard-soldiers-shot-washington-dc\"&gt;shooting in Washington DC&lt;/a&gt;, according to a senior immigration official.&lt;/p&gt;&lt;p&gt;Joseph Edlow, the director of US Citizenship and Immigration Services, said in a post on X on Friday that asylum decisions would be paused “until we can ensure that every alien is vetted and screened to the maximum degree possible”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/29/us-halts-all-asylum-decisions-after-national-guard-shooting\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "What is an autopen and why can’t Trump stop talking about it?",
      "url": "https://www.theguardian.com/us-news/2025/nov/29/what-is-an-autopen-and-why-cant-trump-stop-talking-about-it",
      "summary": "&lt;p&gt;The first autopen was patented in the 1800s and has been used by many American presidents&lt;/p&gt;&lt;p&gt;On Friday, Donald Trump claimed that he will reverse everything that Joe Biden has signed with an autopen.&lt;/p&gt;&lt;p&gt;The automated signature machine has been a tool used by presidents at the White House for decades.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/29/what-is-an-autopen-and-why-cant-trump-stop-talking-about-it\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}