{
  "updatedAt": "2025-11-19T12:57:05.699Z",
  "items": [
    {
      "title": "Comey’s Lawyers Head to Court to Argue Vindictive Prosecution by Trump",
      "url": "https://www.nytimes.com/2025/11/19/us/politics/comey-vindictive-prosecution-trump.html",
      "summary": "James B. Comey’s lawyers are expected to argue that the Justice Department effectively allowed itself to be taken captive by the president’s desire for political revenge."
    },
    {
      "title": "As Border Patrol Floods North Carolina, Charlotte Asks, ‘Why Us?’",
      "url": "https://www.nytimes.com/2025/11/19/us/as-border-patrol-floods-north-carolina-charlotte-asks-why-us.html",
      "summary": "Federal officials say they have arrested more than 200 people in Charlotte, shaking a budding metropolis far from any border that has welcomed waves of immigrants for decades."
    },
    {
      "title": "Venezuela Doesn’t Produce Fentanyl. Trump Is Targeting It Anyway.",
      "url": "https://www.nytimes.com/2025/11/19/us/politics/trump-venezuela-fentanyl.html",
      "summary": "Lawmakers and narcotics experts say that the Trump administration’s efforts to tie Venezuela to the U.S. fentanyl crisis are misleading."
    },
    {
      "title": "Most Immigrants Support Border Enforcement, but Not Mass Deportations, Poll Finds",
      "url": "https://www.nytimes.com/2025/11/19/us/immigrants-poll-enforcement.html",
      "summary": "A survey by The New York Times and KFF shows that even many of those who support President Trump feel his approach has gone too far."
    },
    {
      "title": "Anxiety Over Trump’s Crackdown Alters Life for Many Immigrants, Poll Finds",
      "url": "https://www.nytimes.com/2025/11/19/us/immigration-poll-trump-crackdown.html",
      "summary": "Months into the Trump deportation campaign, one-third of noncitizens, including about 60 percent of undocumented immigrants, say they are avoiding aspects of daily life."
    },
    {
      "title": "Orthodox Church Pews Are Overflowing With Converts",
      "url": "https://www.nytimes.com/2025/11/19/us/orthodox-christianity.html",
      "summary": "“In the whole history of the Orthodox Church in America, this has never been seen,” a priest said about the surge of young men drawn to the demanding practice of Christianity."
    },
    {
      "title": "US Congress set to formally pass legislation to force release of Epstein files – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/19/us-congress-epstein-files-donald-trump-saudi-arabia-redistricting-latest-news-updates",
      "summary": "&lt;p&gt;Donald Trump could sign Epstein Files Transparency Act as soon as today, with Democrats and Republicans hailing the bravery of Epstein survivors&lt;/p&gt;&lt;p&gt;Former FBI director &lt;strong&gt;James Comey&lt;/strong&gt; is set to return to court on Wednesday, the &lt;a href=\"https://www.washingtonpost.com/national-security/2025/11/19/comey-trump-abuse-power-hearing/\"&gt;Washington Post reports&lt;/a&gt;, where his attorneys will have their first opportunity to argue that &lt;strong&gt;Donald Trump&lt;/strong&gt; unlawfully directed the Justice Department to prosecute him out of spite and revenge.&lt;/p&gt;&lt;p&gt;Comey was charged with lying to Congress in 2020 just days after Trump appeared to urge his attorney general to prosecute the former FBI director and other perceived political enemies. He has pleaded not guilty to the charges, with his attorneys arguing that the charges are an example of vindictive prosecution.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/19/us-congress-epstein-files-donald-trump-saudi-arabia-redistricting-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Owl described as ‘fighter’ set to fly free after falling into cement mixer in Utah",
      "url": "https://www.theguardian.com/us-news/2025/nov/19/owl-flies-free-cement-mixer-utah",
      "summary": "&lt;p&gt;Staff at Best Friends Animal Sanctuary in Kanab spent days cleaning the concrete-covered great horned owl &lt;/p&gt;&lt;p&gt;An owl found partially encased in concrete after it got inside a cement mixer in south-western Utah is expected to fly free again after it was painstakingly cleaned by animal sanctuary workers who described the bird as a “fighter”.&lt;/p&gt;&lt;p&gt;The great horned owl was found at the Black Desert Resort in the south-western part of the state and arrived at the Best Friends Animal Sanctuary in Kanab, Utah, earlier this month with its face, chest and right wing covered in dried concrete. After making sure the bird could breathe, sanctuary workers spent days cracking apart the concrete using forceps and cleaning its feathers using toothbrushes, dish soap and their fingers.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/19/owl-flies-free-cement-mixer-utah\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}