{
  "updatedAt": "2025-11-14T12:55:38.666Z",
  "items": [
    {
      "title": "In a Brutal Mississippi Jail, Inmates Say They Were Enlisted as Enforcers",
      "url": "https://www.nytimes.com/2025/11/14/us/mississippi-jail-inmates-rankin-county.html",
      "summary": "High-ranking inmates known as trusties were ordered to do guards’ bidding, former inmates and guards said, and the culture of violence in the jail went straight to the top."
    },
    {
      "title": "America First? Some Trump Supporters Worry That’s No Longer the Case.",
      "url": "https://www.nytimes.com/2025/11/14/us/politics/trump-supporters-america-first-concerns.html",
      "summary": "President Trump has been dining with billionaires and has taken a keen interest in crises overseas, leading to fears that he is drifting away from his more populist stances."
    },
    {
      "title": "Holiday Décor Uproar at Air Force Base Housing Complex",
      "url": "https://www.nytimes.com/2025/11/14/us/christmas-decorations-tyndall-air-force-base-florida.html",
      "summary": "A routine reminder about holiday lights touched off a spirited debate about rules, joy and what it means to make a home when life is always in motion."
    },
    {
      "title": "Swalwell Denies Allegations of Fraud and Says Trump is Targeting Him",
      "url": "https://www.nytimes.com/2025/11/14/us/politics/trump-mortgage-fraud-eric-swalwell.html",
      "summary": "Representative Eric Swalwell, a Democrat, said he would not back down from his criticism of President Trump, and denied wrongdoing."
    },
    {
      "title": "The Shutdown Is Over. For Many SNAP Recipients, the Scars Remain.",
      "url": "https://www.nytimes.com/2025/11/14/us/shutdown-snap-food-stamps.html",
      "summary": "Some recipients have seen their benefits return but are worried they could still be taken away. Others wonder whether the funding could be stopped again at some point."
    },
    {
      "title": "N.I.H. Worker Who Criticized Trump Health Policies Says She Is on Administrative Leave",
      "url": "https://www.nytimes.com/2025/11/13/us/politics/nih-trump-jenna-norton.html",
      "summary": "The employee, Dr. Jenna Norton, was a key organizer of “The Bethesda Declaration,” a scathing public letter issued in June to Dr. Jay Bhattacharya, the N.I.H. director."
    },
    {
      "title": "US catholic bishops issues rare condemnation of Trump administration’s immigration enforcement – live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/14/us-politics-latest-news-donald-trump-ice-bishops-jeffrey-epstein",
      "summary": "&lt;p&gt;US Conference of Catholic Bishops calls for ‘meaningful immigration reform’ in first message of its kind in 12 years &lt;/p&gt;&lt;p&gt;&lt;strong&gt;As the Trump administration and &lt;a href=\"https://www.theguardian.com/us-news/texas\"&gt;Texas&lt;/a&gt; governor Greg Abbott restrict free speech on college campuses, two professors at the University of Texas at Dallas (UTD) are suing the university for retaliation stemming from 2024 arrests at a peaceful campus protest.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;History professors Ben Wright and Rosemary Admiral argue they should not have been arrested in the first place at the 1 May 2024 demonstration, where they were standing between their students and heavily armed law enforcement.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/14/us-politics-latest-news-donald-trump-ice-bishops-jeffrey-epstein\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump puts intense pressure on Republicans to block release of Epstein files",
      "url": "https://www.theguardian.com/us-news/2025/nov/14/republican-pressure-trump-epstein-files",
      "summary": "&lt;p&gt;Representatives Lauren Boebert and Nancy Mace have been summoned to Situation Room or phoned by Trump himself&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; has cranked up his intense pressure campaign on congressional Republicans to oppose the full release of the justice department’s files related to Jeffrey Epstein, before a crucial and long-awaited House &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/12/us-house-vote-epstein-files\"&gt;vote on the matter next week&lt;/a&gt; that scores of Republicans are slated to support.&lt;/p&gt;&lt;p&gt;The belated swearing-in on Wednesday of the Democratic representative Adelita Grijalva – which the House speaker, &lt;a href=\"https://www.theguardian.com/us-news/mike-johnson\"&gt;Mike Johnson&lt;/a&gt;, had refused for almost two months during the government shutdown – brought the number of signatures on Republican Thomas Massie and Democrat Ro Khanna’s discharge petition to the 218 needed to force a floor vote on legislation demanding the Department of Justice release all of its investigative files on Epstein within 30 days.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/14/republican-pressure-trump-epstein-files\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}