{
  "updatedAt": "2025-11-04T18:38:03.835Z",
  "items": [
    {
      "title": "Maryland Will Seek to Redraw Its Congressional Map",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/maryland-redistricting-governor-moore.html",
      "summary": "Gov. Wes Moore said in a statement on Tuesday that the state would “explore every avenue possible to make sure Maryland has fair and representative maps.”"
    },
    {
      "title": "Small Businesses Gear Up for Tariff Fight at Supreme Court",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/tariffs-supreme-court-small-business.html",
      "summary": "Companies that sell diamonds, plant sensors and wine all have one thing in common: They are weighing in against tariffs in a consequential case."
    },
    {
      "title": "Election Day Bomb Threats Briefly Close Some Polling Sites in New Jersey",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/new-jersey-election-polling-sites-bomb-threats.html",
      "summary": "The threats, which officials said were hoaxes, came after seven states reported receiving bomb threats on Election Day in 2024."
    },
    {
      "title": "Republicans Hold Firm on Filibuster and Prosecutor Veto Power, Despite Trump’s Frustrations",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/trump-republicans-filibuster.html",
      "summary": "President Trump is showing mounting frustration at his inability to win confirmation of U.S. attorneys in blue states or break the filibuster&#39;s grip on the Senate. The G.O.P. has been uncharacteristically uncooperative."
    },
    {
      "title": "5 Things We’re Watching on Election Day in California",
      "url": "https://www.nytimes.com/2025/11/04/us/california-election-guide.html",
      "summary": "Proposition 50 is the only statewide question on the ballot, but there are numerous dynamics at play."
    },
    {
      "title": "Pennsylvania Supreme Court: What Is a ‘Retention Election’ and How Does It Work?",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/pennsylvania-supreme-court-retention-election-explainer.html",
      "summary": "Voters will decide whether three justices who were elected as Democrats keep their seats for another 10-year term."
    },
    {
      "title": "Dick Cheney obituary",
      "url": "https://www.theguardian.com/us-news/2025/nov/04/dick-cheney-obituary",
      "summary": "&lt;p&gt;US vice-president who served under George W Bush and pushed hard for the invasion of Iraq&lt;/p&gt;&lt;p&gt;The former US vice-president Dick Cheney, who has died aged 84, was one of the most influential holders of that office in American history. While many vice-presidents had to settle for marginal or ceremonial roles, Cheney held a huge sway during the presidency of George W Bush, to the point that he was often referred to as the “real president”.&lt;/p&gt;&lt;p&gt;Bush resented such a characterisation and said the relationship was more complex. He noted that Cheney was respectful, always referring to him in public as Mr President, while he referred to him as Dick. Bush disputed even descriptions of their relationship as a partnership because it implied that they were equals. In spite of such protestations, Cheney found the laidback president pliable on a whole raft of policy decisions.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/04/dick-cheney-obituary\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US elections 2025 live: Mamdani refuses to be ‘intimidated’ by Trump jibes as New York City, New Jersey, Virginia and California vote",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
      "summary": "&lt;p&gt;New York mayoral hopeful hits back after US president says any Jewish person voting for him was ‘a stupid person’&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/04/nyc-mayoral-election-results-zohran-mamdani-andrew-cuomo-voting-polls\"&gt;NYC mayor elections: how vote works, when polls close and results as they come in&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The former US vice-president, &lt;strong&gt;Dick Cheney&lt;/strong&gt;, has died aged 84, according to a family statement.&lt;/p&gt;&lt;p&gt;“Richard B. Cheney, the 46th Vice President of the United States, died last night, November 3, 2025. He was 84 years old,” Cheney’s family said in a statement quoted by The Hill and other media outlets.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}