{
  "updatedAt": "2025-10-07T06:37:41.203Z",
  "items": [
    {
      "title": "Medical Helicopter Crashes on Highway in Sacramento",
      "url": "https://www.nytimes.com/2025/10/07/us/sacramento-california-medical-helicopter-crash.html",
      "summary": "About 15 bystanders helped to lift the aircraft off a critically injured woman after it crashed in California’s capital on Monday evening, officials said."
    },
    {
      "title": "Flight Delays Begin as Air Traffic Staffing Shortages Worsen",
      "url": "https://www.nytimes.com/2025/10/06/us/politics/flight-delays-faa-shutdown.html",
      "summary": "The delays came just hours after the transportation secretary warned that flying could be disrupted by the government shutdown."
    },
    {
      "title": "Federal Agents Accuse Chicago Man of Offering Money to Kill Senior Border Patrol Official",
      "url": "https://www.nytimes.com/2025/10/06/us/chicago-charges-money-kill-bovino.html",
      "summary": "The Department of Homeland Security identified the intended victim as Gregory Bovino, who has taken on a highly visible role in immigration enforcement campaigns in Los Angeles and Chicago."
    },
    {
      "title": "Trump Raises the Possibility of a Shutdown Deal, Then Walks It Back",
      "url": "https://www.nytimes.com/2025/10/06/us/politics/trump-democrats-negotiation-shutdown.html",
      "summary": "President Trump said he was open to making “the right deal” on health care with Democrats. Senator Chuck Schumer, the minority leader, denied any talks were underway."
    },
    {
      "title": "Trump Said He Could Invoke the Insurrection Act to Deploy Troops. Here’s What to Know.",
      "url": "https://www.nytimes.com/2025/10/06/us/trump-insurrection-act-national-guard.html",
      "summary": "The president said he would invoke emergency powers to deploy the National Guard if “people were being killed, and courts were holding us up.”"
    },
    {
      "title": "Dogs Killed 2-Year-Old at Day Care Center While Owner Slept, Police Say",
      "url": "https://www.nytimes.com/2025/10/06/us/illegal-daycare-center-child-killed-dog-attack.html",
      "summary": "The owner of the unlicensed facility in Valdosta, Ga., was charged with second-degree murder, the authorities said."
    },
    {
      "title": "No air traffic control crew at busy LA airport amid government shutdown staffing crunch",
      "url": "https://www.theguardian.com/us-news/2025/oct/06/burbank-air-traffic-controllers",
      "summary": "&lt;p&gt;Air traffic to the Hollywood Burbank Airport would be remotely managed for six hours on Monday night causing delays for travellers&lt;/p&gt;&lt;p&gt;Hollywood Burbank Airport in Los Angeles will have no air traffic control staff for nearly six hours on Monday evening, as the effects of the US government shutdown rippled across the country.&lt;/p&gt;&lt;p&gt;From 4.15pm until 10pm the Federal Aviation Administration anticipates there will be no air traffic controllers in their tower, although the FAA has said it is trying to bring in staffing sooner than that, according to &lt;a href=\"https://abc7.com/post/hollywood-burbank-airport-will-have-no-air-traffic-controllers-evening-faa-warns/17952670/?linkId=866736985\"&gt;ABC News&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/06/burbank-air-traffic-controllers\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "New California law bans loud ads on streaming services for ‘peace and quiet’",
      "url": "https://www.theguardian.com/us-news/2025/oct/06/california-bans-loud-ads-streaming-netflix-hulu-disney",
      "summary": "&lt;p&gt;Legislation was written by lawmaker whose aide had complained about ad breaks startling his newborn daughter&lt;/p&gt;&lt;p&gt;California ordered its powerful entertainment industry to turn down the volume on Monday, with a new law that requires streaming services like Netflix, Hulu, Amazon Prime and YouTube to ensure that audio levels do not suddenly skyrocket during commercial breaks.&lt;/p&gt;&lt;p&gt;The legislation, signed into state law by the governor, Gavin Newsom, forces the powerful streaming platforms to comply with existing regulations that have barred television broadcasters from bombarding the eardrums of viewers with overly loud commercials since 2010.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/06/california-bans-loud-ads-streaming-netflix-hulu-disney\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}