{
  "updatedAt": "2025-11-27T18:37:07.259Z",
  "items": [
    {
      "title": "D.C. Shooting: What We Know About the National Guard Victims",
      "url": "https://www.nytimes.com/2025/11/27/us/national-guard-shooting-andrew-wolfe-sarah-beckstrom.html",
      "summary": "The father of one of the West Virginia National Guard members said his daughter had a “mortal wound.” A man at the other member’s home asked for prayers for his son."
    },
    {
      "title": "U.S. Reviews Biden Asylum Cases After Shooting",
      "url": "https://www.nytimes.com/2025/11/27/us/politics/biden-asylum-cases-shooting.html",
      "summary": "A Homeland Security Department spokeswoman accused the previous administration of failing to vet asylum applicants “on a massive scale.”"
    },
    {
      "title": "Here’s a Look at the D.C. Shooting Suspect’s C.I.A.-Backed Unit in Afghanistan",
      "url": "https://www.nytimes.com/2025/11/27/us/dc-shooting-suspect-afghanistan-cia-unit.html",
      "summary": "The units were backed by the C.I.A. and trained to conduct missions in Afghanistan during the U.S. war in the country."
    },
    {
      "title": "U.S. Has Limited Knowledge of Those It Kills in Boat Strikes",
      "url": "https://www.nytimes.com/2025/11/27/us/politics/us-military-boat-strikes.html",
      "summary": "The U.S. military has killed more than 80 people since the campaign began in early September. But it does not know who specifically is being killed."
    },
    {
      "title": "Shooting Suspect Is Afghan Man Who Lived in Washington State, Official Says",
      "url": "https://www.nytimes.com/2025/11/27/us/shooting-afghanistan-refugees-washington.html",
      "summary": "Officials said the man had driven across the country to carry out the attack, which left two National Guard troops critically hurt."
    },
    {
      "title": "Faith Winter, Colorado State Senator, Is Killed in Car Crash",
      "url": "https://www.nytimes.com/2025/11/27/us/faith-winter-crash-dead-colorado-senator.html",
      "summary": "Faith Winter, a 45-year-old Democratic state senator and environmental activist, died on Wednesday night."
    },
    {
      "title": "US will no longer commemorate World Aids Day, reports say",
      "url": "https://www.theguardian.com/us-news/2025/nov/27/world-aids-day",
      "summary": "&lt;p&gt;State department has told employees and grant recipients to not publicly promote or make event on 1 December&lt;/p&gt;&lt;p&gt;For the first time since 1988, the US government will no longer commemorate World Aids Day, according to reports.&lt;/p&gt;&lt;p&gt;The state department has directed its employees and grant recipients not to use US government funds to mark the event – which falls annually on 1 December – and not to promote the day publicly. The news was first reported by the &lt;a href=\"https://www.substack.com/home/post/p-179940743\"&gt;journalist&lt;/a&gt; Emily Bass and confirmed in an email viewed by &lt;a href=\"https://www.nytimes.com/2025/11/26/health/trump-us-world-aids-day.html?smid=nytcore-ios-share&amp;amp;referringSource=articleShare\"&gt;the New York Times&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/27/world-aids-day\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Florida professor may have solved mystery of Peru’s Band of Holes",
      "url": "https://www.theguardian.com/us-news/2025/nov/27/peru-band-of-holes-mystery",
      "summary": "&lt;p&gt;Charles Stanish surmised indentations were rudimentary market place and later adapted as accounting and storage system&lt;/p&gt;&lt;p&gt;A &lt;a href=\"https://www.theguardian.com/us-news/florida\"&gt;Florida&lt;/a&gt; archaeologist’s decades-long persistence has helped solve one of Peru’s most puzzling geographical conundrums: the origin and purpose of the so-called &lt;a href=\"https://www.amusingplanet.com/2022/07/the-band-of-holes.html\"&gt;Band of Holes&lt;/a&gt; in the country’s mountainous Pisco Valley.&lt;/p&gt;&lt;p&gt;Charles Stanish, professor of archaeology at the University of South Florida, and an expert on Andean culture, spent years studying the more than 5,200 curious hillside shallow pits known to local residents as Monte Sierpe - serpent mountain.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/27/peru-band-of-holes-mystery\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}