{
  "updatedAt": "2025-12-04T18:44:00.075Z",
  "items": [
    {
      "title": "Bipartisan House Group Proposes Long-Shot Health Care Plan",
      "url": "https://www.nytimes.com/2025/12/04/us/politics/obamacare-aca-subsidies-house-congress.html",
      "summary": "Republicans and Democrats released a two-year plan to scale back and extend expiring Affordable Care Act subsidies, but it faces long odds in the G.O.P.-led House."
    },
    {
      "title": "Boat Strike Video Shown to Lawmakers",
      "url": "https://www.nytimes.com/2025/12/04/us/politics/drug-boat-strikes-sept-2-video-congress.html",
      "summary": "Gen. Dan Caine, chairman of the Joint Chiefs of Staff, and Adm. Frank M. Bradley, commander of the operation, met with members of Congress behind closed doors."
    },
    {
      "title": "False U.S.G.S. Report of 5.9 Earthquake Sends Phones Buzzing in Nevada",
      "url": "https://www.nytimes.com/2025/12/04/us/nevada-earthquake-usgs-false.html",
      "summary": "The United States Geological Survey quickly deleted the alert, saying it had been sent in error. “This isn’t a good look,” one earthquake expert said."
    },
    {
      "title": "Her Roof Was About to Be Fixed. Then Immigration Agents Showed Up.",
      "url": "https://www.nytimes.com/2025/12/04/us/new-orleans-border-patrol-immigration-home-repair.html",
      "summary": "The Trump administration’s deportation agenda is reverberating beyond immigrant communities as agents begin fanning out around New Orleans."
    },
    {
      "title": "Suspect Arrested in Inquiry Into Pipe Bombs in D.C. Ahead of Jan. 6 Riot",
      "url": "https://www.nytimes.com/2025/12/04/us/politics/washington-dc-pipe-bombs-arrest-jan-6-fbi.html",
      "summary": "The suspect was described as a 30-year-old man from Prince William County, Va., and his arrest could ultimately provide an answer to one of the mysteries arising from the Jan. 6. attack."
    },
    {
      "title": "Poll Suggests Voters May Blame Republicans More if Affordable Care Act Subsidies Go Away",
      "url": "https://www.nytimes.com/2025/12/04/us/politics/poll-republicans-health-insurance-subsidies-affordable-care-act.html",
      "summary": "About half of people covered under the Affordable Care Act say that if their health costs spike, it will have a “major impact” on how they vote in the 2026 midterm elections, a survey found."
    },
    {
      "title": "Top Democrat calls navy admiral briefing about ‘double-tap’ strike on vessels ‘one of the most troubling things I’ve seen’– live",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/04/us-politics-live-donald-trump-latest-news-updates-democrats-republicans",
      "summary": "&lt;p&gt;Adm Frank Bradley spoke to lawmakers in a private session on the suspected drug boats; Jim Hines tells CNN the briefing was troubling but Bradley confirmed there was not a ‘kill them all’ order&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Among the beneficiaries of &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt;’s pardons and commutations, there is a group that legal experts and political scientists see as some of the clearest evidence of how such actions undermine the rule of law: those who were released from prison and again arrested for different alleged crimes&lt;/strong&gt;.&lt;/p&gt;&lt;p&gt;During his first term, Trump issued 237 acts of clemency – including to someone who was a predatory lender and drug smuggler and to another who ran a Ponzi scheme. Since taking office again, Trump has issued more than 1,600, most for people involved in the &lt;a href=\"https://www.theguardian.com/us-news/2025/jan/20/trump-executive-orders-jan-6-pardons\"&gt;January 6 attack&lt;/a&gt; on Congress.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/04/us-politics-live-donald-trump-latest-news-updates-democrats-republicans\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Arrest reportedly made in case of pipe bombs planted on eve of US Capitol riot",
      "url": "https://www.theguardian.com/us-news/2025/dec/04/dc-pipe-bomb-attack-arrest-january-6",
      "summary": "&lt;p&gt;Bombs were placed near Republican and Democratic party HQs in Washington night before 6 January 2021 attack&lt;/p&gt;&lt;p&gt;US authorities have made an arrest in connection with pipe bombs that were planted outside the headquarters of both the Democratic and Republican parties in Washington DC on the eve of 6 January 2021, according to reports on Thursday morning.&lt;/p&gt;&lt;p&gt;Explosive devices were placed at night and then, on the afternoon of &lt;a href=\"https://www.theguardian.com/us-news/2022/dec/23/jan-6-panel-final-report-trump-capitol-attack\"&gt;6 January&lt;/a&gt;, the US Capitol attack occurred, when a mob of Donald Trump’s supporters stormed Congress in an effort to prevent the certification of Joe Biden’s win in the 2020 presidential election.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/04/dc-pipe-bomb-attack-arrest-january-6\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}