{
  "updatedAt": "2025-10-06T12:54:37.838Z",
  "items": [
    {
      "title": "Dallin H. Oaks Addresses Latter-day Saints General Conference",
      "url": "https://www.nytimes.com/2025/10/06/us/latter-day-saints-mormon-dallin-oaks.html",
      "summary": "Dallin H. Oaks, 93, the next president of the global body, addressed the conference a week after an attack on a church in Michigan."
    },
    {
      "title": "Supreme Court Returns to Face Trump Tests of Presidential Power",
      "url": "https://www.nytimes.com/2025/10/06/us/politics/supreme-court-presidential-power.html",
      "summary": "As the justices return to the bench Monday, the court will confront a series of cases central to the president’s agenda."
    },
    {
      "title": "Trump Calls Deadly Strikes on Boats in Caribbean an ‘Act of Kindness’",
      "url": "https://www.nytimes.com/2025/10/05/us/politics/trump-caribbean-strikes-drugs-kindness.html",
      "summary": "The president, speaking aboard an aircraft carrier off Norfolk, Va., repeated his claims that the boats were trafficking drugs bound for the United States."
    },
    {
      "title": "Skydiving Instructor Dies After Being Separated From Student, Officials Say",
      "url": "https://www.nytimes.com/2025/10/05/us/skydiving-instructor-dead-nashville.html",
      "summary": "The student, who had minor injuries, was rescued after being lodged in a tree in Nashville. The instructor was “presumed to have fallen from the sky without a parachute,” the police said."
    },
    {
      "title": "Trump Renews Layoff Threats as Shutdown Accusations Continue to Fly",
      "url": "https://www.nytimes.com/2025/10/05/us/politics/trump-democrats-shutdown.html",
      "summary": "Senator Chuck Schumer and Speaker Mike Johnson each accused the other of not being “serious” about talks to end the shutdown as the government was closed for a fifth day."
    },
    {
      "title": "Deputy Charged With Murder Knelt on Inmate’s Back, Affidavit Says",
      "url": "https://www.nytimes.com/2025/10/05/us/inmate-murder-kansas-adair-fatherley.html",
      "summary": "A recently released affidavit relates new details about the July death in a Kansas jail of a man with medical problems who was handcuffed and face down on a bunk."
    },
    {
      "title": "Judge blocks Trump’s bid to deploy national guard to Oregon – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Ruling by US District Judge Karin Immergut blocks any deployment to Portland for two weeks as legal wrangling continues&lt;/p&gt;&lt;p&gt;As several negotiators congregate in Egypt today to cement a peace deal –&amp;nbsp;which includes the release of the remaining Israeli hostages by Hamas, in exchange for Palestinian prisoners –&amp;nbsp;Donald Trump urged expediency in a post on social media this weekend.&lt;/p&gt;&lt;p&gt;“I am told that the first phase should be completed this week, and I am asking everyone to MOVE FAST,” the president &lt;a href=\"https://truthsocial.com/@realDonaldTrump/posts/115323790604734426\"&gt;wrote &lt;/a&gt;on Truth Social. “ I will continue to monitor this Centuries old “conflict.” TIME IS OF THE ESSENCE OR, MASSIVE BLOODSHED WILL FOLLOW — SOMETHING THAT NOBODY WANTS TO SEE!”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump urges negotiators to ‘move fast’ in run-up to Gaza ceasefire talks | First Thing",
      "url": "https://www.theguardian.com/us-news/2025/oct/06/first-thing-trump-move-fast-gaza-ceasefire-talks-egypt",
      "summary": "&lt;p&gt;Discussions in Egypt expected to focus on path to peace and release of hostages, after Israel killed dozens of people in just over 24 hours. Plus, why are young Americans eating so early?&lt;/p&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;Donald Trump has urged negotiators to “move fast” in talks focused on the release of hostages held by Hamas in Gaza and a broader end to the war, as representatives arrived in Egypt for &lt;a href=\"https://www.theguardian.com/world/2025/oct/05/israel-continues-gaza-bombardment-trump-plan-negotiators-arrive-in-cairo\"&gt;discussions today&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What’s happening today?&lt;/strong&gt; The US envoy Steve Witkoff is expected to join the talks in Sharm el-Sheikh, according to Israeli media, in addition to Israel’s negotiators and a Palestinian delegation headed by Khalil al-Hayya, the deputy head of the political bureau of Hamas.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;This is a live story. &lt;a href=\"https://www.theguardian.com/world/live/2025/oct/06/gaza-ceasefire-peace-talks-hamas-israel-trump-egypt-middle-east-crisis-live-news-updates\"&gt;Follow updates here&lt;/a&gt;.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;How long will the ruling last?&lt;/strong&gt; Immergut’s ruling on Sunday, which will remain in effect until at least 19 October, blocks the Trump administration from sending national guard troops to Portland while Oregon and California seek a longer-term ruling in court.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/06/first-thing-trump-move-fast-gaza-ceasefire-talks-egypt\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}