{
  "updatedAt": "2025-12-01T18:45:29.186Z",
  "items": [
    {
      "title": "Johnson and Trump Try to Avoid an Upset House Loss in Tennessee",
      "url": "https://www.nytimes.com/2025/12/01/us/politics/trump-tennessee-election.html",
      "summary": "Speaker Mike Johnson put the president on speakerphone during a Monday stop in the state, underscoring the unusual amount of national attention on a House special election."
    },
    {
      "title": "For ‘No Tax on Tips,’ the I.R.S. Gets Intimate",
      "url": "https://www.nytimes.com/2025/12/01/us/politics/no-tax-on-tips-irs-exclusions.html",
      "summary": "The Trump administration wants to exclude earnings from “pornographic activity” from a new tax break for tips. Will the I.R.S. know it when it sees it?"
    },
    {
      "title": "Supreme Court Hears Copyright Battle Over Online Music Piracy",
      "url": "https://www.nytimes.com/2025/12/01/us/politics/supreme-court-copyright-music-piracy.html",
      "summary": "At issue is whether internet providers can be held liable for repeated copyright infringements of users, with potentially billions of dollars on the line."
    },
    {
      "title": "With Judge&#39;s Ruling, a New Tool for Charging Crime in D.C.",
      "url": "https://www.nytimes.com/2025/12/01/us/politics/trump-federal-grand-juries-washington.html",
      "summary": "The U.S. attorney’s office says it may use local grand juries for serious federal crime in Washington “when appropriate” after a judge signed off on the unusual procedure."
    },
    {
      "title": "Despite Supreme Court Wins, Elite D.O.J. Unit Has Seen Mass Turnover",
      "url": "https://www.nytimes.com/2025/12/01/us/trump-solicitor-general-supreme-court.html",
      "summary": "Even with an exodus of lawyers, the Office of the Solicitor General has had remarkable success. But fiery rhetoric and close White House ties have raised concerns."
    },
    {
      "title": "In Georgia, the Fight Over 2020 Election Results Looms Over 2026 Midterms",
      "url": "https://www.nytimes.com/2025/12/01/us/trump-georgia-election-interference-midterms.html",
      "summary": "Several officials who were involved in the fight over the election outcome are seeking higher office."
    },
    {
      "title": "Trump backs Hegseth as defense secretary denies ordering second strike on boat – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/01/donald-trump-pete-hegseth-caribbean-boats-venezuela-immigration-us-politics-latest-news-updates",
      "summary": "&lt;p&gt;President’s remarks come amid calls for an immediate investigation into reports Hegseth ordered a second strike on alleged drug-smuggling boat&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/world/2025/dec/01/trump-maduro-ultimatum-relinquish-power-venezuela\"&gt;Trump reportedly gave Maduro ultimatum to relinquish power in Venezuela&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The president has picked up where he left off before Thanksgiving, when it comes to his anger at the six Democratic lawmakers who took part in a video urging service members to “refuse illegal orders”.&lt;/p&gt;&lt;p&gt;A reminder, that Trump initially went on a Truth Social tirade, accusing the members of Congress (all of whom are veterans or former intelligence officials) of sedition, adding that their actions are “punishable by death”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/01/donald-trump-pete-hegseth-caribbean-boats-venezuela-immigration-us-politics-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump’s pardon of Honduras’s ex-president shows counter-drug effort is ‘based on lies and hypocrisy’",
      "url": "https://www.theguardian.com/us-news/2025/dec/01/trump-pardon-juan-orlando-hernandez-honduras-former-president",
      "summary": "&lt;p&gt;Why has Trump blown up alleged narco boats in the Caribbean and at the same time decided to let a big time trafficker off the hook?&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/24/visual-guide-us-military-presence-caribbean\"&gt;Deadly airstrikes and a military buildup: how the US pressure campaign against Venezuela has unfolded in the Caribbean&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;He was a Latin American president accused of colluding with some of the region’s most ruthless narco bosses to flood the United States with cocaine.&lt;/p&gt;&lt;p&gt;“[Let’s] stuff the drugs right up the noses of the gringos,” the double-dealing politician &lt;a href=\"https://www.justice.gov/archives/opa/pr/juan-orlando-hern%C3%A1ndez-former-president-honduras-indicted-drug-trafficking\"&gt;once allegedly bragged&lt;/a&gt; as he lined his pockets with millions of dollars in bribes and turned his country into what many called a narco-state.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/01/trump-pardon-juan-orlando-hernandez-honduras-former-president\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}