{
  "updatedAt": "2025-09-29T12:55:43.835Z",
  "items": [
    {
      "title": "Michigan Church Shooting and Fire: What We Know",
      "url": "https://www.nytimes.com/2025/09/29/us/michigan-mormon-church-shooting-fire.html",
      "summary": "At least four people were killed after an attacker opened fire at a Church of Jesus Christ of Latter-day Saint building and intentionally set fire to the structure."
    },
    {
      "title": "Alaska Seized a $95,000 Plane Over Illicit Cargo: A Six-Pack of Beer",
      "url": "https://www.nytimes.com/2025/09/29/us/politics/alaska-plane-beer-supreme-court.html",
      "summary": "The plane’s owner, an 82-year-old veteran, has asked the Supreme Court to hear his case and set limits on forfeitures of property used to commit crimes."
    },
    {
      "title": "The Man Expanding Trump’s Presidential Powers",
      "url": "https://www.nytimes.com/video/us/politics/100000010422264/the-man-expanding-trumps-presidential-powers.html",
      "summary": "Coral Davenport, a New York Times reporter, explains how Russell Vought, the director of the Office of Management and Budget, plans to circumvent Congress’s budgetary powers to advance the Trump administration’s agenda."
    },
    {
      "title": "Trump to Meet With Congressional Leaders as Shutdown Looms",
      "url": "https://www.nytimes.com/2025/09/29/us/politics/trump-shutdown-meeting-schumer-jeffries-johnson.html",
      "summary": "The top four congressional leaders were set to gather with President Trump on Monday, but with both sides dug in, there appeared to be little chance of a breakthrough to avoid a shutdown."
    },
    {
      "title": "Which Federal Benefits and Services Continue During a Government Shutdown?",
      "url": "https://www.nytimes.com/2025/09/29/us/politics/government-shutdown-federal-services-mail-parks.html",
      "summary": "Without a deal in Congress by Tuesday, the government will run out of funding."
    },
    {
      "title": "She Was Fired for a Comment on Her Private Facebook Account",
      "url": "https://www.nytimes.com/2025/09/29/us/charlie-kirk-free-speech.html",
      "summary": "A look at how one state has turbocharged the crackdown on anyone who has criticized Charlie Kirk after his death."
    },
    {
      "title": "Donald Trump and Benjamin Netanyahu to discuss Gaza peace plan at the White House – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
      "summary": "&lt;p&gt;US president to push Israeli prime minister to agree to new framework to end war in Gaza and free remaining hostages held by Hamas&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Trump officials to announce plan to boost coal output&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The US is set to announce on Monday policies &lt;strong&gt;to try to boost the output of coal&lt;/strong&gt;, the interior department said, as the Trump administration seeks to reverse the decline of the fossil fuel’s use.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "First Thing: At least four dead and eight injured after shooting at Mormon church in Michigan",
      "url": "https://www.theguardian.com/us-news/2025/sep/29/first-thing-at-least-four-dead-and-eight-injured-after-shooting-at-mormon-church-in-michigan",
      "summary": "&lt;p&gt;Church set ablaze on weekend when shooting attacks also took place in North Carolina, Texas and New Orleans. Plus, the secrets of Birkenstock’s enduring success&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"&gt;&lt;strong&gt;Don’t already get First Thing in your inbox? Sign up here&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Good morning.&lt;/p&gt;&lt;p&gt;At least &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/28/mass-shootings-north-carolina-texas-new-orleans\"&gt;four people were killed and eight others injured&lt;/a&gt; after a gunman opened fire at a Mormon church in Michigan and then set the building ablaze, authorities said.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Was it the only mass shooting this weekend?&lt;/strong&gt; No, the shooting happened during a particularly violent weekend in the US and marked the 324th mass shooting in the US in 2025, according to the Gun Violence Archive. Multiple mass shootings – cases in which four or more people are shot or killed – were reported in the US in public places including in North Carolina, Texas and New Orleans.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What did the facility say?&lt;/strong&gt; The facility, which is run by the private corrections and detention company CoreCivic, directed the Guardian to Ice for comment, which in turn directed the Guardian to the Department of Homeland Security (DHS), the parent agency, though a report from Ice’s juvenile coordinator said the agency was complying with legal requirements. Comment was requested from DHS but a response was not received prior to publication.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/29/first-thing-at-least-four-dead-and-eight-injured-after-shooting-at-mormon-church-in-michigan\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}