{
  "updatedAt": "2025-09-05T06:50:50.014Z",
  "items": [
    {
      "title": "Suspect in Macklemore Robbery Also Stole From Sports Stars, Prosecutors Say",
      "url": "https://www.nytimes.com/2025/09/05/us/seattle-burglary-macklemore-ichiro-sherman.html",
      "summary": "Patrick Maisonet’s targets in the Seattle area included the baseball Hall of Famer Ichiro Suzuki and the former football star Richard Sherman, officials said."
    },
    {
      "title": "Justice Amy Coney Barrett Argues Her Own Case, and the Court’s, in New Book",
      "url": "https://www.nytimes.com/2025/09/04/us/politics/justice-barrett-explaining-law.html",
      "summary": "In a new book, Justice Amy Coney Barrett asks for faith in the Supreme Court but reveals very little."
    },
    {
      "title": "Health Dept. Plans Vaccine Poll Run by Trump Ally’s Firm",
      "url": "https://www.nytimes.com/2025/09/04/us/politics/hhs-vaccines-poll-harrisx-trump-rfk.html",
      "summary": "The no-bid contract was published amid Secretary Robert F. Kennedy Jr.’s effort to move the nation’s health infrastructure away from some vaccines."
    },
    {
      "title": "Venezuelan Jets Fly Over U.S. Navy Ship in Show of Force",
      "url": "https://www.nytimes.com/2025/09/04/us/politics/venezuela-jets-us-navy-ship-trump.html",
      "summary": "The flyover took place two days after the United States carried out a military strike on a boat in the Caribbean that U.S. officials said was carrying drugs."
    },
    {
      "title": "Biden Has Surgery to Remove Skin Cancer Lesions",
      "url": "https://www.nytimes.com/2025/09/04/us/politics/biden-skin-cancer.html",
      "summary": "Three months earlier, former President Joseph R. Biden Jr. had a diagnosis of an aggressive form of prostate cancer."
    },
    {
      "title": "Trump Is Exploring Ways to Take Over the Sept. 11 Memorial and Museum",
      "url": "https://www.nytimes.com/2025/09/04/us/politics/trump-sept-11-museum.html",
      "summary": "It was unclear exactly how the federal government would take control of the site in Lower Manhattan. As a candidate, Mr. Trump offered a preview of one potential option."
    },
    {
      "title": "Trump plans to sign executive order to rename Pentagon to ‘Department of War’ – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/04/donald-trump-tariffs-immigration-technology-epstein-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Order would authorize Pete Hegseth, the defense secretary, to introduce legislation to revert to pre-1947 name. This blog is now closed.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Health secretary Robert F&lt;/strong&gt;&lt;strong&gt; Kennedy Jr&lt;/strong&gt;&lt;strong&gt; will appear before a congressional committee on Thursday, where he’s expected to face questions about turmoil at federal health agencies.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The US Senate finance committee has called Kennedy to a hearing about his plans to “Make America Healthy Again”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/04/donald-trump-tariffs-immigration-technology-epstein-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump’s LA national guard deployment cost taxpayers $120m, Newsom says",
      "url": "https://www.theguardian.com/us-news/2025/sep/04/trump-national-guard-deployment-los-angeles",
      "summary": "&lt;p&gt;California governor condemns decision to deploy troops in response to anti-Ice protests as ‘waste, fraud and abuse’ &lt;/p&gt;&lt;p&gt;Donald Trump’s deployment of the national guard in Los Angeles in response to protests in the city over immigration raids cost taxpayers nearly $120m, the California governor’s office said on Thursday.&lt;/p&gt;&lt;p&gt;The US president sent 2,000 national guard troops into the city in June amid clashes between federal immigration agents and protesters. This week a &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/02/trumps-national-guard-troops-los-angeles-illegal\"&gt;judge ruled&lt;/a&gt; that dispatching the military to accompany authorities on immigration enforcement operations violated federal law.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/04/trump-national-guard-deployment-los-angeles\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}