{
  "updatedAt": "2025-12-02T18:44:03.536Z",
  "items": [
    {
      "title": "New ICE Operation Is Said to Target Somali Migrants in Minneapolis and St. Paul",
      "url": "https://www.nytimes.com/2025/12/02/us/politics/ice-somali-migrants-minneapolis-st-paul.html",
      "summary": "The move comes as President Trump has attacked Somalis with increasingly inflammatory rhetoric in recent days."
    },
    {
      "title": "Venezuela Accepts Migrant Repatriation Flight From U.S. Amid Airspace Tensions",
      "url": "https://www.nytimes.com/2025/12/02/us/politics/venezuela-migrant-deportations-trump.html",
      "summary": "The flight’s approval illustrates how the United States and Venezuela are still communicating, after a declaration from President Trump that Venezuelan airspace was “closed in its entirety.”"
    },
    {
      "title": "Juan Orlando Hernández, Former President of Honduras, Is Freed From Prison After Trump Pardon",
      "url": "https://www.nytimes.com/2025/12/02/us/politics/hernandez-honduras-trump.html",
      "summary": "Juan Orlando Hernández was accused of flooding the United States with cocaine and had been sentenced to 45 years in prison."
    },
    {
      "title": "Costco Sues Trump Administration for Refund of Tariffs",
      "url": "https://www.nytimes.com/2025/12/02/us/politics/costco-trump-tariffs-lawsuit.html",
      "summary": "The retail giant is seeking to recover money it has paid this year, should the Supreme Court rule that President Trump’s implementation of tariffs was unlawful."
    },
    {
      "title": "San Francisco Will Sue Ultraprocessed Food Companies",
      "url": "https://www.nytimes.com/2025/12/02/us/san-francisco-ultraprocessed-food-lawsuit.html",
      "summary": "The city attorney accuses large manufacturers of causing diseases that have burdened governments with public health costs."
    },
    {
      "title": "Mandela Barnes Enters Wisconsin Governor Race, Joining Crowded Field of Democrats",
      "url": "https://www.nytimes.com/2025/12/02/us/politics/wisconsin-governor-mandela-barnes.html",
      "summary": "The former lieutenant governor is the best-known candidate in a crowded field, but some state Democrats have cooled on him since he lost a Senate bid in 2022."
    },
    {
      "title": "Hegseth doubles down on Caribbean boat strikes, says military commanders have ‘done the right things’ - US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/02/donald-trump-pete-hegseth-boat-venezuela-maduro-tennessee-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Defense secretary has been insisting that an admiral gave the order for the second strike on alleged drug boat back in September&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/dec/02/us-admiral-to-brief-lawmakers-as-bipartisan-scrutiny-grows-over-boat-strike\"&gt;Trump administration is ‘selling out’ admiral to shield Hegseth over boat strikes, officials say&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/dec/02/hegseth-us-soldiers-iraq-rules-engagement\"&gt;Pete Hegseth told US soldiers in Iraq to ignore legal advice on rules of engagement&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;em&gt;Joseph Gedeon is a politics breaking news reporter based in Washington&lt;/em&gt;&lt;/p&gt;&lt;p&gt;The &lt;a href=\"https://www.theguardian.com/us-news/fbi\"&gt;FBI&lt;/a&gt; director, &lt;strong&gt;Kash Patel&lt;/strong&gt;, is “in over his head” and leading a “chronically under-performing” agency paralyzed by fear and plummeting morale, according to a scathing 115-page report compiled by a national alliance of retired and active-duty FBI special agents and analysts.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/02/donald-trump-pete-hegseth-boat-venezuela-maduro-tennessee-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Police were skeptical about tip that led to arrest of UnitedHealthcare CEO shooting suspect",
      "url": "https://www.theguardian.com/us-news/2025/dec/02/police-tip-unitedhealthcare-ceo-shooting-suspect",
      "summary": "&lt;p&gt;Officers joked about tip that Luigi Mangione was at a Pennsylvania McDonald’s, where they arrested him in the killing of Brian Thompson&lt;/p&gt;&lt;p&gt;Police involved with &lt;a href=\"https://www.theguardian.com/us-news/2024/dec/09/unitedhealthcare-ceo-shooting-suspect-arrested\"&gt;Luigi Mangione’s&lt;/a&gt; arrest were so skeptical that the tip on his whereabouts was true that they joked about a reward sandwich in text messages, Manhattan state court proceedings revealed on Tuesday.&lt;/p&gt;&lt;p&gt;“He said, ‘if you get the New York City shooter, I’ll buy you a hoagie from a local restaurant,’” testified Joseph Detwiler, an Altoona, Pennsylvania police officer, of texts exchanged with a supervisor. “I said, ‘Consider it done.’”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/02/police-tip-unitedhealthcare-ceo-shooting-suspect\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}