{
  "updatedAt": "2025-10-05T06:33:46.235Z",
  "items": [
    {
      "title": "Judge Blocks Trump’s Deployment of National Guard in Portland, Ore.",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/judge-blocks-national-guard-portland.html",
      "summary": "A federal judge appointed by President Trump issued a temporary restraining order, siding for now with Oregon and Portland lawyers who called federalizing the guard a presidential overreach."
    },
    {
      "title": "Federal Agent in Chicago Shot Motorist in Confrontation, Officials Say",
      "url": "https://www.nytimes.com/2025/10/04/us/federal-agent-shooting-chicago.html",
      "summary": "The clash touched off more protests in the city over immigration enforcement. The Illinois governor said National Guard troops could be deployed soon against his wishes."
    },
    {
      "title": "Mark Sanchez, Ex-N.F.L. Quarterback, Is Charged in Stabbing in Indianapolis",
      "url": "https://www.nytimes.com/2025/10/04/us/mark-sanchez-stabbing.html",
      "summary": "Mr. Sanchez, who works as a Fox Sports commentator, was charged with battery on Saturday, the police said. He was in stable condition after being injured in the early-morning episode in Indianapolis."
    },
    {
      "title": "2 Children Are Dead and 2 Are in Critical Condition in Texas Shooting",
      "url": "https://www.nytimes.com/2025/10/04/us/texas-shooting-children.html",
      "summary": "A 13-year-old and 4-year-old were killed, officials said. A 9-year-old and 8-year-old were airlifted for medical care and were in critical condition."
    },
    {
      "title": "Who Still Has Temporary Protected Status Under Trump?",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/temporary-protected-status-scotus.html",
      "summary": "Conflicting court rulings have plunged hundreds of thousands of people with temporary protection from deportation into uncertainty."
    },
    {
      "title": "Trump’s Approach on Gaza: Deal First, Details Later",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/trump-gaza-diplomacy.html",
      "summary": "“We’ll see how it all turns out,” President Trump said after Hamas agreed to portions of his cease-fire plan, with conditions."
    },
    {
      "title": "Trump news at a glance: President authorizes sending national guard into Chicago as judge blocks Portland deployment",
      "url": "https://www.theguardian.com/us-news/2025/oct/05/trump-news-at-a-glance-president-authorizes-sending-national-guard-into-chicago-as-judge-blocks-portland-deployment",
      "summary": "&lt;p&gt;Illinois governor JB Pritzker calls move unnecessary and ‘a manufactured performance’ – key US politics stories from 4 October at a glance&lt;/p&gt;&lt;p&gt;Donald Trump has moved to deploy the national guard to Chicago, the White House confirmed on Saturday, even as a federal judge blocked his administration from deploying troops to Portland, Oregon.&lt;/p&gt;&lt;p&gt;White House spokesperson Abigail Jackson confirmed that the president had authorized using &lt;a href=\"https://www.theguardian.com/us-news/illinois\"&gt;Illinois&lt;/a&gt; national guard members, citing what she called “ongoing violent riots and lawlessness” that local leaders have not quelled.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/05/trump-news-at-a-glance-president-authorizes-sending-national-guard-into-chicago-as-judge-blocks-portland-deployment\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US envoys head to Egypt for Gaza ceasefire talks as Trump says ‘we are very close’ to deal",
      "url": "https://www.theguardian.com/us-news/2025/oct/04/trump-gaza-peace-deal",
      "summary": "&lt;p&gt;US president says he will push to finalize agreement in the coming days even as scores of Palestinians killed in latest Israeli attacks&lt;/p&gt;&lt;p&gt;Donald Trump’s son-in-law and a senior envoy are heading to Egypt to begin ceasefire negotiations, the White House has said, as the Israeli prime minister, Benjamin Netanyahu, said he hoped to bring all remaining hostages home in the coming days.&lt;/p&gt;&lt;p&gt;A White House official said the US president was sending his envoys, Jared Kushner and Steve Witkoff, to Egypt on Saturday to finalise the technical details of a hostage release and discuss a lasting ceasefire deal a day after &lt;a href=\"https://www.theguardian.com/world/2025/oct/03/hamas-agrees-to-release-all-israeli-hostages\"&gt;Hamas said it was ready to free hostages&lt;/a&gt; under Trump’s plan to end the two-year-old war. In an interview, Trump said “we are very close” to reaching an agreement.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/04/trump-gaza-peace-deal\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}