{
  "updatedAt": "2025-12-01T12:59:52.181Z",
  "items": [
    {
      "title": "Supreme Court to Hear Copyright Battle Over Online Music Piracy",
      "url": "https://www.nytimes.com/2025/12/01/us/politics/supreme-court-copyright-music-piracy.html",
      "summary": "At issue is whether internet providers can be held liable for repeated copyright infringements of users, with potentially billions of dollars on the line."
    },
    {
      "title": "What Jamaica Wants After Deadly Hurricane? Visit Us, Island Says.",
      "url": "https://www.nytimes.com/2025/12/01/us/hurricane-jamaica-tourism.html",
      "summary": "Tourism accounts for nearly a third of Jamaica’s economy, so officials are rushing to reopen dozens of hotels in time to salvage the vital winter travel season."
    },
    {
      "title": "With Judge&#39;s Ruling, a New Tool for Charging Crime in D.C.",
      "url": "https://www.nytimes.com/2025/12/01/us/politics/trump-federal-grand-juries-washington.html",
      "summary": "The U.S. attorney’s office says it may use local grand juries for serious federal crime in Washington “when appropriate” after a judge signed off on the unusual procedure."
    },
    {
      "title": "Despite Supreme Court Wins, Elite D.O.J. Unit Has Seen Mass Turnover",
      "url": "https://www.nytimes.com/2025/12/01/us/trump-solicitor-general-supreme-court.html",
      "summary": "Even with an exodus of lawyers, the Office of the Solicitor General has had remarkable success. But fiery rhetoric and close White House ties have raised concerns."
    },
    {
      "title": "In Georgia, the Fight Over 2020 Election Results Looms Over 2026 Midterms",
      "url": "https://www.nytimes.com/2025/12/01/us/trump-georgia-election-interference-midterms.html",
      "summary": "The Justice Department is trying to access ballots cast in 2020, while several officials who were involved in the fight over the election outcome are seeking higher office."
    },
    {
      "title": "Millions Are Under Winter Storm Watch as Potential Nor’easter Approaches",
      "url": "https://www.nytimes.com/2025/12/01/us/snowstorm-noreaster-northeast-new-england.html",
      "summary": "Forecasters expected the storm to track up the Eastern Seaboard Monday night into Tuesday, leaving as much as a foot of snow in parts of the Northeast United States."
    },
    {
      "title": "Trump backs Hegseth as defense secretary denies ordering second strike on boat – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/01/donald-trump-pete-hegseth-caribbean-boats-venezuela-immigration-us-politics-latest-news-updates",
      "summary": "&lt;p&gt;President’s remarks come amid calls for an immediate investigation into reports Hegseth ordered a second strike on alleged drug-smuggling boat&lt;/p&gt;&lt;p&gt;Venezuela’s National Assembly has accused the US of committing “murder” with the strikes. It is one of the first acknowledgements by Venezuelan officials that their citizens have been targeted.&lt;/p&gt;&lt;p&gt;“There’s no declared war [between the US and Venezuela)] therefore this cannot be classified as anything but murder,” Jorge Rodriguez, the National Assembly president, told a press conference on Sunday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/01/donald-trump-pete-hegseth-caribbean-boats-venezuela-immigration-us-politics-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Cooking with gas gets more expensive as Americans face rising prices into 2026",
      "url": "https://www.theguardian.com/us-news/2025/dec/01/gas-energy-prices",
      "summary": "&lt;p&gt;Trump promised to cut consumers’ energy costs within his first year in office but gas price is up 4% on average&lt;/p&gt;&lt;p&gt;Americans using gas stoves to cook during the holidays, or any other meal in the near future, are set for persistently higher bills, with the price of gas expected to keep rising into next year.&lt;/p&gt;&lt;p&gt;US households will pay 4% more for gas power this year, on average, compared with 2024, with the industrial and power plant sectors experiencing a much higher price rise, a recent analysis from the US Energy Information Administration (EIA) has &lt;a href=\"https://www.eia.gov/todayinenergy/detail.php?id=66624\"&gt;found&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/01/gas-energy-prices\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}