{
  "updatedAt": "2025-12-02T06:43:08.349Z",
  "items": [
    {
      "title": "Kristi Noem Recommends New Travel Ban After National Guard Shooting",
      "url": "https://www.nytimes.com/2025/12/01/us/politics/trump-travel-ban-dhs-noem.html",
      "summary": "Kristi Noem, the secretary of homeland security, equated immigrants to “foreign invaders” as she called for an expanded travel ban. President Trump reposted her statement."
    },
    {
      "title": "As Trump Deepens Immigration Crackdown, Exceptions Disappear for Afghans and Others",
      "url": "https://www.nytimes.com/2025/12/01/us/politics/trump-immigration-afghan-daca.html",
      "summary": "President Trump’s latest changes to the immigration system affect communities that traditionally have been considered special cases."
    },
    {
      "title": "Trump Administration Revokes Licenses of Thousands of Training Centers for Truckers",
      "url": "https://www.nytimes.com/2025/12/01/us/politics/trump-trucking-license-accreditation.html",
      "summary": "The move, and threats of thousands more revocations, comes as the administration has increased its criticism of the trucking industry over noncitizen drivers’ obtaining commercial licenses."
    },
    {
      "title": "Trump’s Crackdown in Wake of Shooting Blocks Legal Pathways for Migrants",
      "url": "https://www.nytimes.com/2025/12/01/us/politics/trump-dc-shooting-immigration.html",
      "summary": "The new measures represent some of the most significant changes to immigration policy since President Trump returned to the White House."
    },
    {
      "title": "Hegseth Ordered Lethal Boat Strike but Not the Killing of Survivors, Officials Say",
      "url": "https://www.nytimes.com/2025/12/01/us/hegseth-drug-boat-strike-order-venezuela.html",
      "summary": "Amid talk of war crimes, the details and precise sequence of a Sept. 2 attack on a boat in the Caribbean are facing intensifying scrutiny."
    },
    {
      "title": "Reginald T. Jackson, A.M.E. Bishop With Political Power, Dies at 71",
      "url": "https://www.nytimes.com/2025/12/01/us/politics/reginald-t-jackson-dead.html",
      "summary": "Influential up and down the Eastern Seaboard, he was part of a long tradition among Black clergy of fighting bias and getting out the vote. “No vote, no clout,” he’d say."
    },
    {
      "title": "Trump discusses Venezuela with advisers as Hegseth distances himself from second strike on suspected drug boat –as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/01/donald-trump-pete-hegseth-caribbean-boats-venezuela-immigration-us-politics-latest-news-updates",
      "summary": "&lt;p&gt;This live blog is now closed.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/dec/01/trump-administration-news-update-today\"&gt;Trump news at a glance: tensions with Venezuela rise following president’s reported ultimatum to Maduro&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;The president has picked up where he left off before Thanksgiving, when it comes to his anger at the six Democratic lawmakers who took part in a video urging service members to “refuse illegal orders”.&lt;/p&gt;&lt;p&gt;A reminder, that Trump initially went on a Truth Social tirade, accusing the members of Congress (all of whom are veterans or former intelligence officials) of sedition, adding that their actions are “punishable by death”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/dec/01/donald-trump-pete-hegseth-caribbean-boats-venezuela-immigration-us-politics-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: tensions with Venezuela rise following president’s reported ultimatum to Maduro",
      "url": "https://www.theguardian.com/us-news/2025/dec/01/trump-administration-news-update-today",
      "summary": "&lt;p&gt;Trump reportedly had a ‘blunt message’ for Venezuelan president: leave power and your country immediately – key US politics stories from 1 December at a glance&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; reportedly had a blunt message for Venezuelan president &lt;a href=\"https://www.theguardian.com/world/nicolas-maduro\"&gt;Nicolás Maduro&lt;/a&gt;: leave power – and your country – immediately.&lt;/p&gt;&lt;p&gt;Sources &lt;a href=\"https://www.miamiherald.com/news/nation-world/world/americas/venezuela/article313261442.html#storylink=cpy\"&gt;told the Miami Herald&lt;/a&gt; the US president had a phone call with his South American counterpart, who is the focus of a four-month pressure campaign in which Trump has ordered a major naval deployment off Venezuela’s northern coast.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/dec/01/trump-administration-news-update-today\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}