{
  "updatedAt": "2025-10-30T06:38:11.475Z",
  "items": [
    {
      "title": "Here’s the latest.",
      "url": "https://www.nytimes.com/live/2025/10/28/us/trump-news-south-korea/heres-the-latest",
      "summary": ""
    },
    {
      "title": "California Animal Rights Activist Convicted in Chicken Theft",
      "url": "https://www.nytimes.com/2025/10/29/us/animal-rights-activist-convicted-sonoma-chickens.html",
      "summary": "Zoe Rosenberg, a California animal rights activist, was found guilty of conspiracy and trespassing for taking four chickens from a poultry plant."
    },
    {
      "title": "Trump Threatens to Resume Nuclear Weapons Testing, Minutes Before Xi Meeting",
      "url": "https://www.nytimes.com/2025/10/29/us/politics/trump-nuclear-weapons-testing.html",
      "summary": "Just minutes before he was scheduled to meet President Xi Jinping of China, the president threatened on social media to resume nuclear testing “on an equal basis” with other countries."
    },
    {
      "title": "Their Professors Caught Them Cheating. They Used A.I. to Apologize.",
      "url": "https://www.nytimes.com/2025/10/29/us/university-illinois-students-cheating-ai.html",
      "summary": "Two professors at the University of Illinois Urbana-Champaign said they grew suspicious after receiving identical apologies from dozens of students they had accused of academic dishonesty."
    },
    {
      "title": "U.S. Military Kills Four More People Accused of Smuggling Drugs on Boats",
      "url": "https://www.nytimes.com/2025/10/29/us/politics/military-drug-boat-strikes.html",
      "summary": "Defense Secretary Pete Hegseth said the latest strike took place on Wednesday in the eastern Pacific. It came two days after the deadliest set of strikes in the weekslong campaign in Latin America."
    },
    {
      "title": "Tennessee Man Released After Month in Jail Over Charlie Kirk Post",
      "url": "https://www.nytimes.com/2025/10/29/us/tennessee-man-released-after-month-in-jail-over-charlie-kirk-post.html",
      "summary": "The authorities claimed that the meme Larry Bushart shared on Facebook had been perceived as a threat of mass violence, leading to a felony charge that has now been dropped."
    },
    {
      "title": "Trump-Xi meeting: US president says rare earths deal and tariff reduction agreed in crunch trade talks",
      "url": "https://www.theguardian.com/us-news/2025/oct/30/trump-and-xi-meet-in-south-korea-for-crunch-talks-on-trade",
      "summary": "&lt;p&gt;Speaking to the media following the talks, Donald Trump says meeting with Chinese counterpart was ‘amazing’&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates#top-of-blog\"&gt;Live coverage: Xi says US and China should be ‘partners and friends’&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Donald Trump has described crucial trade talks with the Chinese president, Xi Jinping, in South Korea as “amazing”, saying their dispute over the supply of rare earths had been settled and that he would visit China in April.&lt;/p&gt;&lt;p&gt;Trump shook hands with Xi after their meeting and immediately boarded Air Force One to return to Washington. He later told reporters the Chinese leader had agreed to work “very hard” to prevent the production of fentanyl, a synthetic opioid drug that has caused a surge of deaths among Americans. In return, Trump said he would lower fentanyl-linked tariffs from 20% to 10%, thereby lowering overall tariffs from 57% to 47%.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/30/trump-and-xi-meet-in-south-korea-for-crunch-talks-on-trade\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump directs Pentagon to match Russia and China in nuclear weapons testing",
      "url": "https://www.theguardian.com/us-news/2025/oct/29/trump-pentagon-us-nuclear-weapons",
      "summary": "&lt;p&gt;US president makes threat in Truth Social post in wake of Russian nuclear-powered weapons tests, and shortly before meeting with Chinese leader Xi Jinping &lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates\"&gt;Trump meets Xi in South Korea – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Donald Trump has instructed the Pentagon to immediately start matching other nuclear powers in their testing of nuclear weapons, specifically citing Russia and China.&lt;/p&gt;&lt;p&gt;In a Wednesday &lt;a href=\"https://truthsocial.com/@realDonaldTrump/posts/115460423936412555\"&gt;post to Truth Social&lt;/a&gt;, Trump said that “because of other countries’ testing programs, I have instructed the Department of War to start testing our Nuclear Weapons on an equal basis. That process will begin immediately.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/29/trump-pentagon-us-nuclear-weapons\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}