{
  "updatedAt": "2025-11-17T18:37:53.191Z",
  "items": [
    {
      "title": "Is Your Community Becoming More Divided?",
      "url": "https://www.nytimes.com/2025/11/17/us/political-division-community.html",
      "summary": "We want to hear about the ways in which the country’s politics are effecting your neighborhood, in ways big or small."
    },
    {
      "title": "Southern California House Explosion Injures 8",
      "url": "https://www.nytimes.com/2025/11/17/us/home-explosion-chino-hills-california.html",
      "summary": "Fire officials said crews stopped a gas leak at the house but they were investigating the cause of the explosion, which prompted the evacuations of 16 nearby houses."
    },
    {
      "title": "Judge Says Justice Dept. May Have Committed ‘Misconduct’ in Comey Case",
      "url": "https://www.nytimes.com/2025/11/17/us/politics/comey-justice-department-misconduct.html",
      "summary": "The ruling by a magistrate judge in Alexandria, Va., was only the most recent setback in the department’s efforts to bring charges against the former F.B.I. director James B. Comey."
    },
    {
      "title": "As Trump Looks for Distraction on Epstein, Justice Dept. Rushes to His Aid",
      "url": "https://www.nytimes.com/2025/11/17/us/politics/trump-bondi-democrats-justice-department.html",
      "summary": "The department was deployed, in effect, as an arm of the president’s rapid-response operation to help him muscle through a damaging news cycle over Jeffrey Epstein, former and current officials said."
    },
    {
      "title": "Hegseth Assigns Deputy to Oversee U.S.S. Cole Bombing Case",
      "url": "https://www.nytimes.com/2025/11/17/us/politics/uss-cole-bombing-case.html",
      "summary": "The attack killed 17 American sailors in 2000. The new assignment was the latest change to oversight in the dysfunctional military commission system."
    },
    {
      "title": "After Marshawn Kneeland’s Death, Cowboys Prepare to Take the Field Again",
      "url": "https://www.nytimes.com/2025/11/17/us/marshawn-kneeland-dallas-cowboys.html",
      "summary": "Marshawn Kneeland spent nearly all of his 24 years working to get to the N.F.L. He died two days after scoring his first touchdown."
    },
    {
      "title": "Trump is ‘panicking’ after failing ‘to kill our Jeffrey Epstein investigation’, says top Democrat, after president’s sudden pivot – live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/17/donald-trump-jeffrey-epstein-files-republicans-democrats-world-cup-us-politics-live-news-updates",
      "summary": "&lt;p&gt;Robert Garcia, ranking member of House oversight committee, says president has ‘realized he is about to lose this Epstein vote’ and calls for release of files&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/17/trump-tells-republicans-to-vote-to-release-epstein-files-saying-we-have-nothing-to-hide\"&gt;Trump urges Republicans to vote for release of Epstein files in surprise U-turn&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;US Border Patrol officials said they had arrested 81 people over five hours in Charlotte, North Carolina, on Saturday, the first day of the targeted operation.&lt;br&gt;&lt;br&gt; The crackdown involving federal agents was only announced last week.&lt;/p&gt;&lt;p&gt;Mass deportation and strict enforcement of immigration laws have been a key part of Trump’s agenda since returning to office this year.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/17/donald-trump-jeffrey-epstein-files-republicans-democrats-world-cup-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "New international student enrollments in US plunge this year, data shows",
      "url": "https://www.theguardian.com/us-news/2025/nov/17/international-student-enrollments-plunge",
      "summary": "&lt;p&gt;Enrollment fell 17%, the largest drop in a decade aside from the pandemic, amid Trump’s immigration crackdown&lt;/p&gt;&lt;p&gt;The number of international students enrolling in US colleges and universities plunged this year as the Trump administration’s aggressive immigration crackdown on higher education began to bite, data released on Monday reveals.&lt;/p&gt;&lt;p&gt;New international student enrollment fell 17% in the current academic year, the largest drop in more than a decade aside from the Covid-19 pandemic, according to &lt;a href=\"https://www.iie.org/publications/fall-2025-snapshot-on-international-student-enrollment/\"&gt;a fall snapshot&lt;/a&gt; published by the Institute of International Education (IIE).&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/17/international-student-enrollments-plunge\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}