{
  "updatedAt": "2025-11-12T12:57:51.320Z",
  "items": [
    {
      "title": "House Returns After Long Recess to Take Up Bill to End Shutdown",
      "url": "https://www.nytimes.com/2025/11/12/us/politics/house-vote-government-shutdown.html",
      "summary": "After a 54-day break, the House is expected to vote on the Senate-passed spending deal. Approval would clear it for President Trump’s signature."
    },
    {
      "title": "Dale Romans Enters Kentucky Senate Race as Democrats’ Latest Long Shot",
      "url": "https://www.nytimes.com/2025/11/12/us/politics/dale-romans-senate-kentucky-democrats.html",
      "summary": "Dale Romans, pitching himself as an independent-minded Democrat in the mold of Joe Manchin, will try to win a seat for the party in the deep-red state."
    },
    {
      "title": "A Look Into the Early Days of Migrant Detentions at Guantánamo",
      "url": "https://www.nytimes.com/2025/11/12/us/politics/migrant-detentions-guantanamo.html",
      "summary": "Government employees distributed Bibles and prepared materials “commonly used in Hinduism, Sikhism and Rastafarianism,” according to emails."
    },
    {
      "title": "The I.R.S. Tried to Stop This Tax Dodge. Scott Bessent Used It Anyway.",
      "url": "https://www.nytimes.com/2025/11/12/us/politics/scott-bessent-irs-loophole.html",
      "summary": "Like many on Wall Street, Treasury Secretary Scott Bessent used a limited partnership to avoid Medicare taxes. Unlike the others, he’s now overseeing the I.R.S."
    },
    {
      "title": "He Died at a School for Disabled People. Decades Later, His Brother Sought Answers.",
      "url": "https://www.nytimes.com/2025/11/12/us/fernald-state-school-disabled-people.html",
      "summary": "John Scott was rarely spoken of in his family after he was placed in an institution. After a half-century, his youngest brother set out to learn who he was and what had happened to him."
    },
    {
      "title": "3 Bob Ross Paintings Sell for $600,000 to Support Public Broadcasters",
      "url": "https://www.nytimes.com/2025/11/12/us/bob-ross-paintings-auction-public-broadcasters.html",
      "summary": "The landscapes by the television host were sold as part of a campaign to help public television stations weather federal funding cuts."
    },
    {
      "title": "House set to vote on deal to end shutdown amid Democratic splits – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/12/donald-trump-us-government-shutdown-house-democrats-republicans-latest-news-updates",
      "summary": "&lt;p&gt;Democrats have vowed to vote against the proposal after a faction of senators broke with party to pass a compromise&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;Full report – &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/12/house-vote-shutdown-bill\"&gt;House to vote on bill that could end government shutdown&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Top Democrats have vowed to oppose the government funding bill, in large part because it does not directly address the extension of health insurance subsidies that are to expire at the end of this year. But it is likely to pass the &lt;strong&gt;House&lt;/strong&gt; because it only needs a simple majority, which Republicans narrowly have, reports Agence France-Presse (AFP).&lt;/p&gt;&lt;p&gt;From the start, &lt;strong&gt;Donald Trump&lt;/strong&gt; had piled pressure on Democrats by letting the shutdown be as punishing as possible and refusing to negotiate on their demands on health insurance.&lt;/p&gt;&lt;p&gt;This morning, President Isaac Herzog received the attached letter from US President Donald Trump, calling on him to consider granting a pardon to prime minister Benjamin Netanyahu.&lt;/p&gt;&lt;p&gt;I hereby call on you to fully pardon Benjamin Netanyahu, who has been a formidable and decisive war time prime minister.&lt;/p&gt;&lt;p&gt;While I absolutely respect the independence of the Israeli justice system … I believe that this ’case’ against Bibi … is political, unjustified prosecution.&lt;/p&gt;&lt;p&gt;Alongside and not withstanding this … anyone seeking a presidential pardon must submit a formal request in accordance with the established procedures.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/12/donald-trump-us-government-shutdown-house-democrats-republicans-latest-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Texas’s Eagle Pass voters turned to Trump. A year later, some have doubts",
      "url": "https://www.theguardian.com/us-news/2025/nov/12/texas-eagle-pass-trump-deportations",
      "summary": "&lt;p&gt;Once at the heart of record migration, the Texas border town now faces new fears over Trump’s sweeping deportation drive&lt;/p&gt;&lt;p&gt;Along southern &lt;a href=\"https://www.theguardian.com/us-news/texas\"&gt;Texas&lt;/a&gt;, the Rio Grande forms the US-Mexico border, an arrangement established after the end of the Mexican-American war. Eagle Pass, which had been known as El Paso del Águila, became the first US settlement on the Rio Grande.&lt;/p&gt;&lt;p&gt;Swimming across the river has remained treacherous ever since. But migrants never stopped risking their lives to set foot on US soil –&lt;strong&gt; &lt;/strong&gt;and in 2023,&lt;strong&gt; &lt;/strong&gt;those numbers reach record highs as Eagle Pass, the seat of Maverick county, became the epicenter of growing backlash over &lt;a href=\"https://www.theguardian.com/us-news/biden-administration\"&gt;the Biden administration&lt;/a&gt;’s immigration policies.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/12/texas-eagle-pass-trump-deportations\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}