{
  "updatedAt": "2025-10-22T06:39:18.874Z",
  "items": [
    {
      "title": "Vehicle Crashes Into Security Gate Outside the White House",
      "url": "https://www.nytimes.com/2025/10/21/us/white-house-car-crash.html",
      "summary": "The Secret Service said the driver was arrested and there was no longer a threat. President Trump was in the White House at the time, the agency said."
    },
    {
      "title": "Ecuador Rejects Prosecution of Survivor of U.S. Strike on Vessel",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/ecuador-us-strike-survivor.html",
      "summary": "The country has freed the man, one of two survivors of a U.S. military strike on a submersible vessel last week, defying President Trump’s claim that he would be held and prosecuted."
    },
    {
      "title": "What to Know About Trump’s Plan for a Triumphal Arch in Washington",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/trump-arch-washington-memorial.html",
      "summary": "President Trump has proposed construction of an arch in the style of the Arc de Triomphe in Washington in the lead-up to the nation’s 250th anniversary."
    },
    {
      "title": "SpaceX, Sued by Cards Against Humanity, Settles Trespassing Case",
      "url": "https://www.nytimes.com/2025/10/21/us/spacex-cards-against-humanity-lawsuit-settlement.html",
      "summary": "Cards Against Humanity had accused Elon Musk’s company of squatting on land that it owns near the southern border in Texas."
    },
    {
      "title": "U.S. Attacks More Boats as Tensions With Venezuela Rise: What’s Happened So Far",
      "url": "https://www.nytimes.com/2025/10/21/us/trump-attacks-venezuela-boats.html",
      "summary": "The Trump administration is ratcheting up pressure on the Venezuelan president, Nicolás Maduro, while striking vessels that it says are trafficking drugs."
    },
    {
      "title": "In Trump’s Washington, Hate Is Not a Deal Breaker",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/trump-ingrassia-republicans.html",
      "summary": "Paul Ingrassia’s nomination illustrated how much antisemitic and hateful rhetoric has been explained away or rewarded by Republicans in power."
    },
    {
      "title": "Protests erupt in New York City after Ice raids Chinatown over ‘counterfeit goods’",
      "url": "https://www.theguardian.com/us-news/2025/oct/21/new-york-city-chinatown-ice-raids-protests",
      "summary": "&lt;p&gt;Demonstrators were seen near a federal building after an unknown number of detainees were taken by agents &lt;/p&gt;&lt;p&gt;Hundreds showed up to protests that broke out in New York City on Tuesday evening after Immigration and Customs Enforcement (Ice) raids related to “selling counterfeit goods” were conducted in the Chinatown neighborhood earlier in the day and resulted in an unknown number of people being detained.&lt;/p&gt;&lt;p&gt;Hours after federal agents descended on lower Manhattan, demonstrators were seen assembling near the 26 Federal Plaza Immigration Building where they believed detainees were taken. Many shouted chants including “&lt;a href=\"https://bsky.app/profile/hamiltonnolan.bsky.social/post/3m3qichgqdk2w\"&gt;Ice out of New York&lt;/a&gt;” and “No Ice, no KKK, no fascist USA.”&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/21/new-york-city-chinatown-ice-raids-protests\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump nominee to lead whistleblower office withdraws after racist texts – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates",
      "summary": "&lt;p&gt;This live blog is now closed&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The Central Intelligence Agency is providing the bulk of the intelligence used to carry out the controversial lethal air strikes by the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; against small, fast-going boats in the Caribbean Sea suspected of carrying drugs from Venezuela, according to three sources familiar with the operations.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Experts say the agency’s central role means much of the evidence used to select which alleged smugglers to kill on the open sea will almost certainly remain secret.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}