{
  "updatedAt": "2025-11-28T18:37:02.905Z",
  "items": [
    {
      "title": "Trump’s Response to Shooting Shows Intensified Anti-Migrant Stance",
      "url": "https://www.nytimes.com/2025/11/28/us/politics/trumps-response-to-shooting-shows-intensified-anti-migrant-stance.html",
      "summary": "The president is furiously demanding limits on migration and attacking ethnic groups as he steps up his efforts to equate immigration with crime and economic distress."
    },
    {
      "title": "‘My Baby Girl Has Passed to Glory,’ Says Father of Guard Soldier Killed in D.C. Shooting",
      "url": "https://www.nytimes.com/2025/11/28/us/politics/dc-shooting-victims-beckstrom-wolfe.html",
      "summary": "Specialist Sara Beckstrom, who died on Thursday, was not initially excited to go to Washington, but had grown to enjoy the city. Staff Sgt. Andrew Wolfe remained in critical condition on Friday."
    },
    {
      "title": "Seattle’s Gas Works Park Seen As A Public Nuisance After a Suicide",
      "url": "https://www.nytimes.com/2025/11/28/us/politics/gas-works-park-teen-death.html",
      "summary": "For years, architects and design experts have resisted safety changes at Seattle’s Gas Works Park, but after a teenager died there this summer, his parents want it declared a public nuisance."
    },
    {
      "title": "Trump Says U.S. Will Pause Migration From ‘Third World Countries’ After D.C. Shooting",
      "url": "https://www.nytimes.com/2025/11/28/us/trump-immigration-pause-third-world-countries.html",
      "summary": "In social media posts, President Trump also seemed to target migrants who were already in the country."
    },
    {
      "title": "‘Hey, Lemonade!’: A Backstage Fixture at the Grand Ole Opry",
      "url": "https://www.nytimes.com/2025/11/28/us/politics/grand-ole-opry-lemonade.html",
      "summary": "Legions of backstage workers have helped the Grand Ole Opry thrive for a century in Nashville. Diana McBride is known for her lemonade — and much more."
    },
    {
      "title": "National Guard Soldier Dies After Being Shot in Washington",
      "url": "https://www.nytimes.com/2025/11/28/us/national-guard-shooting-washington.html",
      "summary": "Another Guard member was in critical condition. The suspect is an Afghan man who once served in a paramilitary unit that worked with U.S. forces, officials said."
    },
    {
      "title": "National guard shooting suspect to be charged with murder as Trump steps up immigration crackdown – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/28/trump-washington-dc-shooting-politics-updates",
      "summary": "&lt;p&gt;US attorney for DC says charges upgraded to murder in first degree after national guard member dies; US president says he will ‘permanently pause’ migration from ‘third world countries’ &lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;Full report: &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/28/trump-says-he-will-permanently-pause-migration-from-third-world-countries-after-national-guard-shooting\"&gt;Trump says he will ‘permanently pause’ migration from ‘third world countries’&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;West Virginia governor Patrick Morrisey reaffirmed his support for the state’s National Guard members deployed in Washington, DC.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;“When you have these terrorists, when you have these evildoers, you’re not going to back down when they go after our servicemen and women,” Morrisey, a Republican, told CNN.&lt;/p&gt;&lt;p&gt;I’m devastated to learn of the passing of Specialist Sarah Beckstrom, a member of the West Virginia National Guard. She was only twenty years old.&lt;/p&gt;&lt;p&gt;As families across the nation come together today to celebrate Thanksgiving, let us take a moment to think of those in West Virginia who have been plunged into unimaginable grief.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/28/trump-washington-dc-shooting-politics-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Leaked files show far-right influences among Project 2025 applicants",
      "url": "https://www.theguardian.com/us-news/2025/nov/28/project-2025-heritage-foundation-hack",
      "summary": "&lt;p&gt;Applicants reportedly cited Nazi theorists and other extremists as inspiration for Trump administration roles&lt;/p&gt;&lt;p&gt;Hacked materials from the powerful rightwing thinktank the Heritage Foundation show that applicants to a Project 2025-branded effort to create a talent pool for the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; cited the influence of &lt;a href=\"https://www.theguardian.com/world/nazism\"&gt;Nazi&lt;/a&gt; political theorists and other far-right thinkers on their political views.&lt;/p&gt;&lt;p&gt;Not all applicants revealed in the hack ended up with Trump administration jobs, but some current appointees did make applications.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/28/project-2025-heritage-foundation-hack\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}