{
  "updatedAt": "2025-11-06T18:39:22.467Z",
  "items": [
    {
      "title": "Investigators Sift Through Plane Crash Wreckage in Louisville",
      "url": "https://www.nytimes.com/2025/11/06/us/ups-plane-crash-louisville-wreckage-investigation.html",
      "summary": "A departing UPS cargo plane caught fire and dropped an engine crashing in an industrial zone. At least 12 people were killed."
    },
    {
      "title": "Challenging Trump, Pelosi Made History",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/trump-pelosi-relationship.html",
      "summary": "The first and only woman to be speaker of the House also was the most powerful and prominent woman in Washington to effectively confront President Trump."
    },
    {
      "title": "Here Are Airports That Could Be Affected by the Air Traffic Slowdown",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/airports-list-flight-cuts-government-shutdown.html",
      "summary": "The cuts to flights are expected to begin Friday and deepen over the weekend to reach a 10 percent reduction in air traffic."
    },
    {
      "title": "A Prison Hospice Program in California Offers Care to Dying Inmates",
      "url": "https://www.nytimes.com/2025/11/06/us/california-medical-facility-hospice-prison.html",
      "summary": "Most people who die in prison die alone. Programs like the one at California Medical Facility aim to prevent that."
    },
    {
      "title": "Bishops With Ties to Trump Commission Criticize Treatment of Immigrants",
      "url": "https://www.nytimes.com/2025/11/06/us/trump-bishops-communion.html",
      "summary": "The Roman Catholic prelates cited detainees’ lack of access to religious sacraments like communion."
    },
    {
      "title": "Nancy Pelosi Announces Retirement From Congress in 2027",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/nancy-pelosi-house-retire.html",
      "summary": "Representative Nancy Pelosi, the only female House speaker, said she will not run for re-election. She wielded immense power and became a Democratic icon, while she was demonized by conservatives."
    },
    {
      "title": "‘Iconic, heroic, trailblazing’: Democrats praise Pelosi’s work after she announces plan to retire – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
      "summary": "&lt;p&gt;House minority leader Hakeem Jeffries calls Pelosi ‘greatest Speaker of all time’ as she announces she will stand down in 2027&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/nov/06/nancy-pelosi-retire-congress\"&gt;Nancy Pelosi, a force on Capitol Hill for decades, to retire from Congress&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;It’s now day 37 of the ongoing government shutdown, the longest on record, with both parties continuing to blame the other for the lapse in funding.&lt;/p&gt;&lt;p&gt;For his part, Donald Trump has turned his attention to the filibuster – the procedural mechanism that requires 60 votes in the Senate to end debate on a piece of legislation and bring it to the floor for a vote. He’s hammered home his wishes on Truth Social, and in front of lawmakers at a White House breakfast on Tuesday.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "US House panel requests interview with Andrew in Jeffrey Epstein investigation",
      "url": "https://www.theguardian.com/us-news/2025/nov/06/epstein-andrew-interview-house-oversight-committee",
      "summary": "&lt;p&gt;Robert Garcia, top Democrat on House oversight panel, makes formal request in letter published Thursday&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates\"&gt;US politics live – latest updates&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;A US congressional panel investigating pedophile financier &lt;a href=\"https://www.theguardian.com/us-news/jeffrey-epstein\"&gt;Jeffrey Epstein&lt;/a&gt; has written to &lt;a href=\"https://www.theguardian.com/uk/prince-andrew\"&gt;Andrew Mountbatten Windsor&lt;/a&gt;, formerly Britain’s Prince Andrew, to ask that he submit to questioning as part of its investigation into Epstein’s criminal operations.&lt;/p&gt;&lt;p&gt;In a letter published on Thursday, California congressman Robert Garcia, the top Democrat on the House oversight committee, requested that &lt;a href=\"https://www.theguardian.com/uk/prince-charles\"&gt;King Charles III&lt;/a&gt;’s younger brother help with its inquiry.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/06/epstein-andrew-interview-house-oversight-committee\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}