{
  "updatedAt": "2025-10-03T18:35:00.770Z",
  "items": [
    {
      "title": "U.S. Military Attacked Boat Off Venezuela, Killing Four Men, Hegseth Says",
      "url": "https://www.nytimes.com/2025/10/03/us/politics/hegseth-military-boat-venezuela.html",
      "summary": "It was the fourth strike in the Trump administration’s legally disputed campaign targeting suspected drug runners in the Caribbean Sea."
    },
    {
      "title": "Mamdani Condemns Trump’s $18 Billion Funding Freeze for New York-Area Projects",
      "url": "https://www.nytimes.com/2025/10/03/us/politics/mamdani-trump-funding-freeze-new-york-projects.html",
      "summary": "The Democratic front-runner for mayor of New York said that “these are the actions of one who is cruel to this city.”"
    },
    {
      "title": "Statue of Trump and Epstein Holding Hands Returns to National Mall",
      "url": "https://www.nytimes.com/2025/10/03/us/donald-trump-jeffrey-epstein-statue-washington.html",
      "summary": "The statue, titled “Best Friends Forever,” was reinstalled after it was removed last week. An anonymous group of artists has taken credit for the work."
    },
    {
      "title": "Who Do Americans Blame for the Government Shutdown?",
      "url": "https://www.nytimes.com/2025/10/03/us/government-shutdown-democrats-republicans-blame.html",
      "summary": "In the first few days of the government shutdown, many voters expressed frustration over the inability of Republicans and Democrats to compromise."
    },
    {
      "title": "Body Camera Video Shows Police Confronting Michigan Church Gunman",
      "url": "https://www.nytimes.com/2025/10/03/us/michigan-church-attack-body-camera-video.html",
      "summary": "In the newly released video, two officers can be seen outside of the Latter-day Saints church, along with a bystander holding a handgun. The shooter died in an exchange of gunfire."
    },
    {
      "title": "Trump Administration Suspends $2.1 Billion in Funding for Chicago Transit Projects",
      "url": "https://www.nytimes.com/2025/10/03/us/trump-chicago-transit-funding.html",
      "summary": "The move, condemned by Illinois officials, appeared to be part of the Trump administration’s aim of using the government shutdown as leverage."
    },
    {
      "title": "Sean ‘Diddy’ Combs sentencing live: mogul’s children say he is ‘changed man’; prosecutor says he is casting himself as ‘victim’",
      "url": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
      "summary": "&lt;p&gt;Combs, who could face lengthy prison sentence after being convicted of prostitution charges in July, is expected to address the court&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/music/2025/oct/03/sean-diddy-combs-criminal-sentencing\"&gt;Sean ‘Diddy’ Combs expected to speak in court&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/music/2025/oct/03/sean-diddy-combs-sentencing\"&gt;Sean ‘Diddy’ Combs sentencing: what to know&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;The prosecution &lt;a href=\"https://viewer.gutools.co.uk/us-news/2025/sep/30/sean-diddy-combs-sentence-recommendation\"&gt;submitted several victim impact &lt;/a&gt;statements to the court ahead of sentencing, including one from Ventura.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;“While the jury did not seem to understand or believe that I engaged in freak-offs because of the force and coercion the defendant used against me, I know that is the truth, and his sentence should reflect the reality of the evidence and my lived experience as a victim” Ventura &lt;a href=\"https://viewer.gutools.co.uk/us-news/2025/sep/30/sean-diddy-combs-sentence-recommendation\"&gt;wrote&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Hegseth says four killed in US strike on alleged drug boat off Venezuelan coast",
      "url": "https://www.theguardian.com/us-news/2025/oct/03/hegseth-venezuela-deadly-boat-strike",
      "summary": "&lt;p&gt;Pentagon chief says strike – fourth by US military in recent weeks – targeted boat with ‘substantial amounts’ of drugs&lt;/p&gt;&lt;p&gt;The United States carried out a strike against an alleged drug-trafficking boat on Friday that killed four people, US defense secretary &lt;a href=\"https://www.theguardian.com/us-news/pete-hegseth\"&gt;Pete Hegseth&lt;/a&gt; said, a day after the Trump administration told Congress it was entering a new “non-international armed conflict” with cartels.&lt;/p&gt;&lt;p&gt;The strike, which Hegseth said he directed on Donald Trump’s orders, appears to be at least the fourth in recent weeks. Hegseth gave few details about the boat or the evidence that it was carrying narcotics, other than saying the US had confirmed it was carrying drugs.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/03/hegseth-venezuela-deadly-boat-strike\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}