{
  "updatedAt": "2025-10-13T18:35:10.855Z",
  "items": [
    {
      "title": "Part Enabler, Part Buffer: The Bind of the Justice Dept.’s No. 2",
      "url": "https://www.nytimes.com/2025/10/13/us/politics/todd-blanche-justice-department-trump.html",
      "summary": "Todd Blanche, the deputy attorney general, has helped usher in President Trump’s retribution campaign. But he faces anger on the right for resisting some of the most extreme measures."
    },
    {
      "title": "Small Plane Crashes on Massachusetts Highway, Killing 2",
      "url": "https://www.nytimes.com/2025/10/13/us/highway-plane-crash-massachusetts.html",
      "summary": "One person on the ground was injured when a plane crashed on a grassy highway median, forcing the closure of Interstate 195 in both directions in Dartmouth, Mass., officials said."
    },
    {
      "title": "Miami Says Farewell to Its Seaquarium",
      "url": "https://www.nytimes.com/2025/10/13/us/miami-seaquarium-closing.html",
      "summary": "The aquatic park, a South Florida landmark for 70 years and also the subject of complaints over animal rights, drew visitors on Sunday before closing for good."
    },
    {
      "title": "Originalist ‘Bombshell’ Complicates Case on Trump’s Power to Fire Officials",
      "url": "https://www.nytimes.com/2025/10/13/us/politics/originalism-trump-supreme-court-unitary-executive.html",
      "summary": "As the Supreme Court seems poised to expand the president’s power, a leading scholar whose work the justices have often cited issued a provocative dissent."
    },
    {
      "title": "Fragments of 2003 Cable Detail Torture in a Secret C.I.A. Prison",
      "url": "https://www.nytimes.com/2025/10/13/us/politics/cia-torture-black-sites.html",
      "summary": "An interrogator covertly used a power drill and handgun to menace a prisoner, without permission from the agency’s headquarters."
    },
    {
      "title": "Dozens Rescued in Remote Alaskan Villages in Storm That Swept Away Homes",
      "url": "https://www.nytimes.com/2025/10/13/us/alaska-flooding-rescues.html",
      "summary": "The Coast Guard and the Alaska National Guard were conducting search-and-rescue operations in two villages along the Bering Sea on Sunday."
    },
    {
      "title": "Obama takes aim at companies cutting deals with Trump: ‘We have capacity to take a stand’",
      "url": "https://www.theguardian.com/us-news/2025/oct/13/obama-trump-administration-deals-settlements",
      "summary": "&lt;p&gt;Universities, law firms and businesses that have changed course should have stood by convictions, says ex-president&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/barack-obama\"&gt;Barack Obama&lt;/a&gt; took aim at institutions and businesses who made deals or worked out settlements with the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt;, noting on a new podcast episode: “We all have this capacity, I think, to take a stand.”&lt;/p&gt;&lt;p&gt;In a talk with Marc Maron on the comedian’s last edition of his long-running &lt;a href=\"https://apnews.com/article/marc-maron-podcast-essential-episodes-williams-obama-7cf47716ed03728b7f1ce7ca73583c9f\"&gt;WTF With Marc Maron&lt;/a&gt;, the former US president said institutions – including law firms, universities and businesses – that have changed course during the Trump administration should have stood by their convictions.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/13/obama-trump-administration-deals-settlements\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Majority of special education staff in US education department laid off – report",
      "url": "https://www.theguardian.com/us-news/2025/oct/13/special-education-department-layoffs",
      "summary": "&lt;p&gt;Layoffs ‘decimating’ office responsible for protecting rights of infants, children and youth with disabilities, says worker&lt;/p&gt;&lt;p&gt;The majority of staff in the education department handling special education has been laid off, according to multiple reports.&lt;/p&gt;&lt;p&gt;Friday’s total of &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/10/federal-workers-pay-government-shutdown\"&gt;466 layoffs&lt;/a&gt; across the education department also impacted the Office of Special Education and Rehabilitative Services, which oversees programs that support millions of children and adults with disabilities nationwide, &lt;a href=\"https://www.npr.org/2025/10/13/nx-s1-5572489/trump-special-education-department-funding-layoffs-disabilities\"&gt;according to&lt;/a&gt; sources speaking to various outlets.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/oct/13/special-education-department-layoffs\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}