{
  "updatedAt": "2025-09-22T06:53:51.145Z",
  "items": [
    {
      "title": "12 Emotional Hours: A Spectator Reflects on One Full Day (Without Caffeine)",
      "url": "https://www.nytimes.com/2025/09/21/us/politics/spectator-long-day.html",
      "summary": "Attending Charlie Kirk’s memorial involved lots of standing, worrying and waiting. But for one Colorado Springs woman, it was all worth it."
    },
    {
      "title": "Trump Remembers Kirk as a Martyr While Attacking Political Opponents",
      "url": "https://www.nytimes.com/2025/09/21/us/elections/trump-charlie-kirk-memorial-service.html",
      "summary": "President Trump oscillated between honoring Charlie Kirk’s life and promoting his own political agenda in his remarks at the conservative activist’s memorial in Arizona."
    },
    {
      "title": "Trump and Musk Are Seen Together at Kirk Memorial, Months After Falling-Out",
      "url": "https://www.nytimes.com/2025/09/21/us/politics/trump-musk-kirk-memorial.html",
      "summary": "The meeting came just three months after Mr. Musk exited the government in a fit of rage, attacking the president on social media."
    },
    {
      "title": "At Kirk Service, an Extraordinary Fusion of Government and Christianity",
      "url": "https://www.nytimes.com/2025/09/21/us/politics/kirk-memorial-service-christianity-religion.html",
      "summary": "The memorial reflected the degree to which conservative Christianity had melded with Republican politics in the Trump era."
    },
    {
      "title": "The Conservative Figures That Attended the Charlie Kirk Memorial",
      "url": "https://www.nytimes.com/2025/09/21/us/politics/republican-right-wing-charlie-kirk-funeral.html",
      "summary": "Led by President Trump, the list of guests included high-ranking members of his administration, conservative influencers and far-right media personalities."
    },
    {
      "title": "‘We Are All Charlie’: Thousands Stood in Line for Hours in Hopes of Paying Tribute",
      "url": "https://www.nytimes.com/2025/09/21/us/politics/charlie-kirk-tribute-state-farm-stadium.html",
      "summary": "Many endured stifling heat outside the stadium in Glendale, Ariz. Some who were turned away headed to a nearby arena, while others went home."
    },
    {
      "title": "High spirits at San Francisco’s lowrider parade – in pictures",
      "url": "https://www.theguardian.com/us-news/gallery/2025/sep/22/san-francisco-lowrider-car-parade-in-pictures",
      "summary": "&lt;p&gt;Revellers watch the cars hop and bounce and spread their pro-immigration message &lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/gallery/2025/sep/22/san-francisco-lowrider-car-parade-in-pictures\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump news at a glance: president calls Charlie Kirk a ‘martyr’ at memorial",
      "url": "https://www.theguardian.com/us-news/2025/sep/22/trump-administration-news-updates-latest",
      "summary": "&lt;p&gt;President says ‘I hate my opponents’; Kirk’s widow forgives shooter; Murdochs could be part of TikTok deal – key US politics stories from 21 September at a glance&lt;/p&gt;&lt;p&gt;Donald Trump gave a rambling, freewheeling address at the Charlie Kirk memorial in Alabama on Sunday, taking aim at Joe Biden and trailing a major announcement on autism as well as praising Kirk, who was shot dead on 10 September.&lt;/p&gt;&lt;p&gt;In front of a crowd of tens of thousands, Trump said Kirk was a “great American hero” and “martyr” for freedom. During the event he sat side-by-side with billionaire Elon Musk, a once trusted adviser with whom the US president had a spectacular public falling out.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/22/trump-administration-news-updates-latest\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}