{
  "updatedAt": "2025-11-13T06:39:50.978Z",
  "items": [
    {
      "title": "The D.N.C. Ordered Workers Back to the Office. Its Union Isn’t Pleased.",
      "url": "https://www.nytimes.com/2025/11/12/us/politics/dnc-return-to-office-ken-martin.html",
      "summary": "Thumbs-down emojis flowed onscreen as Washington-area employees learned they would have to show up five days a week. Their union called the move “callous.”"
    },
    {
      "title": "Trump Administration to Drastically Cut Housing Grants",
      "url": "https://www.nytimes.com/2025/11/12/us/politics/trump-homeless-funding.html",
      "summary": "In a major shift, HUD’s plan would direct most of the $3.5 billion in homelessness funds away from Housing First to programs that prioritize work and drug treatment."
    },
    {
      "title": "After Trump Split, Epstein Said He Could ‘Take Him Down’",
      "url": "https://www.nytimes.com/2025/11/12/us/epstein-emails-trump.html",
      "summary": "Jeffrey Epstein cast himself as a Trump insider and wanted to leverage potentially damaging information about the president and his business dealings, according to emails with associates."
    },
    {
      "title": "Trump Signs Bill to End Government Shutdown",
      "url": "https://www.nytimes.com/2025/11/12/us/politics/government-shutdown-vote-trump.html",
      "summary": "President Trump signed the bill ending the shutdown after 43 days, after the House approved it, largely on party lines."
    },
    {
      "title": "Gavin Newsom’s Former Chief of Staff Arrested and Charged With Corruption",
      "url": "https://www.nytimes.com/2025/11/12/us/newsom-aide-corruption-charges.html",
      "summary": "Dana Williamson, a top Democratic consultant in California, was accused of conspiring to skim over $200,000 in campaign funds that belonged to a Biden administration official."
    },
    {
      "title": "Federal Judge Calls For Release of Some Immigrants Arrested in Chicago Area",
      "url": "https://www.nytimes.com/2025/11/12/us/immigrants-wrongful-detention-chicago-release.html",
      "summary": "The judge raised concerns that federal agents may have violated terms of a consent decree during their immigration enforcement crackdown in Illinois."
    },
    {
      "title": "Newly released emails reveal Epstein kept close eye on Trump",
      "url": "https://www.theguardian.com/us-news/2025/nov/13/jeffrey-epstein-emails-trump",
      "summary": "&lt;p&gt;Documents show staff kept Epstein informed of Trump’s air travel – and Epstein kept up with news about former friend&lt;/p&gt;&lt;p&gt;A tranche of documents released by the House oversight committee on Wednesday revealed that Jeffrey Epstein’s staff kept him apprised of Donald Trump’s&lt;strong&gt; &lt;/strong&gt;air travel as it related to his own transportation – and that the late sex trafficker kept up with news about his former friend years after their relationship soured.&lt;/p&gt;&lt;p&gt;This disclosure of about 20,000 pages from Republican members of the committee related to Epstein comes as Trump continues to battle with the political fallout related to their past friendship – and his justice department’s failure to release documents as he had long promised on the campaign trail.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/13/jeffrey-epstein-emails-trump\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Democrats sift through shutdown’s ashes after resistance finally breached",
      "url": "https://www.theguardian.com/us-news/2025/nov/12/us-government-shutdown-democrats-analysis",
      "summary": "&lt;p&gt;After 42-day standoff, government is back open – and minority party won no concessions from party in power&lt;/p&gt;&lt;p&gt;More than 42 days ago, beleaguered congressional Democrats employed a tactic they were not known for using – refusing to fund the government unless their demands, in this case, an extension of tax credits that lowered costs for Affordable Care Act health plans, were met.&lt;/p&gt;&lt;p&gt;Fast forward to Wednesday evening, and the federal government is back open, the Democrats’ resistance breached by the combined forces of Congress’s Republican majorities and a splinter group of Democratic senators who provided just enough votes to get a funding bill past the chamber’s filibuster.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/nov/12/us-government-shutdown-democrats-analysis\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}