{
  "updatedAt": "2025-09-23T13:37:08.526Z",
  "items": [
    {
      "title": "Democrats Open Inquiries Into Handling of Homan Investigation",
      "url": "https://www.nytimes.com/2025/09/23/us/politics/tom-homan-democrats-investigation.html",
      "summary": "President Trump’s border czar was investigated for potential bribery after accepting a bag with $50,000 in cash, but the case was closed after Mr. Trump took office."
    },
    {
      "title": "A Fact-Check on Trump’s Claims About Tylenol, Vaccines and Autism",
      "url": "https://www.nytimes.com/2025/09/23/us/trump-tylenol-autism-vaccines-fact-check.html",
      "summary": "How President Trump ignored science about vaccines in his news conference."
    },
    {
      "title": "Cache of Devices Capable of Crashing Cell Network Is Found Near U.N.",
      "url": "https://www.nytimes.com/2025/09/23/us/politics/secret-service-sim-cards-servers-un.html",
      "summary": "The Secret Service discovered more than 100,000 SIM cards and 300 servers, which could disable cellular towers or be used to conduct surveillance."
    },
    {
      "title": "Trump Will Address U.N. as He Jettisons Aid and Recasts U.S. Role",
      "url": "https://www.nytimes.com/2025/09/23/us/politics/trump-un-aid-israel-gaza.html",
      "summary": "President Trump plans to address the U.N. General Assembly with a rebuke of global institutions, at a moment when he is increasingly isolated in his approach to crises around the world."
    },
    {
      "title": "U.S. News Rankings Are Out After a Tumultuous Year for Colleges",
      "url": "https://www.nytimes.com/2025/09/23/us/us-news-rankings.html",
      "summary": "But despite it all, very little changed on the lists many parents and prospective students turn to as admissions season kicks off."
    },
    {
      "title": "Mamdani Lands Endorsement From Kamala Harris, His Biggest Yet",
      "url": "https://www.nytimes.com/2025/09/22/us/politics/kamala-harris-endorsement-zohran-mamdani.html",
      "summary": "“I support the Democrat in the race,” Ms. Harris said during an interview with Rachel Maddow. She added of the Democratic Party, “we’ve got a big tent and we’ve got a lot of stars.”"
    },
    {
      "title": "Donald Trump to address UN general assembly as US allies recognize Palestinian statehood – live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates",
      "summary": "&lt;p&gt;US president to address summit in New York and will participate in high-stakes bilateral meetings with leaders from Ukraine and Argentina&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2025/sep/23/secret-service-new-york-network\"&gt;Secret Service takes down network that could’ve crippled New York cell service&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;While the Secret Service hasn’t confirmed that the telecommunications threat was targeting the United Nations general assembly, the agency said that the devices were “concentrated within 35 miles of the global meeting” and the investigation is ongoing.&lt;/p&gt;&lt;p&gt;The Secret Service added that early forensic analysis of the deviced indicates “cellular communications between nation-state threat actors and individuals that are known to federal law enforcement”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Oklahoma tiger handler was fatally attacked in front of family during show",
      "url": "https://www.theguardian.com/us-news/2025/sep/23/oklahoma-tiger-attack",
      "summary": "&lt;p&gt;Officials say tiger unexpectedly bit and shook Ryan Easley in front of wife, child and onlookers at Growler Pines&lt;/p&gt;&lt;p&gt;The tiger handler who was &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/22/tiger-attack-oklahoma-preserve\"&gt;fatally mauled&lt;/a&gt; by one of his charges in &lt;a href=\"https://www.theguardian.com/us-news/oklahoma\"&gt;Oklahoma&lt;/a&gt; recently was killed as horrified onlookers – including his wife and daughter – watched during the end of a big cat show, local officials said Monday.&lt;/p&gt;&lt;p&gt;Ryan Easley, 37, was dead when deputies arrived on Saturday at the Growler Pines Tiger Preserve near Hugo, not far from the Texas border, just minutes after dispatchers received an emergency call, said the Choctaw county sheriff, Terry Park.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/23/oklahoma-tiger-attack\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}