{
  "updatedAt": "2025-09-15T13:33:16.777Z",
  "items": [
    {
      "title": "Many Conservatives View Charlie Kirk’s Death as a Galvanizing Force",
      "url": "https://www.nytimes.com/2025/09/15/us/charlie-kirk-conservatives-christians-movement-future.html",
      "summary": "Calling Charlie Kirk a martyr, conservatives see an opportunity to supercharge the movement the right-wing leader began and to cement conservative Christian values in American life."
    },
    {
      "title": "Supreme Court Is Split on What to Call the ‘Shadow Docket’",
      "url": "https://www.nytimes.com/2025/09/15/us/politics/supreme-court-shadow-docket.html",
      "summary": "Critics call the expedited rulings, which have become routine in the second Trump administration, the “shadow docket.” The justices have other ideas."
    },
    {
      "title": "Trump Redirects Millions to Historically Black Colleges, Charter Schools",
      "url": "https://www.nytimes.com/2025/09/15/us/hbcus-trump-administration-funding.html",
      "summary": "The Trump administration is cutting money from programs that have supported minority students, including at other universities."
    },
    {
      "title": "In a Chicago Neighborhood, Fear and Anger Over Trump’s ICE ‘Blitz’",
      "url": "https://www.nytimes.com/2025/09/15/us/chicago-trump-ice-mexican-immigrants.html",
      "summary": "Pilsen, a part of the city long home to Chicagoans of Mexican heritage, has grown quieter since the Trump administration announced an operation against illegal immigration."
    },
    {
      "title": "Rubio, in Israel, Says a Diplomatic Solution to Gaza War May Not be Possible",
      "url": "https://www.nytimes.com/2025/09/15/us/politics/rubio-israel-netanyahu-trump-gaza.html",
      "summary": "Secretary of State Marco Rubio met with Prime Minister Benjamin Netanyahu of Israel to discuss President Trump’s desire to see the war in Gaza end soon."
    },
    {
      "title": "Trump Administration Claims Vast Powers as It Races to Fire Fed Governor Before Meeting",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/trump-lisa-cook-fed.html",
      "summary": "Trump has forged ahead with his attempts to fire Lisa Cook even as new documents call his claims of mortgage fraud into question."
    },
    {
      "title": "Trump threatens to call national emergency in Washington DC over Ice cooperation – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
      "summary": "&lt;p&gt;President vows to ‘federalize’ capital city after mayor says police will not work with Ice in immigration crackdown&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Secretary of state Marco Rubio will travel to Qatar on Tuesday&lt;/strong&gt;, the Washington Post is reporting, after holding talks with Benjamin Netanyahu today in Israel.&lt;/p&gt;&lt;p&gt;As my colleague &lt;strong&gt;Julian Borger&lt;/strong&gt; &lt;a href=\"https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas\"&gt;writes&lt;/a&gt;: “Part of [Rubio’s] mission on this two-day visit is &lt;strong&gt;to&lt;/strong&gt; &lt;strong&gt;convey&lt;/strong&gt; &lt;strong&gt;Donald Trump&lt;/strong&gt;’s &lt;strong&gt;irritation at the Israeli missile strike on Doha&lt;/strong&gt; that was aimed at &lt;a href=\"https://www.theguardian.com/world/hamas\"&gt;Hamas&lt;/a&gt; leadership but killed their aides and a Qatari security officer.&lt;/p&gt;&lt;p&gt;&lt;em&gt;Common sense dictates that drone technology should be harnessed to scan every elevated structure with a line of sight to a target.&lt;/em&gt;&lt;/p&gt;&lt;p&gt;&lt;em&gt;If drones can enable the early detection and prevention of assassination attempts, why not use them? Better to have vigilant eyes in the sky than to remain blind to would-be assassins.&lt;/em&gt;&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Chicago organizers say city needs support, not politicalization by Trump: ‘This is not a serious solution’",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/chicago-trump-crime-military",
      "summary": "&lt;p&gt;Violence prevention workers say they worry the city is being exploited to normalize military force on US streets&lt;/p&gt;&lt;p&gt;For months, &lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; and his administration have been using violent &lt;a href=\"https://www.theguardian.com/us-news/us-crime\"&gt;crime&lt;/a&gt; as a justification for ramping up Immigration and Customs Enforcement (Ice) operations and sending or threatening to send the national guard to blue cities – first in &lt;a href=\"https://www.theguardian.com/us-news/los-angeles\"&gt;Los Angeles&lt;/a&gt;, then &lt;a href=\"https://www.theguardian.com/us-news/washington-dc\"&gt;Washington DC&lt;/a&gt; and, last week, &lt;a href=\"https://www.theguardian.com/us-news/chicago\"&gt;Chicago&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;But for those who work on the ground to prevent crime, the White House’s approaches will do little to address underlying causes. Instead, they say, increased law enforcement will only lead to harassment and increased surveillance in communities that are already overpoliced.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/15/chicago-trump-crime-military\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}