{
  "updatedAt": "2025-09-06T06:43:58.530Z",
  "items": [
    {
      "title": "Trump Says U.S. Military Has ‘Never Fought to Win’ Since World War II",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/trump-military-wars.html",
      "summary": "As he signed an order recognizing the Defense Department as the “Department of War,” President Trump said that the country “could have won every war, but we really chose to be very politically correct.”"
    },
    {
      "title": "Will Trump Have to Run From the Economy?",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/trump-economy-jobs-midterms.html",
      "summary": "It’s the issue voters cared most about in 2024, and there are signs of trouble."
    },
    {
      "title": "Off-Duty Pilot Who Tried to Shut Off Engines Expresses Regret in Court",
      "url": "https://www.nytimes.com/2025/09/05/us/alaska-airlines-pilot-plea-agreement-mushrooms.html",
      "summary": "The former Alaska Airlines pilot had consumed psychedelic mushrooms two days before the flight. Judges approved plea agreements in his case on Friday."
    },
    {
      "title": "Trump Didn’t Notify Congress About a High-Stakes SEALs Mission. That Could Be an Issue.",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/trump-congress-national-security-navy-seals.html",
      "summary": "The Trump administration failed to tell lawmakers about a 2019 SEAL Team 6 incursion into North Korean territory that went awry."
    },
    {
      "title": "How Trump’s Blunt-Force Diplomacy Is Pushing His Rivals Together",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/trump-diplomacy-rivals.html",
      "summary": "Some of President Trump’s pressure tactics appear to have backfired, sending would-be allies into the embrace of China."
    },
    {
      "title": "New Summer Camp Safety Laws Follow Texas’ Tragic Floods",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/texas-summer-camp-safety-rules.html",
      "summary": "The families of “Heaven’s 27,” the children and counselors lost at Camp Mystic, pressed the Legislature to toughen flood rules over the objections of some Hill Country camp operators."
    },
    {
      "title": "Trump, misled by video of 2020 protests shown on Fox, threatens to send troops to Portland – as it happened",
      "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
      "summary": "&lt;p&gt;This blog is now closed. Read our latest story &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/05/trump-portland-video-protests\"&gt;here&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Tensions between Michelle Wu, the mayor of Boston, and the &lt;a href=\"https://www.theguardian.com/us-news/trump-administration\"&gt;Trump administration&lt;/a&gt; have been escalating in recent months over the administration’s aggressive immigration policies, with reports now signaling the possibility of a federal immigration enforcement surge in the city.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The friction came to a head last week when the Trump administration reportedly began preparing an “immigration enforcement blitz” for Boston in the coming weeks, according to &lt;a href=\"https://www.politico.com/news/2025/08/29/trump-admin-plans-immigration-enforcement-surge-in-boston-00536276\"&gt;Politico&lt;/a&gt;.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates\"&gt;Continue reading...&lt;/a&gt;"
    },
    {
      "title": "Trump, apparently misled by video of 2020 protests, threatens to send troops to Portland",
      "url": "https://www.theguardian.com/us-news/2025/sep/05/trump-portland-video-protests",
      "summary": "&lt;p&gt;US president mistakes scale of anti-Ice rallies after TV report uses old footage from George Floyd demonstrations&lt;/p&gt;&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/donaldtrump\"&gt;Donald Trump&lt;/a&gt; told reporters that he might send national guard troops into Portland, Oregon, apparently because he was misled about the scale of small protests there by a TV report that incorrectly presented video recorded in 2020 as having taken place this summer.&lt;/p&gt;&lt;p&gt;“I will say this, I watched today, I didn’t know that was continuing to go on, but Portland is unbelievable, what’s going on,” &lt;a href=\"https://youtu.be/_dTSbtfXwDg?si=EO06p1VSobt8fDJu&amp;amp;t=1\"&gt;Trump said&lt;/a&gt;. He then claimed, incorrectly, that he had seen video evidence of “the destruction of the city”.&lt;/p&gt; &lt;a href=\"https://www.theguardian.com/us-news/2025/sep/05/trump-portland-video-protests\"&gt;Continue reading...&lt;/a&gt;"
    }
  ]
}