{
  "updatedAt": "2025-09-10T20:42:48.225Z",
  "latest": {
    "date": "2025-09-10",
    "title": "Trump and Leaders Across Political Spectrum React to Charlie Kirk Shooting",
    "summary": "Some politicians called for prayers, while some others immediately cast blame.",
    "url": "https://www.nytimes.com/2025/09/10/us/charlie-kirk-reaction-trump.html"
  },
  "archive": [
    {
      "date": "2025-09-09",
      "title": "Michigan Judge Tosses Out Cases Against Fake Trump Electors",
      "summary": "The judge, a Democrat, concluded that fake electors recruited to support Donald J. Trump’s candidacy in 2020 did not understand that they were being asked to do something illegal.",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/michigan-electors-ruling.html"
    },
    {
      "date": "2025-09-08",
      "title": "Trump Says Having ‘a Little Fight With the Wife’ Should Not Count as a Crime",
      "summary": "President Trump said that offenses that happen at home should not undermine his record of crime reduction in Washington.",
      "url": "https://www.nytimes.com/2025/09/08/us/politics/trump-domestic-violence-crime-statistics.html"
    },
    {
      "date": "2025-09-07",
      "title": "Trump Is Met With Mostly Boos at U.S. Open as Security Delays a Match",
      "summary": "With the president in attendance at Arthur Ashe Stadium, the men’s final began as hundreds of people were still waiting to go through security screening.",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/trump-us-open-tennis-boos-delays.html"
    },
    {
      "date": "2025-09-06",
      "title": "Grand Juries in D.C. Reject Wave of Charges Under Trump’s Crackdown",
      "summary": "The persistent rejections suggest that the grand jurors may have had enough of prosecutors seeking harsh charges in a highly politicized environment.",
      "url": "https://www.nytimes.com/2025/09/06/us/trump-dc-national-guard-grand-juries-crime.html"
    },
    {
      "date": "2025-09-05",
      "title": "Second Weak Jobs Report Undercuts Trump’s Claims of a Booming Economy",
      "summary": "After a bad employment report in August, President Trump fired the official in charge of the numbers. This month’s data was just as disappointing.",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/trump-jobs-report-tariffs-deportations.html"
    },
    {
      "date": "2025-09-04",
      "title": "Harvard Won Its Money Back, but Will It Actually Get It?",
      "summary": "A judge ruled that the Trump administration broke the law in canceling billions in federal funds for Harvard. Whether the money is returned matters for the rest of higher education.",
      "url": "https://www.nytimes.com/2025/09/04/us/harvard-federal-funds-court-victory-trump-administration.html"
    },
    {
      "date": "2025-09-04",
      "title": "Sample headline about Trump (demo)",
      "summary": "This is a placeholder. The GitHub Action will replace it with an actual top story once it runs.",
      "url": "https://example.com/source"
    }
  ]
}