{
  "updatedAt": "2025-11-28T20:38:20.203Z",
  "latest": {
    "date": "2025-11-28",
    "title": "Trump Spoke by Phone Last Week With Maduro, Venezuela’s Leader",
    "summary": "They discussed a possible meeting between the two of them, but nothing has been scheduled, and the administration continues to increase the military pressure on Venezuela.",
    "url": "https://www.nytimes.com/2025/11/28/us/politics/trump-spoke-by-phone-last-week-with-maduro-venezuelas-leader.html"
  },
  "archive": [
    {
      "date": "2025-11-27",
      "title": "Trump shuts the door to Afghans who face crises at home.",
      "summary": "",
      "url": "https://www.nytimes.com/live/2025/11/27/us/national-guard-shooting-dc/trump-shuts-the-door-to-afghans-who-face-crises-at-home"
    },
    {
      "date": "2025-11-26",
      "title": "Colorado Judge Tells Immigration Agents to Stop Arrests Without Warrants",
      "summary": "The ruling that immigration agents are acting illegally is the latest to rebuke the Trump administration’s tactics, but earlier orders have been blocked on appeal.",
      "url": "https://www.nytimes.com/2025/11/26/us/politics/colorado-immigration-ruling.html"
    },
    {
      "date": "2025-11-25",
      "title": "D.C. Mayor Muriel Bowser Says She Won’t Run for a Fourth Term",
      "summary": "She has led the heavily Democratic city through confrontations with President Trump, who earlier this year sought to impose federal control over the local Police Department.",
      "url": "https://www.nytimes.com/2025/11/25/us/dc-mayor-muriel-bowser-reelection.html"
    },
    {
      "date": "2025-11-24",
      "title": "Venezuelan Diaspora Divided on Trump’s Military Strategy",
      "summary": "Differences of opinion, complicated by unease over President Trump’s immigration policies, are creating tense divisions among Venezuelans in South Florida.",
      "url": "https://www.nytimes.com/2025/11/24/us/venezuelan-diaspora-critics-us-military-intervention.html"
    },
    {
      "date": "2025-11-23",
      "title": "Trump Calls Ukraine Ungrateful, Again, for U.S. Support in War With Russia",
      "summary": "President Trump renewed his criticism of Ukraine’s government as emissaries from Kyiv and Washington met to discuss a plan to end the war.",
      "url": "https://www.nytimes.com/2025/11/23/us/politics/trump-ukraine-criticism-russia.html"
    },
    {
      "date": "2025-11-22",
      "title": "Marjorie Taylor Greene’s Resignation Hints at Divisions in Trump’s Movement",
      "summary": "As the president forced a onetime loyalist from Congress, her defiant departure signaled a coming debate over Republican identity in a post-Trump era.",
      "url": "https://www.nytimes.com/2025/11/22/us/politics/marjorie-taylor-greene-trump-republicans.html"
    },
    {
      "date": "2025-11-21",
      "title": "Trump and Saudi Crown Prince Had ‘Disturbing’ Call After Khashoggi’s Murder, Lawmaker Says",
      "summary": "Representative Eugene Vindman of Virginia said he reviewed a classified transcript of the 2019 conversation that would “shock” Americans.",
      "url": "https://www.nytimes.com/2025/11/21/us/politics/trump-saudi-crown-prince-khashoggi.html"
    },
    {
      "date": "2025-11-20",
      "title": "Trump Accuses Democrats of ‘Sedition’ Over Message to the Military",
      "summary": "President Trump was reacting to a video that reminded members of the military that they are not supposed to obey illegal orders.",
      "url": "https://www.nytimes.com/2025/11/20/us/politics/trump-accuses-democratic-lawmakers-of-sedition-over-message-to-the-military.html"
    },
    {
      "date": "2025-11-19",
      "title": "George Conway, a Vocal Foe of Trump, Eyes Congressional Run",
      "summary": "The former conservative lawyer built a social media following with his harsh criticism of President Trump, who was the boss of his wife at the time.",
      "url": "https://www.nytimes.com/2025/11/19/us/politics/george-conway-congressional-run.html"
    },
    {
      "date": "2025-11-17",
      "title": "High Beef Prices? Trump Official Blames Biden and Migrants.",
      "summary": "Treasury Secretary Scott Bessent said migrants were bringing sick cows across the border, snarling beef supply chains.",
      "url": "https://www.nytimes.com/2025/11/17/us/politics/hamburger-beef-prices-trump.html"
    },
    {
      "date": "2025-11-16",
      "title": "Marjorie Taylor Greene Backs Trump but Stands Firm on Epstein Files",
      "summary": "The Georgia Republican, long a loyal Trump ally, had come under attack by the president after showing independence, notably on the government’s investigation of Jeffrey Epstein.",
      "url": "https://www.nytimes.com/2025/11/16/us/politics/marjorie-taylor-greene-trump-epstein-files.html"
    },
    {
      "date": "2025-11-15",
      "title": "Trump Pardons Two for Crimes Related to Jan. 6",
      "summary": "Daniel Edwin Wilson and Suzanne Kaye had been convicted of crimes indirectly connected to the 2021 attack on the Capitol.",
      "url": "https://www.nytimes.com/2025/11/15/us/politics/trump-pardons-jan-6.html"
    },
    {
      "date": "2025-11-14",
      "title": "Trump Plan Could Limit Green Cards for Immigrants From Travel Ban Countries",
      "summary": "The policy change is a major expansion of the administration’s push to crack down on immigration from countries that it says lack sufficient screening and vetting abilities.",
      "url": "https://www.nytimes.com/2025/11/14/us/politics/trump-travel-ban-visas-green-card.html"
    },
    {
      "date": "2025-11-13",
      "title": "Epstein’s Emails About Trump",
      "summary": "Our investigative reporter Steve Eder provides context about Jeffrey Epstein’s relationship with President Donald Trump based on information from over 20,000 pages of documents from Epstein’s estate released by the House Oversight Committee on Wednesday.",
      "url": "https://www.nytimes.com/video/us/politics/100000010520312/epstein-trump-emails-explained.html"
    },
    {
      "date": "2025-11-12",
      "title": "What Epstein’s Emails Allege About Trump’s Knowledge of His Conduct",
      "summary": "Democrats on the House Oversight Committee released emails suggesting that President Trump knew more about Jeffrey Epstein’s activities than he has acknowledged.",
      "url": "https://www.nytimes.com/2025/11/12/us/politics/epstein-emails-trump.html"
    },
    {
      "date": "2025-11-11",
      "title": "As Shutdown Nears End, Trump Still Confronts Soaring Health Costs",
      "summary": "The central issue of the government closure remains unresolved, leaving Republicans under political pressure ahead of the midterms.",
      "url": "https://www.nytimes.com/2025/11/11/us/politics/trump-shutdown-health-care-costs-aca.html"
    },
    {
      "date": "2025-11-10",
      "title": "Appeals Court Blocks Trump’s Attempt to Withhold Full SNAP Funding",
      "summary": "But the administration indicated it might not be necessary, as Congress inched toward a deal to fund the government.",
      "url": "https://www.nytimes.com/2025/11/10/us/politics/appeals-court-trump-snap-funding-shutdown.html"
    },
    {
      "date": "2025-11-09",
      "title": "White House Discussed Naming New Washington Commanders Stadium After Trump",
      "summary": "President Trump made the “rebuilding of the new stadium possible,” according to Karoline Leavitt, the White House press secretary. But it was unclear what role he has had in the project.",
      "url": "https://www.nytimes.com/2025/11/09/us/politics/trump-washington-commanders.html"
    },
    {
      "date": "2025-11-08",
      "title": "Biden Warns of a ‘Very, Very Dark Moment’ as He Hits Out at Trump",
      "summary": "The former president, now a far less popular figure in his party, appeared in Nebraska for an overtly political speech that slammed his successor.",
      "url": "https://www.nytimes.com/2025/11/07/us/politics/biden-trump-omaha-nebraska.html"
    },
    {
      "date": "2025-11-07",
      "title": "Did Trump’s Supreme Court Tariffs Brief Include a Strategic Blunder?",
      "summary": "The justices are generally reluctant to take account of a president’s public statements. But extensive quotes from Mr. Trump in a key filing may change the legal calculus.",
      "url": "https://www.nytimes.com/2025/11/07/us/trump-statements-supreme-court-tariffs.html"
    },
    {
      "date": "2025-11-06",
      "title": "Trump Team Now Claims Its Trillions in Tariff Revenue Are ‘Incidental’",
      "summary": "In arguments before the Supreme Court, the White House backed away from its claims that President Trump’s tariffs were about raising revenue.",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/trump-tariffs-revenue-supreme-court.html"
    },
    {
      "date": "2025-11-05",
      "title": "Trump Administration Ends Deportation Protections for South Sudanese",
      "summary": "The program was first authorized for South Sudanese nationals in 2011. The Department of Homeland Security said that “renewed peace in South Sudan” and “improved diplomatic relations” justified the move.",
      "url": "https://www.nytimes.com/2025/11/05/us/politics/trump-south-sudan-migrants.html"
    },
    {
      "date": "2025-11-04",
      "title": "Trump Aides Raise Recession Fears, and Point Fingers at the Fed",
      "summary": "Treasury Secretary Scott Bessent said some sectors were in a recession as he argued for more interest rate cuts.",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/trump-aides-recession-fears-federal-reserve.html"
    },
    {
      "date": "2025-11-03",
      "title": "WIC Food Aid Program for Families Gets Funding Stopgap",
      "summary": "An injection of $450 million for WIC comes as the Trump administration announced it would only fund partial benefits for another food aid program, the Supplemental Nutrition Assistance Program, or SNAP, for November.",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/wic-snap-food-aid.html"
    },
    {
      "date": "2025-11-02",
      "title": "‘Keep Listening’: An Undecided Republican Lawmaker Weighs New Voting Maps",
      "summary": "As redistricting efforts spread across the country, an Indiana state senator said he isn’t sure how he will vote on a plan that President Trump supports.",
      "url": "https://www.nytimes.com/2025/11/02/us/indiana-redistricting-terre-haute.html"
    },
    {
      "date": "2025-11-01",
      "title": "Trump’s Team Offers to Keep Some Ballroom Donors Incognito",
      "summary": "Many corporate interests that have donated to the president’s pet project have business before his administration.",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/trumps-team-offers-to-keep-some-ballroom-donors-incognito.html"
    },
    {
      "date": "2025-10-31",
      "title": "Democrats Ride Anti-Trump Message in Final Days of California Campaign",
      "summary": "Proponents say voters are motivated by stopping President Trump. Republicans have already begun pointing fingers over lackluster fund-raising and coordination.",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/california-redistricting-proposition-50-trump.html"
    },
    {
      "date": "2025-10-30",
      "title": "Democrats Condemn Trump Officials for Boat Strike Secrecy",
      "summary": "Senator Mark Warner said the administration’s decision to hold a Republicans-only briefing on the campaign was “corrosive to our democracy.”",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/trump-democrats-boat-strikes.html"
    },
    {
      "date": "2025-10-29",
      "title": "Sanctions Lifted on a Putin-Backed Autocrat After Lobbying by Trump Allies",
      "summary": "The move benefits the Serbian politician Milorad Dodik, who had received support from Rudolph W. Giuliani, Michael T. Flynn, Laura Loomer and high-priced lobbyists.",
      "url": "https://www.nytimes.com/2025/10/29/us/politics/milorad-dodik-sanctions-trump.html"
    },
    {
      "date": "2025-10-28",
      "title": "Mike Johnson Dismisses Trump Third Term Talk — But Applauds the ‘Trolling’",
      "summary": "The speaker said he did not see a path to amending the Constitution to allow the president to seek a third term, but that it was fun to pretend he could to inflame Democrats.",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/johnson-trump-2028-constitution.html"
    }
  ]
}