{
  "updatedAt": "2025-10-17T20:37:04.050Z",
  "latest": {
    "date": "2025-10-17",
    "title": "Benioff Apologizes for Saying Trump Should Send Troops to San Francisco",
    "summary": "Marc Benioff, the chief executive of Salesforce, said he no longer believed that National Guard troops were needed in the city.",
    "url": "https://www.nytimes.com/2025/10/17/us/benioff-apologizes-san-francisco.html"
  },
  "archive": [
    {
      "date": "2025-10-16",
      "title": "Terrorism Charges Against Antifa ‘Cell’ Show Administration’s Focus on the Left",
      "summary": "President Trump has spoken at times of antifa as though it were a clear-cut extremist organization, but the movement is a decentralized collection of loosely affiliated groups.",
      "url": "https://www.nytimes.com/2025/10/16/us/politics/justice-department-terrorism-antifa.html"
    },
    {
      "date": "2025-10-15",
      "title": "Trump Signs Memo Expanding His Authority to Spend Federal Money",
      "summary": "The president gave Defense Secretary Pete Hegseth wide authority to repurpose funds to pay members of the military without approval from Congress, which has the sole constitutional authority to decide federal spending.",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/trump-federal-funds-government-shutdown.html"
    },
    {
      "date": "2025-10-14",
      "title": "U.S. Military Kills 6 People in Boat Attack Near Venezuela, Trump Says",
      "summary": "In a social media post, the president said the people aboard a boat were suspected of smuggling drugs for an unspecified group his team had labeled terrorists.",
      "url": "https://www.nytimes.com/2025/10/14/us/politics/trump-drugs-boat-attack.html"
    },
    {
      "date": "2025-10-13",
      "title": "Part Enabler, Part Buffer: The Bind of the Justice Dept.’s No. 2",
      "summary": "Todd Blanche, the deputy attorney general, has helped usher in President Trump’s retribution campaign. But he faces anger on the right for resisting some of the most extreme measures.",
      "url": "https://www.nytimes.com/2025/10/13/us/politics/todd-blanche-justice-department-trump.html"
    },
    {
      "date": "2025-10-12",
      "title": "Why Now? The Lost Chances to Reach a Hostage Deal, and a Cease-Fire, Months Ago",
      "summary": "On Gaza, President Trump put few, if any, guardrails on Israel’s offensive, bucking international demands for a cease-fire. Then he changed course.",
      "url": "https://www.nytimes.com/2025/10/12/us/politics/lost-chances-hostage-deal-gaza-israel.html"
    },
    {
      "date": "2025-10-11",
      "title": "Among Portland Protests, It’s Frogs and Sharks and Bears, Oh My.",
      "summary": "Images of anarchists clad in black gave the city a bad name in 2020. Now, demonstrators in Portland are poking fun at President Trump’s apocalyptic talk with colorful animal suits.",
      "url": "https://www.nytimes.com/2025/10/11/us/politics/portland-protests.html"
    },
    {
      "date": "2025-10-10",
      "title": "Judge Orders ICE to Remove Fence Around Facility Near Chicago",
      "summary": "The judge’s decision is the third in three days in Illinois against the Trump administration. It came after ICE said its Operation Midway Blitz would continue indefinitely.",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/ice-national-guard.html"
    },
    {
      "date": "2025-10-09",
      "title": "Appellate Judges Appear Open to Allowing National Guard Troops to Deploy to Portland",
      "summary": "Three judges from the U.S. Court of Appeals for the Ninth Circuit are reviewing an order blocking President Trump from deploying National Guard soldiers in the city.",
      "url": "https://www.nytimes.com/2025/10/09/us/national-guard-portland-appeals-court-hearing.html"
    },
    {
      "date": "2025-10-08",
      "title": "A Chicago federal grand jury deals the latest setback to Trump’s immigration enforcement efforts.",
      "summary": "",
      "url": "https://www.nytimes.com/live/2025/10/08/us/trump-national-guard-chicago-illinois/a-chicago-federal-grand-jury-deals-the-latest-setback-to-trumps-immigration-enforcement-efforts"
    },
    {
      "date": "2025-10-07",
      "title": "Mass Layoffs Trump Is Threatening in Shutdown Fight May Be Illegal",
      "summary": "Unions have sued to block any firings, which budget experts believe are not even needed to protect essential federal services.",
      "url": "https://www.nytimes.com/2025/10/07/us/politics/trump-government-shutdown-layoffs.html"
    },
    {
      "date": "2025-10-06",
      "title": "Trump Gave Partisan Speech to Navy Troops, as He Deployed Troops to U.S. Cities",
      "summary": "President Trump’s attempts to politicize the military have become more overt as he makes the case for having troops at his disposal in American cities.",
      "url": "https://www.nytimes.com/2025/10/06/us/politics/trump-navy-portland-troops.html"
    },
    {
      "date": "2025-10-05",
      "title": "Trump Renews Layoff Threats as Shutdown Accusations Continue to Fly",
      "summary": "Senator Chuck Schumer and Speaker Mike Johnson each accused the other of not being “serious” about talks to end the shutdown as the government was closed for a fifth day.",
      "url": "https://www.nytimes.com/2025/10/05/us/politics/trump-democrats-shutdown.html"
    },
    {
      "date": "2025-10-04",
      "title": "Who Still Has Temporary Protected Status Under Trump?",
      "summary": "Conflicting court rulings have plunged hundreds of thousands of people with temporary protection from deportation into uncertainty.",
      "url": "https://www.nytimes.com/2025/10/04/us/politics/temporary-protected-status-scotus.html"
    },
    {
      "date": "2025-10-03",
      "title": "Marc Rowan, a Billionaire Financier, Is Behind Trump’s Deal for Universities",
      "summary": "The conservative ideas behind the Trump administration’s “compact” for universities were developed in part by Marc Rowan, a wealthy financier who has sought to shape higher education.",
      "url": "https://www.nytimes.com/2025/10/03/us/billionaire-marc-rowan-trump-deal-universities.html"
    },
    {
      "date": "2025-10-02",
      "title": "Trump ‘Determined’ the U.S. Is Now in a War With Drug Cartels, Congress Is Told",
      "summary": "A notice calls the people the U.S. military recently killed on suspicion of drug smuggling in the Caribbean Sea “unlawful combatants.”",
      "url": "https://www.nytimes.com/2025/10/02/us/politics/trump-drug-cartels-war.html"
    },
    {
      "date": "2025-10-01",
      "title": "Environmental Protection Agency Employees Working Despite Furloughs Plan",
      "summary": "E.P.A. employees said that they were working without pay, and that Trump administration officials had not told them how long the funding would last. Union officials said they were “highly confused.”",
      "url": "https://www.nytimes.com/2025/10/01/us/politics/government-shutdown-epa-working.html"
    },
    {
      "date": "2025-09-30",
      "title": "Trump Administration Defunds Federal Watchdog Office",
      "summary": "Two senators called for “immediate action” to release money the White House blocked for the federal office that oversees dozens of inspectors general.",
      "url": "https://www.nytimes.com/2025/09/30/us/politics/trump-federal-watchdog-funding.html"
    },
    {
      "date": "2025-09-29",
      "title": "The Man Expanding Trump’s Presidential Powers",
      "summary": "Coral Davenport, a New York Times reporter, explains how Russell Vought, the director of the Office of Management and Budget, plans to circumvent Congress’s budgetary powers to advance the Trump administration’s agenda.",
      "url": "https://www.nytimes.com/video/us/politics/100000010422264/the-man-expanding-trumps-presidential-powers.html"
    },
    {
      "date": "2025-09-28",
      "title": "With Comey Indictment, Trump Sets Retribution Precedent That Could Haunt His Allies",
      "summary": "President Trump’s retribution campaign risks ushering in a cycle of retaliation in which each new administration takes aim at the last one.",
      "url": "https://www.nytimes.com/2025/09/28/us/politics/trump-comey-retribution-precedent.html"
    },
    {
      "date": "2025-09-27",
      "title": "Trump Says He Has Ordered Troops to Portland, Oregon, to Protect ICE Facilities",
      "summary": "The president characterized Immigration and Customs Enforcement facilities as being under siege from domestic terrorists.",
      "url": "https://www.nytimes.com/2025/09/27/us/politics/trump-portland-troops.html"
    },
    {
      "date": "2025-09-26",
      "title": "Trump Expands Tariffs Beyond Supreme Court’s Reach",
      "summary": "The president’s tariffs on foreign drugs and furniture rely on national security laws outside the scope of current lawsuits.",
      "url": "https://www.nytimes.com/2025/09/26/us/politics/trump-tariffs-supreme-court.html"
    },
    {
      "date": "2025-09-25",
      "title": "Justice Department Sues Six States Seeking Private Voter Data",
      "summary": "The Trump administration has been increasingly focused on an effort to bolster President Trump’s unsubstantiated claims of voter fraud. More than 30 states have received requests for information.",
      "url": "https://www.nytimes.com/2025/09/25/us/politics/doj-lawsuit-voter-data-trump.html"
    },
    {
      "date": "2025-09-24",
      "title": "The D.C. Region Has Faced an Outsized Toll From Trump’s Policies",
      "summary": "With the mass layoffs and cancellations of thousands of federal grants and contracts, the region has taken a disproportionate hit.",
      "url": "https://www.nytimes.com/2025/09/24/us/politics/trump-cuts-washington-dc.html"
    },
    {
      "date": "2025-09-23",
      "title": "Stuck in Traffic, Emmanuel Macron Calls Trump About His Motorcade",
      "summary": "The French head of state experienced a frustration that many New Yorkers know all too well. He got stuck during the U.N. General Assembly.",
      "url": "https://www.nytimes.com/2025/09/23/us/macron-trump-unga-motorcade.html"
    },
    {
      "date": "2025-09-22",
      "title": "White House Denies Homan Took Bag of Cash in F.B.I. Inquiry",
      "summary": "People familiar with an undercover F.B.I. investigation say Trump’s border czar was recorded on audio tape accepting a Cava bag with $50,000 in it last year.",
      "url": "https://www.nytimes.com/2025/09/22/us/politics/homan-cash.html"
    },
    {
      "date": "2025-09-21",
      "title": "In Assault on Free Speech, Trump Targets Speech He Hates",
      "summary": "The president’s complaints about negative coverage undermine the rationales offered by his own officials.",
      "url": "https://www.nytimes.com/2025/09/21/us/politics/trump-free-speech.html"
    },
    {
      "date": "2025-09-20",
      "title": "Top Democratic Leaders Ask Trump for Meeting to Avert a Shutdown",
      "summary": "After a Republican plan to keep funding flowing foundered in the Senate, Representative Hakeem Jeffries and Senator Chuck Schumer accused the president of standing in the way of a solution.",
      "url": "https://www.nytimes.com/2025/09/20/us/politics/jeffries-schumer-trump.html"
    },
    {
      "date": "2025-09-19",
      "title": "Harvard’s Former President, Claudine Gay, Criticizes Its Approach to Trump",
      "summary": "Claudine Gay has rarely spoken out since she was forced to resign, but she recently said that Harvard should not cave to Trump administration demands, including a $500 million payment.",
      "url": "https://www.nytimes.com/2025/09/19/us/harvard-claudine-gay-trump.html"
    },
    {
      "date": "2025-09-18",
      "title": "In Their Own Words: Trump and Top Officials Change Tone on Free Speech",
      "summary": "In the wake of Charlie Kirk’s assassination, the president’s pledges to guarantee free speech have been replaced by efforts to suppress — and even criminalize — what their critics have to say.",
      "url": "https://www.nytimes.com/2025/09/18/us/politics/trump-free-speech.html"
    },
    {
      "date": "2025-09-17",
      "title": "‘Pay Attention!’: Spirit Airlines Pilot Scolded for Flying Near Air Force One",
      "summary": "An air traffic controller sternly told the pilot to “pay attention,” “get off the iPad” and turn the plane to steer clear of a flight carrying President Trump.",
      "url": "https://www.nytimes.com/2025/09/17/us/airforce-one-spirit-air-traffic-control.html"
    }
  ]
}