{
  "updatedAt": "2025-09-23T20:43:11.322Z",
  "latest": {
    "date": "2025-09-23",
    "title": "Stuck in Traffic, Emmanuel Macron Calls Trump About His Motorcade",
    "summary": "The French head of state experienced a frustration that many New Yorkers know all too well. He got stuck during the U.N. General Assembly.",
    "url": "https://www.nytimes.com/2025/09/23/us/macron-trump-unga-motorcade.html"
  },
  "archive": [
    {
      "date": "2025-09-22",
      "title": "White House Denies Homan Took Bag of Cash in F.B.I. Inquiry",
      "summary": "People familiar with an undercover F.B.I. investigation say Trump’s border czar was recorded on audio tape accepting a Cava bag with $50,000 in it last year.",
      "url": "https://www.nytimes.com/2025/09/22/us/politics/homan-cash.html"
    },
    {
      "date": "2025-09-21",
      "title": "In Assault on Free Speech, Trump Targets Speech He Hates",
      "summary": "The president’s complaints about negative coverage undermine the rationales offered by his own officials.",
      "url": "https://www.nytimes.com/2025/09/21/us/politics/trump-free-speech.html"
    },
    {
      "date": "2025-09-20",
      "title": "Top Democratic Leaders Ask Trump for Meeting to Avert a Shutdown",
      "summary": "After a Republican plan to keep funding flowing foundered in the Senate, Representative Hakeem Jeffries and Senator Chuck Schumer accused the president of standing in the way of a solution.",
      "url": "https://www.nytimes.com/2025/09/20/us/politics/jeffries-schumer-trump.html"
    },
    {
      "date": "2025-09-19",
      "title": "Harvard’s Former President, Claudine Gay, Criticizes Its Approach to Trump",
      "summary": "Claudine Gay has rarely spoken out since she was forced to resign, but she recently said that Harvard should not cave to Trump administration demands, including a $500 million payment.",
      "url": "https://www.nytimes.com/2025/09/19/us/harvard-claudine-gay-trump.html"
    },
    {
      "date": "2025-09-18",
      "title": "In Their Own Words: Trump and Top Officials Change Tone on Free Speech",
      "summary": "In the wake of Charlie Kirk’s assassination, the president’s pledges to guarantee free speech have been replaced by efforts to suppress — and even criminalize — what their critics have to say.",
      "url": "https://www.nytimes.com/2025/09/18/us/politics/trump-free-speech.html"
    },
    {
      "date": "2025-09-17",
      "title": "‘Pay Attention!’: Spirit Airlines Pilot Scolded for Flying Near Air Force One",
      "summary": "An air traffic controller sternly told the pilot to “pay attention,” “get off the iPad” and turn the plane to steer clear of a flight carrying President Trump.",
      "url": "https://www.nytimes.com/2025/09/17/us/airforce-one-spirit-air-traffic-control.html"
    },
    {
      "date": "2025-09-16",
      "title": "G.O.P. Again Cedes Power on Tariffs to Avoid Crossing Trump",
      "summary": "House Republicans extended a maneuver they engineered earlier in the year that effectively strips Congress of the power to disapprove of President Trump’s tariffs.",
      "url": "https://www.nytimes.com/2025/09/16/us/politics/republicans-house-tariffs-emergency-trump.html"
    },
    {
      "date": "2025-09-15",
      "title": "In Giant Deals, U.A.E. Got Chips, and Trump Team Got Crypto Riches",
      "summary": "A lucrative transaction involving the Trump family’s cryptocurrency firm and an agreement giving the Emiratis access to A.I. chips were connected in ways that have not been previously reported.",
      "url": "https://www.nytimes.com/2025/09/15/us/politics/trump-uae-chips-witkoff-world-liberty.html"
    },
    {
      "date": "2025-09-14",
      "title": "Trump Administration Claims Vast Powers as It Races to Fire Fed Governor Before Meeting",
      "summary": "Trump has forged ahead with his attempts to fire Lisa Cook even as new documents call his claims of mortgage fraud into question.",
      "url": "https://www.nytimes.com/2025/09/14/us/politics/trump-lisa-cook-fed.html"
    },
    {
      "date": "2025-09-13",
      "title": "Trump Escalates Attacks on Political Opponents After Charlie Kirk’s Killing",
      "summary": "President Trump has promised to bring the killer to justice while using the moment to blame the left — and only the left — more broadly.",
      "url": "https://www.nytimes.com/2025/09/13/us/politics/trump-kirk-political-opponents.html"
    },
    {
      "date": "2025-09-12",
      "title": "As Trump Vows Vengeance, Utah’s Governor Calls to Lower the Temperature",
      "summary": "“At some point, we have to find an off-ramp, or it’s going to get much, much worse,” Gov. Spencer Cox, a Republican, said of political violence after a suspect was caught in the assassination of Charlie Kirk.",
      "url": "https://www.nytimes.com/2025/09/12/us/trump-tyler-robinson-utah-shooting.html"
    },
    {
      "date": "2025-09-11",
      "title": "Trump Asks Appeals Court to Allow Firing of Lisa Cook Ahead of Key Fed Meeting",
      "summary": "The government filed an emergency request after a lower court prevented the president from firing Ms. Cook as the case proceeds.",
      "url": "https://www.nytimes.com/live/2025/09/11/us/trump-news/trump-lisa-cook-appeal-fed"
    },
    {
      "date": "2025-09-10",
      "title": "Trump and Leaders Across Political Spectrum React to Charlie Kirk Shooting",
      "summary": "Some politicians called for prayers, while some others immediately cast blame.",
      "url": "https://www.nytimes.com/2025/09/10/us/charlie-kirk-reaction-trump.html"
    },
    {
      "date": "2025-09-09",
      "title": "Michigan Judge Tosses Out Cases Against Fake Trump Electors",
      "summary": "The judge, a Democrat, concluded that fake electors recruited to support Donald J. Trump’s candidacy in 2020 did not understand that they were being asked to do something illegal.",
      "url": "https://www.nytimes.com/2025/09/09/us/politics/michigan-electors-ruling.html"
    },
    {
      "date": "2025-09-08",
      "title": "Trump Says Having ‘a Little Fight With the Wife’ Should Not Count as a Crime",
      "summary": "President Trump said that offenses that happen at home should not undermine his record of crime reduction in Washington.",
      "url": "https://www.nytimes.com/2025/09/08/us/politics/trump-domestic-violence-crime-statistics.html"
    },
    {
      "date": "2025-09-07",
      "title": "Trump Is Met With Mostly Boos at U.S. Open as Security Delays a Match",
      "summary": "With the president in attendance at Arthur Ashe Stadium, the men’s final began as hundreds of people were still waiting to go through security screening.",
      "url": "https://www.nytimes.com/2025/09/07/us/politics/trump-us-open-tennis-boos-delays.html"
    },
    {
      "date": "2025-09-06",
      "title": "Grand Juries in D.C. Reject Wave of Charges Under Trump’s Crackdown",
      "summary": "The persistent rejections suggest that the grand jurors may have had enough of prosecutors seeking harsh charges in a highly politicized environment.",
      "url": "https://www.nytimes.com/2025/09/06/us/trump-dc-national-guard-grand-juries-crime.html"
    },
    {
      "date": "2025-09-05",
      "title": "Second Weak Jobs Report Undercuts Trump’s Claims of a Booming Economy",
      "summary": "After a bad employment report in August, President Trump fired the official in charge of the numbers. This month’s data was just as disappointing.",
      "url": "https://www.nytimes.com/2025/09/05/us/politics/trump-jobs-report-tariffs-deportations.html"
    },
    {
      "date": "2025-09-04",
      "title": "Harvard Won Its Money Back, but Will It Actually Get It?",
      "summary": "A judge ruled that the Trump administration broke the law in canceling billions in federal funds for Harvard. Whether the money is returned matters for the rest of higher education.",
      "url": "https://www.nytimes.com/2025/09/04/us/harvard-federal-funds-court-victory-trump-administration.html"
    },
    {
      "date": "2025-09-04",
      "title": "Sample headline about Trump (demo)",
      "summary": "This is a placeholder. The GitHub Action will replace it with an actual top story once it runs.",
      "url": "https://example.com/source"
    }
  ]
}