{
  "updatedAt": "2025-11-07T20:35:41.155Z",
  "latest": {
    "date": "2025-11-07",
    "title": "Did Trump’s Supreme Court Tariffs Brief Include a Strategic Blunder?",
    "summary": "The justices are generally reluctant to take account of a president’s public statements. But extensive quotes from Mr. Trump in a key filing may change the legal calculus.",
    "url": "https://www.nytimes.com/2025/11/07/us/trump-statements-supreme-court-tariffs.html"
  },
  "archive": [
    {
      "date": "2025-11-06",
      "title": "Trump Team Now Claims Its Trillions in Tariff Revenue Are ‘Incidental’",
      "summary": "In arguments before the Supreme Court, the White House backed away from its claims that President Trump’s tariffs were about raising revenue.",
      "url": "https://www.nytimes.com/2025/11/06/us/politics/trump-tariffs-revenue-supreme-court.html"
    },
    {
      "date": "2025-11-05",
      "title": "Trump Administration Ends Deportation Protections for South Sudanese",
      "summary": "The program was first authorized for South Sudanese nationals in 2011. The Department of Homeland Security said that “renewed peace in South Sudan” and “improved diplomatic relations” justified the move.",
      "url": "https://www.nytimes.com/2025/11/05/us/politics/trump-south-sudan-migrants.html"
    },
    {
      "date": "2025-11-04",
      "title": "Trump Aides Raise Recession Fears, and Point Fingers at the Fed",
      "summary": "Treasury Secretary Scott Bessent said some sectors were in a recession as he argued for more interest rate cuts.",
      "url": "https://www.nytimes.com/2025/11/04/us/politics/trump-aides-recession-fears-federal-reserve.html"
    },
    {
      "date": "2025-11-03",
      "title": "WIC Food Aid Program for Families Gets Funding Stopgap",
      "summary": "An injection of $450 million for WIC comes as the Trump administration announced it would only fund partial benefits for another food aid program, the Supplemental Nutrition Assistance Program, or SNAP, for November.",
      "url": "https://www.nytimes.com/2025/11/03/us/politics/wic-snap-food-aid.html"
    },
    {
      "date": "2025-11-02",
      "title": "‘Keep Listening’: An Undecided Republican Lawmaker Weighs New Voting Maps",
      "summary": "As redistricting efforts spread across the country, an Indiana state senator said he isn’t sure how he will vote on a plan that President Trump supports.",
      "url": "https://www.nytimes.com/2025/11/02/us/indiana-redistricting-terre-haute.html"
    },
    {
      "date": "2025-11-01",
      "title": "Trump’s Team Offers to Keep Some Ballroom Donors Incognito",
      "summary": "Many corporate interests that have donated to the president’s pet project have business before his administration.",
      "url": "https://www.nytimes.com/2025/11/01/us/politics/trumps-team-offers-to-keep-some-ballroom-donors-incognito.html"
    },
    {
      "date": "2025-10-31",
      "title": "Democrats Ride Anti-Trump Message in Final Days of California Campaign",
      "summary": "Proponents say voters are motivated by stopping President Trump. Republicans have already begun pointing fingers over lackluster fund-raising and coordination.",
      "url": "https://www.nytimes.com/2025/10/31/us/politics/california-redistricting-proposition-50-trump.html"
    },
    {
      "date": "2025-10-30",
      "title": "Democrats Condemn Trump Officials for Boat Strike Secrecy",
      "summary": "Senator Mark Warner said the administration’s decision to hold a Republicans-only briefing on the campaign was “corrosive to our democracy.”",
      "url": "https://www.nytimes.com/2025/10/30/us/politics/trump-democrats-boat-strikes.html"
    },
    {
      "date": "2025-10-29",
      "title": "Sanctions Lifted on a Putin-Backed Autocrat After Lobbying by Trump Allies",
      "summary": "The move benefits the Serbian politician Milorad Dodik, who had received support from Rudolph W. Giuliani, Michael T. Flynn, Laura Loomer and high-priced lobbyists.",
      "url": "https://www.nytimes.com/2025/10/29/us/politics/milorad-dodik-sanctions-trump.html"
    },
    {
      "date": "2025-10-28",
      "title": "Mike Johnson Dismisses Trump Third Term Talk — But Applauds the ‘Trolling’",
      "summary": "The speaker said he did not see a path to amending the Constitution to allow the president to seek a third term, but that it was fun to pretend he could to inflame Democrats.",
      "url": "https://www.nytimes.com/2025/10/28/us/politics/johnson-trump-2028-constitution.html"
    },
    {
      "date": "2025-10-27",
      "title": "Trump Asks Supreme Court to Let Him Fire the Top Copyright Official",
      "summary": "An appeals court sided with the director of the U.S. Copyright Office, saying her role is to work with Congress.",
      "url": "https://www.nytimes.com/2025/10/27/us/politics/trump-supreme-court-copyright-official.html"
    },
    {
      "date": "2025-10-26",
      "title": "How Canada Is Dealing With Its Latest Tussle With President Trump",
      "summary": "Prime Minister Mark Carney is focusing on what the country can control, including looking for economic partnerships abroad, especially in Asia.",
      "url": "https://www.nytimes.com/2025/10/26/us/politics/canada-tariffs-trump-carney.html"
    },
    {
      "date": "2025-10-25",
      "title": "Timothy Mellon Is Donor Who Gave $130 Million to Pay Troops During Shutdown",
      "summary": "Timothy Mellon is a billionaire and a major financial backer of President Trump.",
      "url": "https://www.nytimes.com/2025/10/25/us/politics/timothy-mellon-donation-troops.html"
    },
    {
      "date": "2025-10-24",
      "title": "Trump to Use $130 Million Donation to Help Pay Troops",
      "summary": "It is not clear how far the gift will go toward covering the salaries of the nation’s 1.3 million troops.",
      "url": "https://www.nytimes.com/2025/10/24/us/politics/trump-military-pay-donation.html"
    },
    {
      "date": "2025-10-23",
      "title": "A Pile of Rubble: After 123 Years, the East Wing Is Gone",
      "summary": "Mourners are outraged over President Trump’s demolition of the East Wing to make way for his $300 million ballroom. Others say it was time for change.",
      "url": "https://www.nytimes.com/2025/10/23/us/politics/east-wing-obituary.html"
    },
    {
      "date": "2025-10-22",
      "title": "Trump Is Demolishing the White House’s East Wing to Make Way for His Ballroom",
      "summary": "President Trump initially said the construction would not touch the East Wing or “interfere with the current building.”",
      "url": "https://www.nytimes.com/2025/10/22/us/politics/east-wing-white-house-demolition-trump.html"
    },
    {
      "date": "2025-10-21",
      "title": "Jack Smith’s lawyers say he never wiretapped or surveilled lawmakers.",
      "summary": "Lawyers for the special counsel, who investigated Donald J. Trump, denied accusations by Republican lawmakers that he had surveilled or spied on senators as part of his inquiry.",
      "url": "https://www.nytimes.com/2025/10/21/us/politics/jack-smith-phone-records-republicans.html"
    },
    {
      "date": "2025-10-20",
      "title": "Appeals Court Ruling Allows Trump to Deploy National Guard Troops to Portland",
      "summary": "Deployment can move forward, for now, under a preliminary ruling by the U.S. Court of Appeals for the Ninth Circuit. But legal wrangling will likely continue.",
      "url": "https://www.nytimes.com/2025/10/20/us/appeals-court-national-guard-troops-portland-trump.html"
    },
    {
      "date": "2025-10-19",
      "title": "U.S. Kills 3 on Boat Suspected of Smuggling Drugs for Colombian Rebels",
      "summary": "It was the seventh known strike in President Trump’s military campaign of attacking, rather than arresting, those suspected of running drugs in the Caribbean.",
      "url": "https://www.nytimes.com/2025/10/19/us/politics/trump-military-boat-strike-colombia.html"
    },
    {
      "date": "2025-10-18",
      "title": "U.S. Is Repatriating Survivors of Its Strike on Suspected Drug Vessel",
      "summary": "Two men rescued by the U.S. military after it attacked a boat in the Caribbean Sea were being sent to their home countries of Colombia and Ecuador, President Trump said.",
      "url": "https://www.nytimes.com/2025/10/18/us/politics/boat-strike-survivors.html"
    },
    {
      "date": "2025-10-17",
      "title": "Benioff Apologizes for Saying Trump Should Send Troops to San Francisco",
      "summary": "Marc Benioff, the chief executive of Salesforce, said he no longer believed that National Guard troops were needed in the city.",
      "url": "https://www.nytimes.com/2025/10/17/us/benioff-apologizes-san-francisco.html"
    },
    {
      "date": "2025-10-16",
      "title": "Terrorism Charges Against Antifa ‘Cell’ Show Administration’s Focus on the Left",
      "summary": "President Trump has spoken at times of antifa as though it were a clear-cut extremist organization, but the movement is a decentralized collection of loosely affiliated groups.",
      "url": "https://www.nytimes.com/2025/10/16/us/politics/justice-department-terrorism-antifa.html"
    },
    {
      "date": "2025-10-15",
      "title": "Trump Signs Memo Expanding His Authority to Spend Federal Money",
      "summary": "The president gave Defense Secretary Pete Hegseth wide authority to repurpose funds to pay members of the military without approval from Congress, which has the sole constitutional authority to decide federal spending.",
      "url": "https://www.nytimes.com/2025/10/15/us/politics/trump-federal-funds-government-shutdown.html"
    },
    {
      "date": "2025-10-14",
      "title": "U.S. Military Kills 6 People in Boat Attack Near Venezuela, Trump Says",
      "summary": "In a social media post, the president said the people aboard a boat were suspected of smuggling drugs for an unspecified group his team had labeled terrorists.",
      "url": "https://www.nytimes.com/2025/10/14/us/politics/trump-drugs-boat-attack.html"
    },
    {
      "date": "2025-10-13",
      "title": "Part Enabler, Part Buffer: The Bind of the Justice Dept.’s No. 2",
      "summary": "Todd Blanche, the deputy attorney general, has helped usher in President Trump’s retribution campaign. But he faces anger on the right for resisting some of the most extreme measures.",
      "url": "https://www.nytimes.com/2025/10/13/us/politics/todd-blanche-justice-department-trump.html"
    },
    {
      "date": "2025-10-12",
      "title": "Why Now? The Lost Chances to Reach a Hostage Deal, and a Cease-Fire, Months Ago",
      "summary": "On Gaza, President Trump put few, if any, guardrails on Israel’s offensive, bucking international demands for a cease-fire. Then he changed course.",
      "url": "https://www.nytimes.com/2025/10/12/us/politics/lost-chances-hostage-deal-gaza-israel.html"
    },
    {
      "date": "2025-10-11",
      "title": "Among Portland Protests, It’s Frogs and Sharks and Bears, Oh My.",
      "summary": "Images of anarchists clad in black gave the city a bad name in 2020. Now, demonstrators in Portland are poking fun at President Trump’s apocalyptic talk with colorful animal suits.",
      "url": "https://www.nytimes.com/2025/10/11/us/politics/portland-protests.html"
    },
    {
      "date": "2025-10-10",
      "title": "Judge Orders ICE to Remove Fence Around Facility Near Chicago",
      "summary": "The judge’s decision is the third in three days in Illinois against the Trump administration. It came after ICE said its Operation Midway Blitz would continue indefinitely.",
      "url": "https://www.nytimes.com/2025/10/10/us/politics/ice-national-guard.html"
    },
    {
      "date": "2025-10-09",
      "title": "Appellate Judges Appear Open to Allowing National Guard Troops to Deploy to Portland",
      "summary": "Three judges from the U.S. Court of Appeals for the Ninth Circuit are reviewing an order blocking President Trump from deploying National Guard soldiers in the city.",
      "url": "https://www.nytimes.com/2025/10/09/us/national-guard-portland-appeals-court-hearing.html"
    },
    {
      "date": "2025-10-08",
      "title": "A Chicago federal grand jury deals the latest setback to Trump’s immigration enforcement efforts.",
      "summary": "",
      "url": "https://www.nytimes.com/live/2025/10/08/us/trump-national-guard-chicago-illinois/a-chicago-federal-grand-jury-deals-the-latest-setback-to-trumps-immigration-enforcement-efforts"
    }
  ]
}