[
  {
    "headline": "Asylum hotel ruling won't feel like much of a victory at Home Office",
    "summary": "The government avoids having its asylum policy thrown into chaos but the court ruling is a gift for its opponents.",
    "url": "https://www.bbc.com/news/articles/c7vlpdqeg4qo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Tories call for investigation into Rayner's tax affairs",
    "summary": "The deputy prime minister's spokesperson says she paid the relevant tax when buying her Hove flat.",
    "url": "https://www.bbc.com/news/articles/cjw6evl4zy8o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Ministers didn't do cost review of council mergers",
    "summary": "The government relied on a report by a lobbyist group that now says reorganisation could make no savings.",
    "url": "https://www.bbc.com/news/articles/cj9wxnlnrxdo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Home Office set to pull 'balloon-craft' job at migrant detention centre",
    "summary": "Minister Seema Malhotra has called on the contractor to remove the jobs at the immigration removal centre.",
    "url": "https://www.bbc.com/news/articles/c0qlxxxpq35o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "MSP denies hiding camera in Scottish Parliament toilet",
    "summary": "South Scotland MSP Colin Smyth was earlier suspended by Labour over charges of possessing indecent child images.",
    "url": "https://www.bbc.com/news/articles/c9qyzlqvjnwo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Tories win Broxtowe by-election by five votes",
    "summary": "Judy Couch won the Nuthall East and Strelley seat with 405 votes.",
    "url": "https://www.bbc.com/news/articles/c8de3507lp5o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Ed Davey to boycott Trump state banquet over Gaza",
    "summary": "The Lib Dem leader says he wants to send the president a message that he has the power to end the crisis.",
    "url": "https://www.bbc.com/news/articles/crlz6rp2ln8o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Clarkson for PM, attacks on police dogs: Do Parliament petitions make a difference?",
    "summary": "People love signing petitions to get issues they care about debated by MPs - but some can't resist having a laugh.",
    "url": "https://www.bbc.com/news/articles/cg4xqn91rwlo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Suranne Jones: Playing the prime minister changes your perception of politics",
    "summary": "Suranne Jones plays the Prime Minister whose husband is kidnapped in new political thriller, Hostage.",
    "url": "https://www.bbc.com/news/articles/cy5p7ze0ww4o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Asylum hotel ruling leaves ministers with major headache",
    "summary": "The government will now have to find new places to house asylum seekers, while hoping other areas don't take similar legal action.",
    "url": "https://www.bbc.com/news/articles/cy40wx73mwzo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Starmer hails breakthrough on Ukraine - but anxiety over its future remains",
    "summary": "Donald Trump's commitment to Ukraine's security is key to a lasting peace, the UK prime minister says.",
    "url": "https://www.bbc.com/news/articles/cr5rl6y04z0o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Chris Mason: Trump visit provides Starmer with invaluable access",
    "summary": "The PM's time with the president helped burnish a relationship as solid as it is improbable.",
    "url": "https://www.bbc.com/news/articles/cdrkj4nvy22o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Who is in charge? The prime minister's authority is in question again",
    "summary": "It's been a week of dismissals, disagreements and backbench bust-ups, writes Laura Kuenssberg.",
    "url": "https://www.bbc.com/news/articles/czxwe3g4wl5o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "DSEI UK 2025: preparing the future force, today",
    "summary": "This September, Excel London will host DSEI UK, the global hub for defence and security innovation. Over four days, more than 50,000 participants, from Ministers and military leaders to industry innovators and academic researchers, will converge to exchange ideas, explore cutting-edge technology, and foster partners…",
    "url": "https://www.politico.eu/sponsored-content/dsei-uk-2025-preparing-the-future-force-today/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
    "source": "politico.eu"
  },
  {
    "headline": "Зеленський про нову атаку на Харків: В України недостатньо ППО, і це – слабкість світу",
    "summary": "На тлі нової жорстокої атаки на Харків та область президент Володимир Зеленський закликав світових лідерів до більшої рішучості у протидії російському терору, зокрема - дозволити Україні ефективно знищувати пускові установки ворога на території РФ.",
    "url": "http://www.pravda.com.ua/news/2024/05/23/7457231/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "Після придбання облігацій на 1 трильйон в уряді нагадали, як їх купити в Дії",
    "summary": "Після придбання облігацій на 1 трильйон в уряді нагадали, як їх купити в Дії",
    "url": "https://www.epravda.com.ua/news/2024/05/23/714114/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "Рада призначила суддею Конституційного суду проректора ЛНУ",
    "summary": "Верховна Рада призначила за своєю квотою Сергія Різника суддею Конституційного суду України. Джерело: народний депутат Ярослав Железняк у Telegram, \"Інтерфакс-Україна\" Пряма мова Железняка: \"Парламент призначив суддею Конституційного Суду.",
    "url": "http://www.pravda.com.ua/news/2024/05/23/7457230/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "Путін вирушив до Білорусі на зустріч з Лукашенком",
    "summary": "Очільник Росії Володимир Путін 23 травня відвідає Білорусь і ввечері зустрінеться в Мінську з самопроголошеним президентом Білорусії Олександром Лукашенком. Джерело: російський \"Інтерфакс\", який цитує прес-секретаря Путіна Дмитра Пєскова Деталі: За словами Пєскова 23 травня очікується \"велике спілкування\" Путіна і Л…",
    "url": "http://www.pravda.com.ua/news/2024/05/23/7457226/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "Лукашенко змінив начальника Генерального штабу Збройних сил Білорусі",
    "summary": "Самопроголошений президент Білорусі Олександр Лукашенко призначив новим начальником Генерального штабу країни та першим заступником міністра Павла Муравейка. Джерело: провладне інформагентство \"Белта\" Деталі: Повідомляється, що до теперішнього часу Муравейко обіймав посаду першого заступника державного секретаря Рад…",
    "url": "http://www.pravda.com.ua/news/2024/05/23/7457220/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "\"Саакашвілі проти Грузії\": колишній президент програв справу в ЄСПЛ",
    "summary": "23 травня Європейський суд з прав людини (ЄСПЛ) повідомив, що не знайшли підстав для сумнівів у справедливості кримінального провадження проти колишнього президента Грузії Міхеїла Саакашвілі. Джерело: \"Європейська правда\" з посиланням на рішення суду Деталі: Справа \"Саакашвілі проти Грузії\" (заяви № 6232/20 та № 223…",
    "url": "http://www.pravda.com.ua/news/2024/05/23/7457219/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "Венс каже, що готовий стати президентом США",
    "summary": "Віцепрезидент США Джей Ді Венс заявив, що в разі необхідності готовий виконувати повноваження президента Дональда Трампа, якщо з ним щось трапиться.",
    "url": "https://www.eurointegration.com.ua/news/2025/08/29/7219089/",
    "source": "eurointegration.com.ua"
  },
  {
    "headline": "3350 ракет від США, президент Португалії \"наїхав\" на Трампа, ідея буферної зони: новини дня",
    "summary": "У США схвалили продаж Україні тисяч ракет із супутнім обладнанням, які можуть надійти вже цього року.",
    "url": "https://www.eurointegration.com.ua/news/2025/08/29/7219088/",
    "source": "eurointegration.com.ua"
  },
  {
    "headline": "FT: Трамп пропонував розгорнути китайські війська як миротворців в Україні",
    "summary": "Президент США Дональд Трамп нібито запропонував розгорнути китайські війська як миротворців в Україні після припинення повномасштабної російської агресії.",
    "url": "https://www.eurointegration.com.ua/news/2025/08/29/7219087/",
    "source": "eurointegration.com.ua"
  },
  {
    "headline": "Макрон: Трамп не може залишити без реакції ухиляння Путіна від зустрічі із Зеленським",
    "summary": "Президент Франції Емманюель Макрон вважає, що якщо очільник Кремля продовжить ухилятися від зустрічі з президентом України, на яку погодився під час саміту з Трампом – це те, що американський президент не може залишити без реакції.",
    "url": "https://www.eurointegration.com.ua/news/2025/08/29/7219086/",
    "source": "eurointegration.com.ua"
  }
]