[
  {
    "headline": "Jones gets new role as Starmer revamps No 10 team",
    "summary": "Jones, who has been deputy to Rachel Reeves at the Treasury, becomes chief secretary to the Prime Minister.",
    "url": "https://www.bbc.com/news/articles/ce93k7l0zpro?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "UK to tighten family member rules for asylum cases",
    "summary": "Yvette Cooper will outline her plans when MPs return to Parliament after the summer break.",
    "url": "https://www.bbc.com/news/articles/c626p66d6jxo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Minister warns parents on school attendance ahead of new term",
    "summary": "It comes as data shows children who missed some of the first week of school were more likely to be persistently absent.",
    "url": "https://www.bbc.com/news/articles/cg7jk3rr225o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Asylum hotel ruling won't feel like much of a victory at Home Office",
    "summary": "The government avoids having its asylum policy thrown into chaos but the court ruling is a gift for its opponents.",
    "url": "https://www.bbc.com/news/articles/c7vlpdqeg4qo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Tories call for investigation into Rayner's tax affairs",
    "summary": "The deputy prime minister's spokesperson says she paid the relevant tax when buying her Hove flat.",
    "url": "https://www.bbc.com/news/articles/cjw6evl4zy8o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Ministers didn't do cost review of council mergers",
    "summary": "The government relied on a report by a lobbyist group that now says reorganisation could make no savings.",
    "url": "https://www.bbc.com/news/articles/cj9wxnlnrxdo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Home Office set to pull 'balloon-craft' job at migrant detention centre",
    "summary": "Minister Seema Malhotra has called on the contractor to remove the jobs at the immigration removal centre.",
    "url": "https://www.bbc.com/news/articles/c0qlxxxpq35o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "MSP denies hiding camera in Scottish Parliament toilet",
    "summary": "South Scotland MSP Colin Smyth was earlier suspended by Labour over charges of possessing indecent child images.",
    "url": "https://www.bbc.com/news/articles/c9qyzlqvjnwo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Tories win Broxtowe by-election by five votes",
    "summary": "Judy Couch won the Nuthall East and Strelley seat with 405 votes.",
    "url": "https://www.bbc.com/news/articles/c8de3507lp5o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Clarkson for PM, attacks on police dogs: Do Parliament petitions make a difference?",
    "summary": "People love signing petitions to get issues they care about debated by MPs - but some can't resist having a laugh.",
    "url": "https://www.bbc.com/news/articles/cg4xqn91rwlo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Suranne Jones: Playing the prime minister changes your perception of politics",
    "summary": "Suranne Jones plays the Prime Minister whose husband is kidnapped in new political thriller, Hostage.",
    "url": "https://www.bbc.com/news/articles/cy5p7ze0ww4o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Asylum hotel ruling leaves ministers with major headache",
    "summary": "The government will now have to find new places to house asylum seekers, while hoping other areas don't take similar legal action.",
    "url": "https://www.bbc.com/news/articles/cy40wx73mwzo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Starmer hails breakthrough on Ukraine - but anxiety over its future remains",
    "summary": "Donald Trump's commitment to Ukraine's security is key to a lasting peace, the UK prime minister says.",
    "url": "https://www.bbc.com/news/articles/cr5rl6y04z0o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Chris Mason: Trump visit provides Starmer with invaluable access",
    "summary": "The PM's time with the president helped burnish a relationship as solid as it is improbable.",
    "url": "https://www.bbc.com/news/articles/cdrkj4nvy22o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Who is in charge? The prime minister's authority is in question again",
    "summary": "It's been a week of dismissals, disagreements and backbench bust-ups, writes Laura Kuenssberg.",
    "url": "https://www.bbc.com/news/articles/czxwe3g4wl5o?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "MSP accused of hiding camera in parliament toilet",
    "summary": "The MSP said he was \"fully co-operating\" with officers and is due to appear at court at a later date.",
    "url": "https://www.bbc.com/news/videos/cpwyg795wpwo?at_medium=RSS&at_campaign=rss",
    "source": "feeds.bbci.co.uk"
  },
  {
    "headline": "Costa breaks ranks on EU-US trade deal, fires warning shot at Trump",
    "summary": "The European Council president appears to admit the war in Ukraine was a factor in accepting the bloc's lopsided pact with Washington.",
    "url": "https://www.politico.eu/article/antonio-costa-eu-us-trade-deal-warning-shots-donald-trump/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
    "source": "politico.eu"
  },
  {
    "headline": "Von der Leyen’s plane hit by suspected Russian GPS jamming",
    "summary": "Commission president was on a tour of frontline states when her plane was the target of interference.",
    "url": "https://www.politico.eu/article/ursula-von-der-leyen-plane-hit-by-gps-jamming-russia/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
    "source": "politico.eu"
  },
  {
    "headline": "Ukrainian police say Russia linked to murder of former parliament speaker",
    "summary": "Authorities have arrested a suspect in the killing of Andriy Parubiy, a prominent politician who played a major role in Ukraine’s pro-Western Euromaidan Revolution.",
    "url": "https://www.politico.eu/article/police-arrest-ukraine-ex-parliament-speaker-murder-suspect-claims-russian-trace-behind-andriy-parubiy/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
    "source": "politico.eu"
  },
  {
    "headline": "What’s behind Starmer’s reset?",
    "summary": "As MPs return to Westminster for a packed autumn term, will the prime minister be back with a bang? Sky News&#8217; Sam Coates and Politico&#8217;s Anne McElvoy discuss Keir Starmer&#8217;s priorities as the so-called &#8220;reset week&#8221; begins. There&#8217;s chatter around No 10 of a staffing restructure but c…",
    "url": "https://www.politico.eu/podcast/politics-at-sam-and-annes/whats-behind-starmers-reset/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
    "source": "politico.eu"
  },
  {
    "headline": "Зеленський про нову атаку на Харків: В України недостатньо ППО, і це – слабкість світу",
    "summary": "На тлі нової жорстокої атаки на Харків та область президент Володимир Зеленський закликав світових лідерів до більшої рішучості у протидії російському терору, зокрема - дозволити Україні ефективно знищувати пускові установки ворога на території РФ.",
    "url": "http://www.pravda.com.ua/news/2024/05/23/7457231/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "Після придбання облігацій на 1 трильйон в уряді нагадали, як їх купити в Дії",
    "summary": "Після придбання облігацій на 1 трильйон в уряді нагадали, як їх купити в Дії",
    "url": "https://www.epravda.com.ua/news/2024/05/23/714114/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "Рада призначила суддею Конституційного суду проректора ЛНУ",
    "summary": "Верховна Рада призначила за своєю квотою Сергія Різника суддею Конституційного суду України. Джерело: народний депутат Ярослав Железняк у Telegram, \"Інтерфакс-Україна\" Пряма мова Железняка: \"Парламент призначив суддею Конституційного Суду.",
    "url": "http://www.pravda.com.ua/news/2024/05/23/7457230/",
    "source": "pravda.com.ua"
  },
  {
    "headline": "Путін вирушив до Білорусі на зустріч з Лукашенком",
    "summary": "Очільник Росії Володимир Путін 23 травня відвідає Білорусь і ввечері зустрінеться в Мінську з самопроголошеним президентом Білорусії Олександром Лукашенком. Джерело: російський \"Інтерфакс\", який цитує прес-секретаря Путіна Дмитра Пєскова Деталі: За словами Пєскова 23 травня очікується \"велике спілкування\" Путіна і Л…",
    "url": "http://www.pravda.com.ua/news/2024/05/23/7457226/",
    "source": "pravda.com.ua"
  }
]